var _locations = [
  {
    "id": "1",
    "cname": "中国",
    "pid": "",
    "childrens": [
      {
        "id": "1034",
        "cname": "安徽",
        "pid": "1",
        "childrens": [
          {
            "id": "1086",
            "cname": "安庆",
            "pid": "1034",
            "childrens": [
              {
                "id": "1091",
                "cname": "枞阳县",
                "pid": "1086"
              },
              {
                "id": "1088",
                "cname": "大观区",
                "pid": "1086"
              },
              {
                "id": "1090",
                "cname": "怀宁县",
                "pid": "1086"
              },
              {
                "id": "1092",
                "cname": "潜山县",
                "pid": "1086"
              },
              {
                "id": "1094",
                "cname": "宿松县",
                "pid": "1086"
              },
              {
                "id": "1093",
                "cname": "太湖县",
                "pid": "1086"
              },
              {
                "id": "1097",
                "cname": "桐城市",
                "pid": "1086"
              },
              {
                "id": "1095",
                "cname": "望江县",
                "pid": "1086"
              },
              {
                "id": "1087",
                "cname": "迎江区",
                "pid": "1086"
              },
              {
                "id": "1089",
                "cname": "宜秀区",
                "pid": "1086"
              },
              {
                "id": "1096",
                "cname": "岳西县",
                "pid": "1086"
              },
              {
                "id": "100310",
                "cname": "其他",
                "pid": "1086"
              }
            ]
          },
          {
            "id": "1054",
            "cname": "蚌埠",
            "pid": "1034",
            "childrens": [
              {
                "id": "1056",
                "cname": "蚌山区",
                "pid": "1054"
              },
              {
                "id": "1061",
                "cname": "固镇县",
                "pid": "1054"
              },
              {
                "id": "1058",
                "cname": "淮上区",
                "pid": "1054"
              },
              {
                "id": "1059",
                "cname": "怀远县",
                "pid": "1054"
              },
              {
                "id": "1055",
                "cname": "龙子湖区",
                "pid": "1054"
              },
              {
                "id": "1060",
                "cname": "五河县",
                "pid": "1054"
              },
              {
                "id": "1057",
                "cname": "禹会区",
                "pid": "1054"
              },
              {
                "id": "100176",
                "cname": "其他",
                "pid": "1054"
              }
            ]
          },
          {
            "id": "1138",
            "cname": "亳州",
            "pid": "1034",
            "childrens": [
              {
                "id": "1142",
                "cname": "利辛县",
                "pid": "1138"
              },
              {
                "id": "1141",
                "cname": "蒙城县",
                "pid": "1138"
              },
              {
                "id": "1139",
                "cname": "谯城区",
                "pid": "1138"
              },
              {
                "id": "1140",
                "cname": "涡阳县",
                "pid": "1138"
              },
              {
                "id": "100544",
                "cname": "其他",
                "pid": "1138"
              }
            ]
          },
          {
            "id": "1106",
            "cname": "滁州",
            "pid": "1034",
            "childrens": [
              {
                "id": "1111",
                "cname": "定远县",
                "pid": "1106"
              },
              {
                "id": "1112",
                "cname": "凤阳县",
                "pid": "1106"
              },
              {
                "id": "1107",
                "cname": "琅琊区",
                "pid": "1106"
              },
              {
                "id": "1109",
                "cname": "来安县",
                "pid": "1106"
              },
              {
                "id": "1114",
                "cname": "明光市",
                "pid": "1106"
              },
              {
                "id": "1108",
                "cname": "南谯区",
                "pid": "1106"
              },
              {
                "id": "1110",
                "cname": "全椒县",
                "pid": "1106"
              },
              {
                "id": "1113",
                "cname": "天长市",
                "pid": "1106"
              },
              {
                "id": "100386",
                "cname": "其他",
                "pid": "1106"
              }
            ]
          },
          {
            "id": "1143",
            "cname": "池州",
            "pid": "1034",
            "childrens": [
              {
                "id": "1145",
                "cname": "东至县",
                "pid": "1143"
              },
              {
                "id": "1144",
                "cname": "贵池区",
                "pid": "1143"
              },
              {
                "id": "1147",
                "cname": "青阳县",
                "pid": "1143"
              },
              {
                "id": "1146",
                "cname": "石台县",
                "pid": "1143"
              },
              {
                "id": "100388",
                "cname": "其他",
                "pid": "1143"
              }
            ]
          },
          {
            "id": "1115",
            "cname": "阜阳",
            "pid": "1034",
            "childrens": [
              {
                "id": "1121",
                "cname": "阜南县",
                "pid": "1115"
              },
              {
                "id": "1123",
                "cname": "界首市",
                "pid": "1115"
              },
              {
                "id": "1119",
                "cname": "临泉县",
                "pid": "1115"
              },
              {
                "id": "1120",
                "cname": "太和县",
                "pid": "1115"
              },
              {
                "id": "1116",
                "cname": "颍州区",
                "pid": "1115"
              },
              {
                "id": "1117",
                "cname": "颍东区",
                "pid": "1115"
              },
              {
                "id": "1118",
                "cname": "颍泉区",
                "pid": "1115"
              },
              {
                "id": "1122",
                "cname": "颍上县",
                "pid": "1115"
              },
              {
                "id": "100448",
                "cname": "其他",
                "pid": "1115"
              }
            ]
          },
          {
            "id": "1035",
            "cname": "合肥",
            "pid": "1034",
            "childrens": [
              {
                "id": "1039",
                "cname": "包河区",
                "pid": "1035"
              },
              {
                "id": "1040",
                "cname": "长丰县",
                "pid": "1035"
              },
              {
                "id": "1044",
                "cname": "巢湖市",
                "pid": "1035"
              },
              {
                "id": "1041",
                "cname": "肥东县",
                "pid": "1035"
              },
              {
                "id": "1042",
                "cname": "肥西县",
                "pid": "1035"
              },
              {
                "id": "1037",
                "cname": "庐阳区",
                "pid": "1035"
              },
              {
                "id": "1043",
                "cname": "庐江县",
                "pid": "1035"
              },
              {
                "id": "1038",
                "cname": "蜀山区",
                "pid": "1035"
              },
              {
                "id": "1036",
                "cname": "瑶海区",
                "pid": "1035"
              },
              {
                "id": "100175",
                "cname": "其他",
                "pid": "1035"
              }
            ]
          },
          {
            "id": "1062",
            "cname": "淮南",
            "pid": "1034",
            "childrens": [
              {
                "id": "1066",
                "cname": "八公山区",
                "pid": "1062"
              },
              {
                "id": "1063",
                "cname": "大通区",
                "pid": "1062"
              },
              {
                "id": "1068",
                "cname": "凤台县",
                "pid": "1062"
              },
              {
                "id": "1067",
                "cname": "潘集区",
                "pid": "1062"
              },
              {
                "id": "1064",
                "cname": "田家庵区",
                "pid": "1062"
              },
              {
                "id": "1065",
                "cname": "谢家集区",
                "pid": "1062"
              },
              {
                "id": "100177",
                "cname": "其他",
                "pid": "1062"
              }
            ]
          },
          {
            "id": "1076",
            "cname": "淮北",
            "pid": "1034",
            "childrens": [
              {
                "id": "1077",
                "cname": "杜集区",
                "pid": "1076"
              },
              {
                "id": "1079",
                "cname": "烈山区",
                "pid": "1076"
              },
              {
                "id": "1080",
                "cname": "濉溪县",
                "pid": "1076"
              },
              {
                "id": "1078",
                "cname": "相山区",
                "pid": "1076"
              },
              {
                "id": "100385",
                "cname": "其他",
                "pid": "1076"
              }
            ]
          },
          {
            "id": "1098",
            "cname": "黄山",
            "pid": "1034",
            "childrens": [
              {
                "id": "1100",
                "cname": "黄山区",
                "pid": "1098"
              },
              {
                "id": "1101",
                "cname": "徽州区",
                "pid": "1098"
              },
              {
                "id": "1105",
                "cname": "祁门县",
                "pid": "1098"
              },
              {
                "id": "1099",
                "cname": "屯溪区",
                "pid": "1098"
              },
              {
                "id": "1102",
                "cname": "歙县",
                "pid": "1098"
              },
              {
                "id": "1103",
                "cname": "休宁县",
                "pid": "1098"
              },
              {
                "id": "1104",
                "cname": "黟县",
                "pid": "1098"
              },
              {
                "id": "100502",
                "cname": "其他",
                "pid": "1098"
              }
            ]
          },
          {
            "id": "1130",
            "cname": "六安",
            "pid": "1034",
            "childrens": [
              {
                "id": "1134",
                "cname": "霍邱县",
                "pid": "1130"
              },
              {
                "id": "1137",
                "cname": "霍山县",
                "pid": "1130"
              },
              {
                "id": "1131",
                "cname": "金安区",
                "pid": "1130"
              },
              {
                "id": "1136",
                "cname": "金寨县",
                "pid": "1130"
              },
              {
                "id": "1133",
                "cname": "寿县",
                "pid": "1130"
              },
              {
                "id": "1135",
                "cname": "舒城县",
                "pid": "1130"
              },
              {
                "id": "1132",
                "cname": "裕安区",
                "pid": "1130"
              },
              {
                "id": "100503",
                "cname": "其他",
                "pid": "1130"
              }
            ]
          },
          {
            "id": "1069",
            "cname": "马鞍山",
            "pid": "1034",
            "childrens": [
              {
                "id": "1072",
                "cname": "博望区",
                "pid": "1069"
              },
              {
                "id": "1073",
                "cname": "当涂县",
                "pid": "1069"
              },
              {
                "id": "1070",
                "cname": "花山区",
                "pid": "1069"
              },
              {
                "id": "1074",
                "cname": "含山县",
                "pid": "1069"
              },
              {
                "id": "1075",
                "cname": "和县",
                "pid": "1069"
              },
              {
                "id": "1071",
                "cname": "雨山区",
                "pid": "1069"
              },
              {
                "id": "100178",
                "cname": "其他",
                "pid": "1069"
              }
            ]
          },
          {
            "id": "1124",
            "cname": "宿州",
            "pid": "1034",
            "childrens": [
              {
                "id": "1126",
                "cname": "砀山县",
                "pid": "1124"
              },
              {
                "id": "1128",
                "cname": "灵璧县",
                "pid": "1124"
              },
              {
                "id": "1129",
                "cname": "泗县",
                "pid": "1124"
              },
              {
                "id": "1127",
                "cname": "萧县",
                "pid": "1124"
              },
              {
                "id": "1125",
                "cname": "埇桥区",
                "pid": "1124"
              },
              {
                "id": "100387",
                "cname": "其他",
                "pid": "1124"
              }
            ]
          },
          {
            "id": "1081",
            "cname": "铜陵",
            "pid": "1034",
            "childrens": [
              {
                "id": "1084",
                "cname": "郊区",
                "pid": "1081"
              },
              {
                "id": "1083",
                "cname": "狮子山区",
                "pid": "1081"
              },
              {
                "id": "1082",
                "cname": "铜官山区",
                "pid": "1081"
              },
              {
                "id": "1085",
                "cname": "铜陵县",
                "pid": "1081"
              },
              {
                "id": "100527",
                "cname": "其他",
                "pid": "1081"
              }
            ]
          },
          {
            "id": "1045",
            "cname": "芜湖",
            "pid": "1034",
            "childrens": [
              {
                "id": "1051",
                "cname": "繁昌县",
                "pid": "1045"
              },
              {
                "id": "1046",
                "cname": "镜湖区",
                "pid": "1045"
              },
              {
                "id": "1048",
                "cname": "鸠江区",
                "pid": "1045"
              },
              {
                "id": "1052",
                "cname": "南陵县",
                "pid": "1045"
              },
              {
                "id": "1049",
                "cname": "三山区",
                "pid": "1045"
              },
              {
                "id": "1050",
                "cname": "芜湖县",
                "pid": "1045"
              },
              {
                "id": "1053",
                "cname": "无为县",
                "pid": "1045"
              },
              {
                "id": "1047",
                "cname": "弋江区",
                "pid": "1045"
              },
              {
                "id": "100447",
                "cname": "其他",
                "pid": "1045"
              }
            ]
          },
          {
            "id": "1148",
            "cname": "宣城",
            "pid": "1034",
            "childrens": [
              {
                "id": "1151",
                "cname": "广德县",
                "pid": "1148"
              },
              {
                "id": "1152",
                "cname": "泾县",
                "pid": "1148"
              },
              {
                "id": "1153",
                "cname": "绩溪县",
                "pid": "1148"
              },
              {
                "id": "1154",
                "cname": "旌德县",
                "pid": "1148"
              },
              {
                "id": "1150",
                "cname": "郎溪县",
                "pid": "1148"
              },
              {
                "id": "1155",
                "cname": "宁国市",
                "pid": "1148"
              },
              {
                "id": "1149",
                "cname": "宣州区",
                "pid": "1148"
              },
              {
                "id": "100465",
                "cname": "其他",
                "pid": "1148"
              }
            ]
          }
        ]
      },
      {
        "id": "3272",
        "cname": "澳门",
        "pid": "1",
        "childrens": [
          {
            "id": "3275",
            "cname": "大堂区",
            "pid": "3272"
          },
          {
            "id": "3278",
            "cname": "氹仔",
            "pid": "3272"
          },
          {
            "id": "3277",
            "cname": "风顺堂区",
            "pid": "3272"
          },
          {
            "id": "3273",
            "cname": "花地玛堂区",
            "pid": "3272"
          },
          {
            "id": "3279",
            "cname": "路环",
            "pid": "3272"
          },
          {
            "id": "3274",
            "cname": "圣安多尼堂区",
            "pid": "3272"
          },
          {
            "id": "3276",
            "cname": "望德堂区",
            "pid": "3272"
          },
          {
            "id": "100427",
            "cname": "其他",
            "pid": "3272"
          }
        ]
      },
      {
        "id": "2",
        "cname": "北京",
        "pid": "1",
        "childrens": [
          {
            "id": "3",
            "cname": "北京",
            "pid": "2",
            "childrens": [
              {
                "id": "14",
                "cname": "昌平",
                "pid": "3"
              },
              {
                "id": "4",
                "cname": "东城",
                "pid": "3"
              },
              {
                "id": "15",
                "cname": "大兴",
                "pid": "3"
              },
              {
                "id": "7",
                "cname": "丰台",
                "pid": "3"
              },
              {
                "id": "11",
                "cname": "房山",
                "pid": "3"
              },
              {
                "id": "9",
                "cname": "海淀",
                "pid": "3"
              },
              {
                "id": "17",
                "cname": "怀柔",
                "pid": "3"
              },
              {
                "id": "10",
                "cname": "门头沟",
                "pid": "3"
              },
              {
                "id": "18",
                "cname": "密云",
                "pid": "3"
              },
              {
                "id": "16",
                "cname": "平谷",
                "pid": "3"
              },
              {
                "id": "8",
                "cname": "石景山",
                "pid": "3"
              },
              {
                "id": "13",
                "cname": "顺义",
                "pid": "3"
              },
              {
                "id": "12",
                "cname": "通州",
                "pid": "3"
              },
              {
                "id": "5",
                "cname": "西城",
                "pid": "3"
              },
              {
                "id": "19",
                "cname": "延庆",
                "pid": "3"
              },
              {
                "id": "6",
                "cname": "朝阳",
                "pid": "3"
              },
              {
                "id": "100289",
                "cname": "其他",
                "pid": "3"
              }
            ]
          }
        ]
      },
      {
        "id": "2244",
        "cname": "重庆",
        "pid": "1",
        "childrens": [
          {
            "id": "2245",
            "cname": "重庆",
            "pid": "2244",
            "childrens": [
              {
                "id": "2254",
                "cname": "北碚",
                "pid": "2245"
              },
              {
                "id": "2259",
                "cname": "巴南",
                "pid": "2245"
              },
              {
                "id": "2266",
                "cname": "璧山",
                "pid": "2245"
              },
              {
                "id": "2260",
                "cname": "长寿",
                "pid": "2245"
              },
              {
                "id": "2268",
                "cname": "城口",
                "pid": "2245"
              },
              {
                "id": "2249",
                "cname": "大渡口",
                "pid": "2245"
              },
              {
                "id": "2264",
                "cname": "大足",
                "pid": "2245"
              },
              {
                "id": "2270",
                "cname": "垫江",
                "pid": "2245"
              },
              {
                "id": "2247",
                "cname": "涪陵",
                "pid": "2245"
              },
              {
                "id": "2269",
                "cname": "丰都",
                "pid": "2245"
              },
              {
                "id": "2275",
                "cname": "奉节",
                "pid": "2245"
              },
              {
                "id": "2284",
                "cname": "合川",
                "pid": "2245"
              },
              {
                "id": "2250",
                "cname": "江北",
                "pid": "2245"
              },
              {
                "id": "2252",
                "cname": "九龙坡",
                "pid": "2245"
              },
              {
                "id": "2283",
                "cname": "江津",
                "pid": "2245"
              },
              {
                "id": "2273",
                "cname": "开县",
                "pid": "2245"
              },
              {
                "id": "2255",
                "cname": "两江新区",
                "pid": "2245"
              },
              {
                "id": "2267",
                "cname": "梁平",
                "pid": "2245"
              },
              {
                "id": "2253",
                "cname": "南岸",
                "pid": "2245"
              },
              {
                "id": "2286",
                "cname": "南川",
                "pid": "2245"
              },
              {
                "id": "2282",
                "cname": "彭水",
                "pid": "2245"
              },
              {
                "id": "2261",
                "cname": "綦江",
                "pid": "2245"
              },
              {
                "id": "2278",
                "cname": "黔江",
                "pid": "2245"
              },
              {
                "id": "2265",
                "cname": "荣昌",
                "pid": "2245"
              },
              {
                "id": "2251",
                "cname": "沙坪坝",
                "pid": "2245"
              },
              {
                "id": "2257",
                "cname": "双桥",
                "pid": "2245"
              },
              {
                "id": "2279",
                "cname": "石柱",
                "pid": "2245"
              },
              {
                "id": "2262",
                "cname": "潼南",
                "pid": "2245"
              },
              {
                "id": "2263",
                "cname": "铜梁",
                "pid": "2245"
              },
              {
                "id": "2246",
                "cname": "万州",
                "pid": "2245"
              },
              {
                "id": "2256",
                "cname": "万盛",
                "pid": "2245"
              },
              {
                "id": "2271",
                "cname": "武隆",
                "pid": "2245"
              },
              {
                "id": "2276",
                "cname": "巫山",
                "pid": "2245"
              },
              {
                "id": "2277",
                "cname": "巫溪",
                "pid": "2245"
              },
              {
                "id": "2280",
                "cname": "秀山",
                "pid": "2245"
              },
              {
                "id": "2248",
                "cname": "渝中",
                "pid": "2245"
              },
              {
                "id": "2258",
                "cname": "渝北",
                "pid": "2245"
              },
              {
                "id": "2274",
                "cname": "云阳",
                "pid": "2245"
              },
              {
                "id": "2281",
                "cname": "酉阳",
                "pid": "2245"
              },
              {
                "id": "2285",
                "cname": "永川",
                "pid": "2245"
              },
              {
                "id": "2272",
                "cname": "忠县",
                "pid": "2245"
              },
              {
                "id": "100195",
                "cname": "其他",
                "pid": "2245"
              }
            ]
          }
        ]
      },
      {
        "id": "1156",
        "cname": "福建",
        "pid": "1",
        "childrens": [
          {
            "id": "1157",
            "cname": "福州",
            "pid": "1156",
            "childrens": [
              {
                "id": "1160",
                "cname": "仓山区",
                "pid": "1157"
              },
              {
                "id": "1170",
                "cname": "长乐市",
                "pid": "1157"
              },
              {
                "id": "1169",
                "cname": "福清市",
                "pid": "1157"
              },
              {
                "id": "1158",
                "cname": "鼓楼区",
                "pid": "1157"
              },
              {
                "id": "1162",
                "cname": "晋安区",
                "pid": "1157"
              },
              {
                "id": "1164",
                "cname": "连江县",
                "pid": "1157"
              },
              {
                "id": "1165",
                "cname": "罗源县",
                "pid": "1157"
              },
              {
                "id": "1161",
                "cname": "马尾区",
                "pid": "1157"
              },
              {
                "id": "1163",
                "cname": "闽侯县",
                "pid": "1157"
              },
              {
                "id": "1166",
                "cname": "闽清县",
                "pid": "1157"
              },
              {
                "id": "1168",
                "cname": "平潭县",
                "pid": "1157"
              },
              {
                "id": "1159",
                "cname": "台江区",
                "pid": "1157"
              },
              {
                "id": "1167",
                "cname": "永泰县",
                "pid": "1157"
              },
              {
                "id": "100311",
                "cname": "其他",
                "pid": "1157"
              }
            ]
          },
          {
            "id": "1233",
            "cname": "龙岩",
            "pid": "1156",
            "childrens": [
              {
                "id": "1235",
                "cname": "长汀县",
                "pid": "1233"
              },
              {
                "id": "1239",
                "cname": "连城县",
                "pid": "1233"
              },
              {
                "id": "1237",
                "cname": "上杭县",
                "pid": "1233"
              },
              {
                "id": "1238",
                "cname": "武平县",
                "pid": "1233"
              },
              {
                "id": "1234",
                "cname": "新罗区",
                "pid": "1233"
              },
              {
                "id": "1236",
                "cname": "永定县",
                "pid": "1233"
              },
              {
                "id": "1240",
                "cname": "漳平市",
                "pid": "1233"
              },
              {
                "id": "100314",
                "cname": "其他",
                "pid": "1233"
              }
            ]
          },
          {
            "id": "1222",
            "cname": "南平",
            "pid": "1156",
            "childrens": [
              {
                "id": "1226",
                "cname": "光泽县",
                "pid": "1222"
              },
              {
                "id": "1231",
                "cname": "建瓯市",
                "pid": "1222"
              },
              {
                "id": "1232",
                "cname": "建阳市",
                "pid": "1222"
              },
              {
                "id": "1225",
                "cname": "浦城县",
                "pid": "1222"
              },
              {
                "id": "1224",
                "cname": "顺昌县",
                "pid": "1222"
              },
              {
                "id": "1227",
                "cname": "松溪县",
                "pid": "1222"
              },
              {
                "id": "1229",
                "cname": "邵武市",
                "pid": "1222"
              },
              {
                "id": "1230",
                "cname": "武夷山市",
                "pid": "1222"
              },
              {
                "id": "1223",
                "cname": "延平区",
                "pid": "1222"
              },
              {
                "id": "1228",
                "cname": "政和县",
                "pid": "1222"
              },
              {
                "id": "100466",
                "cname": "其他",
                "pid": "1222"
              }
            ]
          },
          {
            "id": "1241",
            "cname": "宁德",
            "pid": "1156",
            "childrens": [
              {
                "id": "1249",
                "cname": "福安市",
                "pid": "1241"
              },
              {
                "id": "1250",
                "cname": "福鼎市",
                "pid": "1241"
              },
              {
                "id": "1244",
                "cname": "古田县",
                "pid": "1241"
              },
              {
                "id": "1242",
                "cname": "蕉城区",
                "pid": "1241"
              },
              {
                "id": "1245",
                "cname": "屏南县",
                "pid": "1241"
              },
              {
                "id": "1246",
                "cname": "寿宁县",
                "pid": "1241"
              },
              {
                "id": "1243",
                "cname": "霞浦县",
                "pid": "1241"
              },
              {
                "id": "1247",
                "cname": "周宁县",
                "pid": "1241"
              },
              {
                "id": "1248",
                "cname": "柘荣县",
                "pid": "1241"
              },
              {
                "id": "100449",
                "cname": "其他",
                "pid": "1241"
              }
            ]
          },
          {
            "id": "1178",
            "cname": "莆田",
            "pid": "1156",
            "childrens": [
              {
                "id": "1179",
                "cname": "城厢区",
                "pid": "1178"
              },
              {
                "id": "1180",
                "cname": "涵江区",
                "pid": "1178"
              },
              {
                "id": "1181",
                "cname": "荔城区",
                "pid": "1178"
              },
              {
                "id": "1182",
                "cname": "秀屿区",
                "pid": "1178"
              },
              {
                "id": "1183",
                "cname": "仙游县",
                "pid": "1178"
              },
              {
                "id": "100312",
                "cname": "其他",
                "pid": "1178"
              }
            ]
          },
          {
            "id": "1197",
            "cname": "泉州",
            "pid": "1156",
            "childrens": [
              {
                "id": "1203",
                "cname": "安溪县",
                "pid": "1197"
              },
              {
                "id": "1205",
                "cname": "德化县",
                "pid": "1197"
              },
              {
                "id": "1199",
                "cname": "丰泽区",
                "pid": "1197"
              },
              {
                "id": "1202",
                "cname": "惠安县",
                "pid": "1197"
              },
              {
                "id": "1206",
                "cname": "金门县",
                "pid": "1197"
              },
              {
                "id": "1208",
                "cname": "晋江市",
                "pid": "1197"
              },
              {
                "id": "1198",
                "cname": "鲤城区",
                "pid": "1197"
              },
              {
                "id": "1200",
                "cname": "洛江区",
                "pid": "1197"
              },
              {
                "id": "1209",
                "cname": "南安市",
                "pid": "1197"
              },
              {
                "id": "1201",
                "cname": "泉港区",
                "pid": "1197"
              },
              {
                "id": "1207",
                "cname": "石狮市",
                "pid": "1197"
              },
              {
                "id": "1204",
                "cname": "永春县",
                "pid": "1197"
              },
              {
                "id": "100014",
                "cname": "其他",
                "pid": "1197"
              }
            ]
          },
          {
            "id": "1171",
            "cname": "厦门",
            "pid": "1156",
            "childrens": [
              {
                "id": "1173",
                "cname": "海沧区",
                "pid": "1171"
              },
              {
                "id": "1174",
                "cname": "湖里区",
                "pid": "1171"
              },
              {
                "id": "1175",
                "cname": "集美区",
                "pid": "1171"
              },
              {
                "id": "1172",
                "cname": "思明区",
                "pid": "1171"
              },
              {
                "id": "1176",
                "cname": "同安区",
                "pid": "1171"
              },
              {
                "id": "1177",
                "cname": "翔安区",
                "pid": "1171"
              },
              {
                "id": "100504",
                "cname": "其他",
                "pid": "1171"
              }
            ]
          },
          {
            "id": "1184",
            "cname": "三明",
            "pid": "1156",
            "childrens": [
              {
                "id": "1190",
                "cname": "大田县",
                "pid": "1184"
              },
              {
                "id": "1193",
                "cname": "将乐县",
                "pid": "1184"
              },
              {
                "id": "1195",
                "cname": "建宁县",
                "pid": "1184"
              },
              {
                "id": "1185",
                "cname": "梅列区",
                "pid": "1184"
              },
              {
                "id": "1187",
                "cname": "明溪县",
                "pid": "1184"
              },
              {
                "id": "1189",
                "cname": "宁化县",
                "pid": "1184"
              },
              {
                "id": "1188",
                "cname": "清流县",
                "pid": "1184"
              },
              {
                "id": "1186",
                "cname": "三元区",
                "pid": "1184"
              },
              {
                "id": "1192",
                "cname": "沙县",
                "pid": "1184"
              },
              {
                "id": "1194",
                "cname": "泰宁县",
                "pid": "1184"
              },
              {
                "id": "1191",
                "cname": "尤溪县",
                "pid": "1184"
              },
              {
                "id": "1196",
                "cname": "永安市",
                "pid": "1184"
              },
              {
                "id": "100389",
                "cname": "其他",
                "pid": "1184"
              }
            ]
          },
          {
            "id": "1210",
            "cname": "漳州",
            "pid": "1156",
            "childrens": [
              {
                "id": "1216",
                "cname": "长泰县",
                "pid": "1210"
              },
              {
                "id": "1217",
                "cname": "东山县",
                "pid": "1210"
              },
              {
                "id": "1220",
                "cname": "华安县",
                "pid": "1210"
              },
              {
                "id": "1212",
                "cname": "龙文区",
                "pid": "1210"
              },
              {
                "id": "1221",
                "cname": "龙海市",
                "pid": "1210"
              },
              {
                "id": "1218",
                "cname": "南靖县",
                "pid": "1210"
              },
              {
                "id": "1219",
                "cname": "平和县",
                "pid": "1210"
              },
              {
                "id": "1211",
                "cname": "芗城区",
                "pid": "1210"
              },
              {
                "id": "1213",
                "cname": "云霄县",
                "pid": "1210"
              },
              {
                "id": "1214",
                "cname": "漳浦县",
                "pid": "1210"
              },
              {
                "id": "1215",
                "cname": "诏安县",
                "pid": "1210"
              },
              {
                "id": "100313",
                "cname": "其他",
                "pid": "1210"
              }
            ]
          }
        ]
      },
      {
        "id": "1951",
        "cname": "广东",
        "pid": "1",
        "childrens": [
          {
            "id": "2080",
            "cname": "潮州",
            "pid": "1951",
            "childrens": [
              {
                "id": "2082",
                "cname": "潮安县",
                "pid": "2080"
              },
              {
                "id": "2083",
                "cname": "饶平县",
                "pid": "2080"
              },
              {
                "id": "2081",
                "cname": "湘桥区",
                "pid": "2080"
              },
              {
                "id": "100339",
                "cname": "其他",
                "pid": "2080"
              }
            ]
          },
          {
            "id": "2076",
            "cname": "东莞",
            "pid": "1951",
            "childrens": [
              {
                "id": "2077",
                "cname": "东莞市",
                "pid": "2076"
              },
              {
                "id": "100407",
                "cname": "其他",
                "pid": "2076"
              }
            ]
          },
          {
            "id": "1995",
            "cname": "佛山",
            "pid": "1951",
            "childrens": [
              {
                "id": "1996",
                "cname": "禅城区",
                "pid": "1995"
              },
              {
                "id": "2000",
                "cname": "高明区",
                "pid": "1995"
              },
              {
                "id": "1997",
                "cname": "南海区",
                "pid": "1995"
              },
              {
                "id": "1998",
                "cname": "顺德区",
                "pid": "1995"
              },
              {
                "id": "1999",
                "cname": "三水区",
                "pid": "1995"
              },
              {
                "id": "100336",
                "cname": "其他",
                "pid": "1995"
              }
            ]
          },
          {
            "id": "1952",
            "cname": "广州",
            "pid": "1951",
            "childrens": [
              {
                "id": "1957",
                "cname": "白云区",
                "pid": "1952"
              },
              {
                "id": "1964",
                "cname": "从化市",
                "pid": "1952"
              },
              {
                "id": "1959",
                "cname": "番禺区",
                "pid": "1952"
              },
              {
                "id": "1955",
                "cname": "海珠区",
                "pid": "1952"
              },
              {
                "id": "1958",
                "cname": "黄埔区",
                "pid": "1952"
              },
              {
                "id": "1960",
                "cname": "花都区",
                "pid": "1952"
              },
              {
                "id": "1953",
                "cname": "荔湾区",
                "pid": "1952"
              },
              {
                "id": "1962",
                "cname": "萝岗区",
                "pid": "1952"
              },
              {
                "id": "1961",
                "cname": "南沙区",
                "pid": "1952"
              },
              {
                "id": "1956",
                "cname": "天河区",
                "pid": "1952"
              },
              {
                "id": "1954",
                "cname": "越秀区",
                "pid": "1952"
              },
              {
                "id": "1963",
                "cname": "增城市",
                "pid": "1952"
              },
              {
                "id": "100187",
                "cname": "其他",
                "pid": "1952"
              }
            ]
          },
          {
            "id": "2035",
            "cname": "惠州",
            "pid": "1951",
            "childrens": [
              {
                "id": "2038",
                "cname": "博罗县",
                "pid": "2035"
              },
              {
                "id": "2036",
                "cname": "惠城区",
                "pid": "2035"
              },
              {
                "id": "2037",
                "cname": "惠阳区",
                "pid": "2035"
              },
              {
                "id": "2039",
                "cname": "惠东县",
                "pid": "2035"
              },
              {
                "id": "2040",
                "cname": "龙门县",
                "pid": "2035"
              },
              {
                "id": "100189",
                "cname": "其他",
                "pid": "2035"
              }
            ]
          },
          {
            "id": "2055",
            "cname": "河源",
            "pid": "1951",
            "childrens": [
              {
                "id": "2061",
                "cname": "东源县",
                "pid": "2055"
              },
              {
                "id": "2060",
                "cname": "和平县",
                "pid": "2055"
              },
              {
                "id": "2058",
                "cname": "龙川县",
                "pid": "2055"
              },
              {
                "id": "2059",
                "cname": "连平县",
                "pid": "2055"
              },
              {
                "id": "2056",
                "cname": "源城区",
                "pid": "2055"
              },
              {
                "id": "2057",
                "cname": "紫金县",
                "pid": "2055"
              },
              {
                "id": "100406",
                "cname": "其他",
                "pid": "2055"
              }
            ]
          },
          {
            "id": "2001",
            "cname": "江门",
            "pid": "1951",
            "childrens": [
              {
                "id": "2008",
                "cname": "恩平市",
                "pid": "2001"
              },
              {
                "id": "2007",
                "cname": "鹤山市",
                "pid": "2001"
              },
              {
                "id": "2003",
                "cname": "江海区",
                "pid": "2001"
              },
              {
                "id": "2006",
                "cname": "开平市",
                "pid": "2001"
              },
              {
                "id": "2002",
                "cname": "蓬江区",
                "pid": "2001"
              },
              {
                "id": "2005",
                "cname": "台山市",
                "pid": "2001"
              },
              {
                "id": "2004",
                "cname": "新会区",
                "pid": "2001"
              },
              {
                "id": "100439",
                "cname": "其他",
                "pid": "2001"
              }
            ]
          },
          {
            "id": "2084",
            "cname": "揭阳",
            "pid": "1951",
            "childrens": [
              {
                "id": "2088",
                "cname": "惠来县",
                "pid": "2084"
              },
              {
                "id": "2086",
                "cname": "揭东县",
                "pid": "2084"
              },
              {
                "id": "2087",
                "cname": "揭西县",
                "pid": "2084"
              },
              {
                "id": "2089",
                "cname": "普宁市",
                "pid": "2084"
              },
              {
                "id": "2085",
                "cname": "榕城区",
                "pid": "2084"
              },
              {
                "id": "100511",
                "cname": "其他",
                "pid": "2084"
              }
            ]
          },
          {
            "id": "2019",
            "cname": "茂名",
            "pid": "1951",
            "childrens": [
              {
                "id": "2022",
                "cname": "电白县",
                "pid": "2019"
              },
              {
                "id": "2023",
                "cname": "高州市",
                "pid": "2019"
              },
              {
                "id": "2024",
                "cname": "化州市",
                "pid": "2019"
              },
              {
                "id": "2020",
                "cname": "茂南区",
                "pid": "2019"
              },
              {
                "id": "2021",
                "cname": "茂港区",
                "pid": "2019"
              },
              {
                "id": "2025",
                "cname": "信宜市",
                "pid": "2019"
              },
              {
                "id": "100403",
                "cname": "其他",
                "pid": "2019"
              }
            ]
          },
          {
            "id": "2041",
            "cname": "梅州",
            "pid": "1951",
            "childrens": [
              {
                "id": "2044",
                "cname": "大埔县",
                "pid": "2041"
              },
              {
                "id": "2045",
                "cname": "丰顺县",
                "pid": "2041"
              },
              {
                "id": "2048",
                "cname": "蕉岭县",
                "pid": "2041"
              },
              {
                "id": "2042",
                "cname": "梅江区",
                "pid": "2041"
              },
              {
                "id": "2043",
                "cname": "梅县",
                "pid": "2041"
              },
              {
                "id": "2047",
                "cname": "平远县",
                "pid": "2041"
              },
              {
                "id": "2046",
                "cname": "五华县",
                "pid": "2041"
              },
              {
                "id": "2049",
                "cname": "兴宁市",
                "pid": "2041"
              },
              {
                "id": "100405",
                "cname": "其他",
                "pid": "2041"
              }
            ]
          },
          {
            "id": "2067",
            "cname": "清远",
            "pid": "1951",
            "childrens": [
              {
                "id": "2069",
                "cname": "佛冈县",
                "pid": "2067"
              },
              {
                "id": "2071",
                "cname": "连山壮族瑶族自治县",
                "pid": "2067"
              },
              {
                "id": "2072",
                "cname": "连南瑶族自治县",
                "pid": "2067"
              },
              {
                "id": "2075",
                "cname": "连州市",
                "pid": "2067"
              },
              {
                "id": "2068",
                "cname": "清城区",
                "pid": "2067"
              },
              {
                "id": "2073",
                "cname": "清新县",
                "pid": "2067"
              },
              {
                "id": "2070",
                "cname": "阳山县",
                "pid": "2067"
              },
              {
                "id": "2074",
                "cname": "英德市",
                "pid": "2067"
              },
              {
                "id": "100453",
                "cname": "其他",
                "pid": "2067"
              }
            ]
          },
          {
            "id": "1965",
            "cname": "韶关",
            "pid": "1951",
            "childrens": [
              {
                "id": "1974",
                "cname": "乐昌市",
                "pid": "1965"
              },
              {
                "id": "1975",
                "cname": "南雄市",
                "pid": "1965"
              },
              {
                "id": "1968",
                "cname": "曲江区",
                "pid": "1965"
              },
              {
                "id": "1970",
                "cname": "仁化县",
                "pid": "1965"
              },
              {
                "id": "1972",
                "cname": "乳源瑶族自治县",
                "pid": "1965"
              },
              {
                "id": "1969",
                "cname": "始兴县",
                "pid": "1965"
              },
              {
                "id": "1966",
                "cname": "武江区",
                "pid": "1965"
              },
              {
                "id": "1971",
                "cname": "翁源县",
                "pid": "1965"
              },
              {
                "id": "1973",
                "cname": "新丰县",
                "pid": "1965"
              },
              {
                "id": "1967",
                "cname": "浈江区",
                "pid": "1965"
              },
              {
                "id": "100547",
                "cname": "其他",
                "pid": "1965"
              }
            ]
          },
          {
            "id": "1976",
            "cname": "深圳",
            "pid": "1951",
            "childrens": [
              {
                "id": "1980",
                "cname": "宝安区",
                "pid": "1976"
              },
              {
                "id": "1978",
                "cname": "福田区",
                "pid": "1976"
              },
              {
                "id": "1977",
                "cname": "罗湖区",
                "pid": "1976"
              },
              {
                "id": "1981",
                "cname": "龙岗区",
                "pid": "1976"
              },
              {
                "id": "1979",
                "cname": "南山区",
                "pid": "1976"
              },
              {
                "id": "1982",
                "cname": "盐田区",
                "pid": "1976"
              },
              {
                "id": "100188",
                "cname": "其他",
                "pid": "1976"
              }
            ]
          },
          {
            "id": "1987",
            "cname": "汕头",
            "pid": "1951",
            "childrens": [
              {
                "id": "1991",
                "cname": "潮阳区",
                "pid": "1987"
              },
              {
                "id": "1992",
                "cname": "潮南区",
                "pid": "1987"
              },
              {
                "id": "1993",
                "cname": "澄海区",
                "pid": "1987"
              },
              {
                "id": "1990",
                "cname": "濠江区",
                "pid": "1987"
              },
              {
                "id": "1989",
                "cname": "金平区",
                "pid": "1987"
              },
              {
                "id": "1988",
                "cname": "龙湖区",
                "pid": "1987"
              },
              {
                "id": "1994",
                "cname": "南澳县",
                "pid": "1987"
              },
              {
                "id": "100335",
                "cname": "其他",
                "pid": "1987"
              }
            ]
          },
          {
            "id": "2050",
            "cname": "汕尾",
            "pid": "1951",
            "childrens": [
              {
                "id": "2051",
                "cname": "城区",
                "pid": "2050"
              },
              {
                "id": "2052",
                "cname": "海丰县",
                "pid": "2050"
              },
              {
                "id": "2053",
                "cname": "陆河县",
                "pid": "2050"
              },
              {
                "id": "2054",
                "cname": "陆丰市",
                "pid": "2050"
              },
              {
                "id": "100338",
                "cname": "其他",
                "pid": "2050"
              }
            ]
          },
          {
            "id": "2062",
            "cname": "阳江",
            "pid": "1951",
            "childrens": [
              {
                "id": "2063",
                "cname": "江城区",
                "pid": "2062"
              },
              {
                "id": "2064",
                "cname": "阳西县",
                "pid": "2062"
              },
              {
                "id": "2065",
                "cname": "阳东县",
                "pid": "2062"
              },
              {
                "id": "2066",
                "cname": "阳春市",
                "pid": "2062"
              },
              {
                "id": "100530",
                "cname": "其他",
                "pid": "2062"
              }
            ]
          },
          {
            "id": "2090",
            "cname": "云浮",
            "pid": "1951",
            "childrens": [
              {
                "id": "2095",
                "cname": "罗定市",
                "pid": "2090"
              },
              {
                "id": "2092",
                "cname": "新兴县",
                "pid": "2090"
              },
              {
                "id": "2091",
                "cname": "云城区",
                "pid": "2090"
              },
              {
                "id": "2093",
                "cname": "郁南县",
                "pid": "2090"
              },
              {
                "id": "2094",
                "cname": "云安县",
                "pid": "2090"
              },
              {
                "id": "100548",
                "cname": "其他",
                "pid": "2090"
              }
            ]
          },
          {
            "id": "1983",
            "cname": "珠海",
            "pid": "1951",
            "childrens": [
              {
                "id": "1985",
                "cname": "斗门区",
                "pid": "1983"
              },
              {
                "id": "1986",
                "cname": "金湾区",
                "pid": "1983"
              },
              {
                "id": "1984",
                "cname": "香洲区",
                "pid": "1983"
              },
              {
                "id": "100402",
                "cname": "其他",
                "pid": "1983"
              }
            ]
          },
          {
            "id": "2009",
            "cname": "湛江",
            "pid": "1951",
            "childrens": [
              {
                "id": "2010",
                "cname": "赤坎区",
                "pid": "2009"
              },
              {
                "id": "2016",
                "cname": "廉江市",
                "pid": "2009"
              },
              {
                "id": "2017",
                "cname": "雷州市",
                "pid": "2009"
              },
              {
                "id": "2013",
                "cname": "麻章区",
                "pid": "2009"
              },
              {
                "id": "2012",
                "cname": "坡头区",
                "pid": "2009"
              },
              {
                "id": "2014",
                "cname": "遂溪县",
                "pid": "2009"
              },
              {
                "id": "2018",
                "cname": "吴川市",
                "pid": "2009"
              },
              {
                "id": "2011",
                "cname": "霞山区",
                "pid": "2009"
              },
              {
                "id": "2015",
                "cname": "徐闻县",
                "pid": "2009"
              },
              {
                "id": "100337",
                "cname": "其他",
                "pid": "2009"
              }
            ]
          },
          {
            "id": "2026",
            "cname": "肇庆",
            "pid": "1951",
            "childrens": [
              {
                "id": "2027",
                "cname": "端州区",
                "pid": "2026"
              },
              {
                "id": "2028",
                "cname": "鼎湖区",
                "pid": "2026"
              },
              {
                "id": "2032",
                "cname": "德庆县",
                "pid": "2026"
              },
              {
                "id": "2031",
                "cname": "封开县",
                "pid": "2026"
              },
              {
                "id": "2029",
                "cname": "广宁县",
                "pid": "2026"
              },
              {
                "id": "2033",
                "cname": "高要市",
                "pid": "2026"
              },
              {
                "id": "2030",
                "cname": "怀集县",
                "pid": "2026"
              },
              {
                "id": "2034",
                "cname": "四会市",
                "pid": "2026"
              },
              {
                "id": "100404",
                "cname": "其他",
                "pid": "2026"
              }
            ]
          },
          {
            "id": "2078",
            "cname": "中山",
            "pid": "1951",
            "childrens": [
              {
                "id": "2079",
                "cname": "中山市",
                "pid": "2078"
              },
              {
                "id": "100569",
                "cname": "其他",
                "pid": "2078"
              }
            ]
          }
        ]
      },
      {
        "id": "2096",
        "cname": "广西",
        "pid": "1",
        "childrens": [
          {
            "id": "2147",
            "cname": "北海",
            "pid": "2096",
            "childrens": [
              {
                "id": "2148",
                "cname": "海城区",
                "pid": "2147"
              },
              {
                "id": "2151",
                "cname": "合浦县",
                "pid": "2147"
              },
              {
                "id": "2150",
                "cname": "铁山港区",
                "pid": "2147"
              },
              {
                "id": "2149",
                "cname": "银海区",
                "pid": "2147"
              },
              {
                "id": "100512",
                "cname": "其他",
                "pid": "2147"
              }
            ]
          },
          {
            "id": "2175",
            "cname": "百色",
            "pid": "2096",
            "childrens": [
              {
                "id": "2180",
                "cname": "德保县",
                "pid": "2175"
              },
              {
                "id": "2181",
                "cname": "靖西县",
                "pid": "2175"
              },
              {
                "id": "2183",
                "cname": "凌云县",
                "pid": "2175"
              },
              {
                "id": "2184",
                "cname": "乐业县",
                "pid": "2175"
              },
              {
                "id": "2187",
                "cname": "隆林各族自治县",
                "pid": "2175"
              },
              {
                "id": "2182",
                "cname": "那坡县",
                "pid": "2175"
              },
              {
                "id": "2179",
                "cname": "平果县",
                "pid": "2175"
              },
              {
                "id": "2177",
                "cname": "田阳县",
                "pid": "2175"
              },
              {
                "id": "2178",
                "cname": "田东县",
                "pid": "2175"
              },
              {
                "id": "2185",
                "cname": "田林县",
                "pid": "2175"
              },
              {
                "id": "2186",
                "cname": "西林县",
                "pid": "2175"
              },
              {
                "id": "2176",
                "cname": "右江区",
                "pid": "2175"
              },
              {
                "id": "100410",
                "cname": "其他",
                "pid": "2175"
              }
            ]
          },
          {
            "id": "2212",
            "cname": "崇左",
            "pid": "2096",
            "childrens": [
              {
                "id": "2217",
                "cname": "大新县",
                "pid": "2212"
              },
              {
                "id": "2214",
                "cname": "扶绥县",
                "pid": "2212"
              },
              {
                "id": "2213",
                "cname": "江洲区",
                "pid": "2212"
              },
              {
                "id": "2216",
                "cname": "龙州县",
                "pid": "2212"
              },
              {
                "id": "2215",
                "cname": "宁明县",
                "pid": "2212"
              },
              {
                "id": "2219",
                "cname": "凭祥市",
                "pid": "2212"
              },
              {
                "id": "2218",
                "cname": "天等县",
                "pid": "2212"
              },
              {
                "id": "100411",
                "cname": "其他",
                "pid": "2212"
              }
            ]
          },
          {
            "id": "2152",
            "cname": "防城港",
            "pid": "2096",
            "childrens": [
              {
                "id": "2156",
                "cname": "东兴市",
                "pid": "2152"
              },
              {
                "id": "2154",
                "cname": "防城区",
                "pid": "2152"
              },
              {
                "id": "2153",
                "cname": "港口区",
                "pid": "2152"
              },
              {
                "id": "2155",
                "cname": "上思县",
                "pid": "2152"
              },
              {
                "id": "100409",
                "cname": "其他",
                "pid": "2152"
              }
            ]
          },
          {
            "id": "2121",
            "cname": "桂林",
            "pid": "2096",
            "childrens": [
              {
                "id": "2123",
                "cname": "叠彩区",
                "pid": "2121"
              },
              {
                "id": "2133",
                "cname": "灌阳县",
                "pid": "2121"
              },
              {
                "id": "2138",
                "cname": "恭城瑶族自治县",
                "pid": "2121"
              },
              {
                "id": "2128",
                "cname": "临桂县",
                "pid": "2121"
              },
              {
                "id": "2129",
                "cname": "灵川县",
                "pid": "2121"
              },
              {
                "id": "2134",
                "cname": "龙胜各族自治县",
                "pid": "2121"
              },
              {
                "id": "2137",
                "cname": "荔浦县",
                "pid": "2121"
              },
              {
                "id": "2136",
                "cname": "平乐县",
                "pid": "2121"
              },
              {
                "id": "2125",
                "cname": "七星区",
                "pid": "2121"
              },
              {
                "id": "2130",
                "cname": "全州县",
                "pid": "2121"
              },
              {
                "id": "2122",
                "cname": "秀峰区",
                "pid": "2121"
              },
              {
                "id": "2124",
                "cname": "象山区",
                "pid": "2121"
              },
              {
                "id": "2131",
                "cname": "兴安县",
                "pid": "2121"
              },
              {
                "id": "2126",
                "cname": "雁山区",
                "pid": "2121"
              },
              {
                "id": "2127",
                "cname": "阳朔县",
                "pid": "2121"
              },
              {
                "id": "2132",
                "cname": "永福县",
                "pid": "2121"
              },
              {
                "id": "2135",
                "cname": "资源县",
                "pid": "2121"
              },
              {
                "id": "100408",
                "cname": "其他",
                "pid": "2121"
              }
            ]
          },
          {
            "id": "2162",
            "cname": "贵港",
            "pid": "2096",
            "childrens": [
              {
                "id": "2163",
                "cname": "港北区",
                "pid": "2162"
              },
              {
                "id": "2164",
                "cname": "港南区",
                "pid": "2162"
              },
              {
                "id": "2167",
                "cname": "桂平市",
                "pid": "2162"
              },
              {
                "id": "2166",
                "cname": "平南县",
                "pid": "2162"
              },
              {
                "id": "2165",
                "cname": "覃塘区",
                "pid": "2162"
              },
              {
                "id": "100473",
                "cname": "其他",
                "pid": "2162"
              }
            ]
          },
          {
            "id": "2188",
            "cname": "贺州",
            "pid": "2096",
            "childrens": [
              {
                "id": "2189",
                "cname": "八步区",
                "pid": "2188"
              },
              {
                "id": "2192",
                "cname": "富川瑶族自治县",
                "pid": "2188"
              },
              {
                "id": "2190",
                "cname": "昭平县",
                "pid": "2188"
              },
              {
                "id": "2191",
                "cname": "钟山县",
                "pid": "2188"
              },
              {
                "id": "100192",
                "cname": "其他",
                "pid": "2188"
              }
            ]
          },
          {
            "id": "2193",
            "cname": "河池",
            "pid": "2096",
            "childrens": [
              {
                "id": "2201",
                "cname": "巴马瑶族自治县",
                "pid": "2193"
              },
              {
                "id": "2198",
                "cname": "东兰县",
                "pid": "2193"
              },
              {
                "id": "2202",
                "cname": "都安瑶族自治县",
                "pid": "2193"
              },
              {
                "id": "2203",
                "cname": "大化瑶族自治县",
                "pid": "2193"
              },
              {
                "id": "2197",
                "cname": "凤山县",
                "pid": "2193"
              },
              {
                "id": "2200",
                "cname": "环江毛南族自治县",
                "pid": "2193"
              },
              {
                "id": "2194",
                "cname": "金城江区",
                "pid": "2193"
              },
              {
                "id": "2199",
                "cname": "罗城仫佬族自治县",
                "pid": "2193"
              },
              {
                "id": "2195",
                "cname": "南丹县",
                "pid": "2193"
              },
              {
                "id": "2196",
                "cname": "天峨县",
                "pid": "2193"
              },
              {
                "id": "2204",
                "cname": "宜州市",
                "pid": "2193"
              },
              {
                "id": "100193",
                "cname": "其他",
                "pid": "2193"
              }
            ]
          },
          {
            "id": "2110",
            "cname": "柳州",
            "pid": "2096",
            "childrens": [
              {
                "id": "2111",
                "cname": "城中区",
                "pid": "2110"
              },
              {
                "id": "2113",
                "cname": "柳南区",
                "pid": "2110"
              },
              {
                "id": "2114",
                "cname": "柳北区",
                "pid": "2110"
              },
              {
                "id": "2115",
                "cname": "柳江县",
                "pid": "2110"
              },
              {
                "id": "2116",
                "cname": "柳城县",
                "pid": "2110"
              },
              {
                "id": "2117",
                "cname": "鹿寨县",
                "pid": "2110"
              },
              {
                "id": "2118",
                "cname": "融安县",
                "pid": "2110"
              },
              {
                "id": "2119",
                "cname": "融水苗族自治县",
                "pid": "2110"
              },
              {
                "id": "2120",
                "cname": "三江侗族自治县",
                "pid": "2110"
              },
              {
                "id": "2112",
                "cname": "鱼峰区",
                "pid": "2110"
              },
              {
                "id": "100340",
                "cname": "其他",
                "pid": "2110"
              }
            ]
          },
          {
            "id": "2205",
            "cname": "来宾",
            "pid": "2096",
            "childrens": [
              {
                "id": "2211",
                "cname": "合山市",
                "pid": "2205"
              },
              {
                "id": "2210",
                "cname": "金秀瑶族自治县",
                "pid": "2205"
              },
              {
                "id": "2209",
                "cname": "武宣县",
                "pid": "2205"
              },
              {
                "id": "2206",
                "cname": "兴宾区",
                "pid": "2205"
              },
              {
                "id": "2207",
                "cname": "忻城县",
                "pid": "2205"
              },
              {
                "id": "2208",
                "cname": "象州县",
                "pid": "2205"
              },
              {
                "id": "100513",
                "cname": "其他",
                "pid": "2205"
              }
            ]
          },
          {
            "id": "2097",
            "cname": "南宁",
            "pid": "2096",
            "childrens": [
              {
                "id": "2108",
                "cname": "宾阳县",
                "pid": "2097"
              },
              {
                "id": "2109",
                "cname": "横县",
                "pid": "2097"
              },
              {
                "id": "2100",
                "cname": "江南区",
                "pid": "2097"
              },
              {
                "id": "2102",
                "cname": "良庆区",
                "pid": "2097"
              },
              {
                "id": "2105",
                "cname": "隆安县",
                "pid": "2097"
              },
              {
                "id": "2106",
                "cname": "马山县",
                "pid": "2097"
              },
              {
                "id": "2099",
                "cname": "青秀区",
                "pid": "2097"
              },
              {
                "id": "2107",
                "cname": "上林县",
                "pid": "2097"
              },
              {
                "id": "2104",
                "cname": "武鸣县",
                "pid": "2097"
              },
              {
                "id": "2098",
                "cname": "兴宁区",
                "pid": "2097"
              },
              {
                "id": "2101",
                "cname": "西乡塘区",
                "pid": "2097"
              },
              {
                "id": "2103",
                "cname": "邕宁区",
                "pid": "2097"
              },
              {
                "id": "100190",
                "cname": "其他",
                "pid": "2097"
              }
            ]
          },
          {
            "id": "2157",
            "cname": "钦州",
            "pid": "2096",
            "childrens": [
              {
                "id": "2160",
                "cname": "灵山县",
                "pid": "2157"
              },
              {
                "id": "2161",
                "cname": "浦北县",
                "pid": "2157"
              },
              {
                "id": "2158",
                "cname": "钦南区",
                "pid": "2157"
              },
              {
                "id": "2159",
                "cname": "钦北区",
                "pid": "2157"
              },
              {
                "id": "100549",
                "cname": "其他",
                "pid": "2157"
              }
            ]
          },
          {
            "id": "2139",
            "cname": "梧州",
            "pid": "2096",
            "childrens": [
              {
                "id": "2142",
                "cname": "长洲区",
                "pid": "2139"
              },
              {
                "id": "2143",
                "cname": "苍梧县",
                "pid": "2139"
              },
              {
                "id": "2146",
                "cname": "岑溪市",
                "pid": "2139"
              },
              {
                "id": "2141",
                "cname": "蝶山区",
                "pid": "2139"
              },
              {
                "id": "2145",
                "cname": "蒙山县",
                "pid": "2139"
              },
              {
                "id": "2144",
                "cname": "藤县",
                "pid": "2139"
              },
              {
                "id": "2140",
                "cname": "万秀区",
                "pid": "2139"
              },
              {
                "id": "100341",
                "cname": "其他",
                "pid": "2139"
              }
            ]
          },
          {
            "id": "2168",
            "cname": "玉林",
            "pid": "2096",
            "childrens": [
              {
                "id": "2172",
                "cname": "博白县",
                "pid": "2168"
              },
              {
                "id": "2174",
                "cname": "北流市",
                "pid": "2168"
              },
              {
                "id": "2171",
                "cname": "陆川县",
                "pid": "2168"
              },
              {
                "id": "2170",
                "cname": "容县",
                "pid": "2168"
              },
              {
                "id": "2173",
                "cname": "兴业县",
                "pid": "2168"
              },
              {
                "id": "2169",
                "cname": "玉州区",
                "pid": "2168"
              },
              {
                "id": "100191",
                "cname": "其他",
                "pid": "2168"
              }
            ]
          }
        ]
      },
      {
        "id": "2490",
        "cname": "贵州",
        "pid": "1",
        "childrens": [
          {
            "id": "2522",
            "cname": "安顺",
            "pid": "2490",
            "childrens": [
              {
                "id": "2527",
                "cname": "关岭布依族苗族自治县",
                "pid": "2522"
              },
              {
                "id": "2524",
                "cname": "平坝县",
                "pid": "2522"
              },
              {
                "id": "2525",
                "cname": "普定县",
                "pid": "2522"
              },
              {
                "id": "2523",
                "cname": "西秀区",
                "pid": "2522"
              },
              {
                "id": "2526",
                "cname": "镇宁布依族苗族自治县",
                "pid": "2522"
              },
              {
                "id": "2528",
                "cname": "紫云苗族布依族自治县",
                "pid": "2522"
              },
              {
                "id": "100478",
                "cname": "其他",
                "pid": "2522"
              }
            ]
          },
          {
            "id": "2549",
            "cname": "毕节",
            "pid": "2490",
            "childrens": [
              {
                "id": "2550",
                "cname": "毕节市",
                "pid": "2549"
              },
              {
                "id": "2551",
                "cname": "大方县",
                "pid": "2549"
              },
              {
                "id": "2557",
                "cname": "赫章县",
                "pid": "2549"
              },
              {
                "id": "2553",
                "cname": "金沙县",
                "pid": "2549"
              },
              {
                "id": "2555",
                "cname": "纳雍县",
                "pid": "2549"
              },
              {
                "id": "2552",
                "cname": "黔西县",
                "pid": "2549"
              },
              {
                "id": "2556",
                "cname": "威宁彝族回族苗族自治县",
                "pid": "2549"
              },
              {
                "id": "2554",
                "cname": "织金县",
                "pid": "2549"
              },
              {
                "id": "100201",
                "cname": "其他",
                "pid": "2549"
              }
            ]
          },
          {
            "id": "2491",
            "cname": "贵阳",
            "pid": "2490",
            "childrens": [
              {
                "id": "2496",
                "cname": "白云区",
                "pid": "2491"
              },
              {
                "id": "2494",
                "cname": "花溪区",
                "pid": "2491"
              },
              {
                "id": "2498",
                "cname": "开阳县",
                "pid": "2491"
              },
              {
                "id": "2492",
                "cname": "南明区",
                "pid": "2491"
              },
              {
                "id": "2501",
                "cname": "清镇市",
                "pid": "2491"
              },
              {
                "id": "2495",
                "cname": "乌当区",
                "pid": "2491"
              },
              {
                "id": "2497",
                "cname": "小河区",
                "pid": "2491"
              },
              {
                "id": "2499",
                "cname": "息烽县",
                "pid": "2491"
              },
              {
                "id": "2500",
                "cname": "修文县",
                "pid": "2491"
              },
              {
                "id": "2493",
                "cname": "云岩区",
                "pid": "2491"
              },
              {
                "id": "100200",
                "cname": "其他",
                "pid": "2491"
              }
            ]
          },
          {
            "id": "2502",
            "cname": "六盘水",
            "pid": "2490",
            "childrens": [
              {
                "id": "2504",
                "cname": "六枝特区",
                "pid": "2502"
              },
              {
                "id": "2506",
                "cname": "盘县",
                "pid": "2502"
              },
              {
                "id": "2505",
                "cname": "水城县",
                "pid": "2502"
              },
              {
                "id": "2503",
                "cname": "钟山区",
                "pid": "2502"
              },
              {
                "id": "100551",
                "cname": "其他",
                "pid": "2502"
              }
            ]
          },
          {
            "id": "2540",
            "cname": "黔西南",
            "pid": "2490",
            "childrens": [
              {
                "id": "2548",
                "cname": "安龙县",
                "pid": "2540"
              },
              {
                "id": "2547",
                "cname": "册亨县",
                "pid": "2540"
              },
              {
                "id": "2543",
                "cname": "普安县",
                "pid": "2540"
              },
              {
                "id": "2544",
                "cname": "晴隆县",
                "pid": "2540"
              },
              {
                "id": "2546",
                "cname": "望谟县",
                "pid": "2540"
              },
              {
                "id": "2541",
                "cname": "兴义市",
                "pid": "2540"
              },
              {
                "id": "2542",
                "cname": "兴仁县",
                "pid": "2540"
              },
              {
                "id": "2545",
                "cname": "贞丰县",
                "pid": "2540"
              },
              {
                "id": "100029",
                "cname": "其他",
                "pid": "2540"
              }
            ]
          },
          {
            "id": "2558",
            "cname": "黔东南",
            "pid": "2490",
            "childrens": [
              {
                "id": "2564",
                "cname": "岑巩县",
                "pid": "2558"
              },
              {
                "id": "2571",
                "cname": "从江县",
                "pid": "2558"
              },
              {
                "id": "2574",
                "cname": "丹寨县",
                "pid": "2558"
              },
              {
                "id": "2560",
                "cname": "黄平县",
                "pid": "2558"
              },
              {
                "id": "2566",
                "cname": "锦屏县",
                "pid": "2558"
              },
              {
                "id": "2567",
                "cname": "剑河县",
                "pid": "2558"
              },
              {
                "id": "2559",
                "cname": "凯里市",
                "pid": "2558"
              },
              {
                "id": "2569",
                "cname": "黎平县",
                "pid": "2558"
              },
              {
                "id": "2572",
                "cname": "雷山县",
                "pid": "2558"
              },
              {
                "id": "2573",
                "cname": "麻江县",
                "pid": "2558"
              },
              {
                "id": "2570",
                "cname": "榕江县",
                "pid": "2558"
              },
              {
                "id": "2561",
                "cname": "施秉县",
                "pid": "2558"
              },
              {
                "id": "2562",
                "cname": "三穗县",
                "pid": "2558"
              },
              {
                "id": "2565",
                "cname": "天柱县",
                "pid": "2558"
              },
              {
                "id": "2568",
                "cname": "台江县",
                "pid": "2558"
              },
              {
                "id": "2563",
                "cname": "镇远县",
                "pid": "2558"
              },
              {
                "id": "100346",
                "cname": "其他",
                "pid": "2558"
              }
            ]
          },
          {
            "id": "2575",
            "cname": "黔南",
            "pid": "2490",
            "childrens": [
              {
                "id": "2584",
                "cname": "长顺县",
                "pid": "2575"
              },
              {
                "id": "2576",
                "cname": "都匀市",
                "pid": "2575"
              },
              {
                "id": "2581",
                "cname": "独山县",
                "pid": "2575"
              },
              {
                "id": "2577",
                "cname": "福泉市",
                "pid": "2575"
              },
              {
                "id": "2579",
                "cname": "贵定县",
                "pid": "2575"
              },
              {
                "id": "2586",
                "cname": "惠水县",
                "pid": "2575"
              },
              {
                "id": "2578",
                "cname": "荔波县",
                "pid": "2575"
              },
              {
                "id": "2583",
                "cname": "罗甸县",
                "pid": "2575"
              },
              {
                "id": "2585",
                "cname": "龙里县",
                "pid": "2575"
              },
              {
                "id": "2582",
                "cname": "平塘县",
                "pid": "2575"
              },
              {
                "id": "2587",
                "cname": "三都水族自治县",
                "pid": "2575"
              },
              {
                "id": "2580",
                "cname": "瓮安县",
                "pid": "2575"
              },
              {
                "id": "100347",
                "cname": "其他",
                "pid": "2575"
              }
            ]
          },
          {
            "id": "2529",
            "cname": "铜仁",
            "pid": "2490",
            "childrens": [
              {
                "id": "2536",
                "cname": "德江县",
                "pid": "2529"
              },
              {
                "id": "2531",
                "cname": "江口县",
                "pid": "2529"
              },
              {
                "id": "2533",
                "cname": "石阡县",
                "pid": "2529"
              },
              {
                "id": "2534",
                "cname": "思南县",
                "pid": "2529"
              },
              {
                "id": "2538",
                "cname": "松桃苗族自治县",
                "pid": "2529"
              },
              {
                "id": "2530",
                "cname": "铜仁市",
                "pid": "2529"
              },
              {
                "id": "2539",
                "cname": "万山特区",
                "pid": "2529"
              },
              {
                "id": "2532",
                "cname": "玉屏侗族自治县",
                "pid": "2529"
              },
              {
                "id": "2535",
                "cname": "印江土家族苗族自治县",
                "pid": "2529"
              },
              {
                "id": "2537",
                "cname": "沿河土家族自治县",
                "pid": "2529"
              },
              {
                "id": "100417",
                "cname": "其他",
                "pid": "2529"
              }
            ]
          },
          {
            "id": "2507",
            "cname": "遵义",
            "pid": "2490",
            "childrens": [
              {
                "id": "2520",
                "cname": "赤水市",
                "pid": "2507"
              },
              {
                "id": "2514",
                "cname": "道真仡佬族苗族自治县",
                "pid": "2507"
              },
              {
                "id": "2516",
                "cname": "凤冈县",
                "pid": "2507"
              },
              {
                "id": "2508",
                "cname": "红花岗区",
                "pid": "2507"
              },
              {
                "id": "2509",
                "cname": "汇川区",
                "pid": "2507"
              },
              {
                "id": "2517",
                "cname": "湄潭县",
                "pid": "2507"
              },
              {
                "id": "2521",
                "cname": "仁怀市",
                "pid": "2507"
              },
              {
                "id": "2512",
                "cname": "绥阳县",
                "pid": "2507"
              },
              {
                "id": "2511",
                "cname": "桐梓县",
                "pid": "2507"
              },
              {
                "id": "2515",
                "cname": "务川仡佬族苗族自治县",
                "pid": "2507"
              },
              {
                "id": "2519",
                "cname": "习水县",
                "pid": "2507"
              },
              {
                "id": "2518",
                "cname": "余庆县",
                "pid": "2507"
              },
              {
                "id": "2510",
                "cname": "遵义县",
                "pid": "2507"
              },
              {
                "id": "2513",
                "cname": "正安县",
                "pid": "2507"
              },
              {
                "id": "100345",
                "cname": "其他",
                "pid": "2507"
              }
            ]
          }
        ]
      },
      {
        "id": "2933",
        "cname": "甘肃",
        "pid": "1",
        "childrens": [
          {
            "id": "2948",
            "cname": "白银",
            "pid": "2933",
            "childrens": [
              {
                "id": "2949",
                "cname": "白银区",
                "pid": "2948"
              },
              {
                "id": "2952",
                "cname": "会宁县",
                "pid": "2948"
              },
              {
                "id": "2951",
                "cname": "靖远县",
                "pid": "2948"
              },
              {
                "id": "2953",
                "cname": "景泰县",
                "pid": "2948"
              },
              {
                "id": "2950",
                "cname": "平川区",
                "pid": "2948"
              },
              {
                "id": "100209",
                "cname": "其他",
                "pid": "2948"
              }
            ]
          },
          {
            "id": "2999",
            "cname": "定西",
            "pid": "2933",
            "childrens": [
              {
                "id": "3000",
                "cname": "安定区",
                "pid": "2999"
              },
              {
                "id": "3002",
                "cname": "陇西县",
                "pid": "2999"
              },
              {
                "id": "3004",
                "cname": "临洮县",
                "pid": "2999"
              },
              {
                "id": "3006",
                "cname": "岷县",
                "pid": "2999"
              },
              {
                "id": "3001",
                "cname": "通渭县",
                "pid": "2999"
              },
              {
                "id": "3003",
                "cname": "渭源县",
                "pid": "2999"
              },
              {
                "id": "3005",
                "cname": "漳县",
                "pid": "2999"
              },
              {
                "id": "100035",
                "cname": "其他",
                "pid": "2999"
              }
            ]
          },
          {
            "id": "3026",
            "cname": "甘南",
            "pid": "2933",
            "childrens": [
              {
                "id": "3031",
                "cname": "迭部县",
                "pid": "3026"
              },
              {
                "id": "3027",
                "cname": "合作市",
                "pid": "3026"
              },
              {
                "id": "3028",
                "cname": "临潭县",
                "pid": "3026"
              },
              {
                "id": "3033",
                "cname": "碌曲县",
                "pid": "3026"
              },
              {
                "id": "3032",
                "cname": "玛曲县",
                "pid": "3026"
              },
              {
                "id": "3034",
                "cname": "夏河县",
                "pid": "3026"
              },
              {
                "id": "3029",
                "cname": "卓尼县",
                "pid": "3026"
              },
              {
                "id": "3030",
                "cname": "舟曲县",
                "pid": "3026"
              },
              {
                "id": "100423",
                "cname": "其他",
                "pid": "3026"
              }
            ]
          },
          {
            "id": "2943",
            "cname": "嘉峪关",
            "pid": "2933",
            "childrens": [
              {
                "id": "2944",
                "cname": "嘉峪关市",
                "pid": "2943"
              },
              {
                "id": "100533",
                "cname": "其他",
                "pid": "2943"
              }
            ]
          },
          {
            "id": "2945",
            "cname": "金昌",
            "pid": "2933",
            "childrens": [
              {
                "id": "2946",
                "cname": "金川区",
                "pid": "2945"
              },
              {
                "id": "2947",
                "cname": "永昌县",
                "pid": "2945"
              },
              {
                "id": "100534",
                "cname": "其他",
                "pid": "2945"
              }
            ]
          },
          {
            "id": "2982",
            "cname": "酒泉",
            "pid": "2933",
            "childrens": [
              {
                "id": "2987",
                "cname": "阿克塞哈萨克族自治县",
                "pid": "2982"
              },
              {
                "id": "2989",
                "cname": "敦煌市",
                "pid": "2982"
              },
              {
                "id": "2985",
                "cname": "瓜州县",
                "pid": "2982"
              },
              {
                "id": "2984",
                "cname": "金塔县",
                "pid": "2982"
              },
              {
                "id": "2983",
                "cname": "肃州区",
                "pid": "2982"
              },
              {
                "id": "2986",
                "cname": "肃北蒙古族自治县",
                "pid": "2982"
              },
              {
                "id": "2988",
                "cname": "玉门市",
                "pid": "2982"
              },
              {
                "id": "100034",
                "cname": "其他",
                "pid": "2982"
              }
            ]
          },
          {
            "id": "2934",
            "cname": "兰州市",
            "pid": "2933",
            "childrens": [
              {
                "id": "2938",
                "cname": "安宁区",
                "pid": "2934"
              },
              {
                "id": "2935",
                "cname": "城关区",
                "pid": "2934"
              },
              {
                "id": "2941",
                "cname": "皋兰县",
                "pid": "2934"
              },
              {
                "id": "2939",
                "cname": "红古区",
                "pid": "2934"
              },
              {
                "id": "2936",
                "cname": "七里河区",
                "pid": "2934"
              },
              {
                "id": "2937",
                "cname": "西固区",
                "pid": "2934"
              },
              {
                "id": "2940",
                "cname": "永登县",
                "pid": "2934"
              },
              {
                "id": "2942",
                "cname": "榆中县",
                "pid": "2934"
              },
              {
                "id": "100033",
                "cname": "其他",
                "pid": "2934"
              }
            ]
          },
          {
            "id": "3007",
            "cname": "陇南",
            "pid": "2933",
            "childrens": [
              {
                "id": "3009",
                "cname": "成县",
                "pid": "3007"
              },
              {
                "id": "3011",
                "cname": "宕昌县",
                "pid": "3007"
              },
              {
                "id": "3015",
                "cname": "徽县",
                "pid": "3007"
              },
              {
                "id": "3012",
                "cname": "康县",
                "pid": "3007"
              },
              {
                "id": "3014",
                "cname": "礼县",
                "pid": "3007"
              },
              {
                "id": "3016",
                "cname": "两当县",
                "pid": "3007"
              },
              {
                "id": "3008",
                "cname": "武都区",
                "pid": "3007"
              },
              {
                "id": "3010",
                "cname": "文县",
                "pid": "3007"
              },
              {
                "id": "3013",
                "cname": "西和县",
                "pid": "3007"
              },
              {
                "id": "100358",
                "cname": "其他",
                "pid": "3007"
              }
            ]
          },
          {
            "id": "3017",
            "cname": "临夏",
            "pid": "2933",
            "childrens": [
              {
                "id": "3024",
                "cname": "东乡族自治县",
                "pid": "3017"
              },
              {
                "id": "3022",
                "cname": "广河县",
                "pid": "3017"
              },
              {
                "id": "3023",
                "cname": "和政县",
                "pid": "3017"
              },
              {
                "id": "3025",
                "cname": "积石山保安族东乡族撒拉族自治县",
                "pid": "3017"
              },
              {
                "id": "3020",
                "cname": "康乐县",
                "pid": "3017"
              },
              {
                "id": "3018",
                "cname": "临夏市",
                "pid": "3017"
              },
              {
                "id": "3019",
                "cname": "临夏县",
                "pid": "3017"
              },
              {
                "id": "3021",
                "cname": "永靖县",
                "pid": "3017"
              },
              {
                "id": "100422",
                "cname": "其他",
                "pid": "3017"
              }
            ]
          },
          {
            "id": "2974",
            "cname": "平凉",
            "pid": "2933",
            "childrens": [
              {
                "id": "2978",
                "cname": "崇信县",
                "pid": "2974"
              },
              {
                "id": "2979",
                "cname": "华亭县",
                "pid": "2974"
              },
              {
                "id": "2976",
                "cname": "泾川县",
                "pid": "2974"
              },
              {
                "id": "2981",
                "cname": "静宁县",
                "pid": "2974"
              },
              {
                "id": "2975",
                "cname": "崆峒区",
                "pid": "2974"
              },
              {
                "id": "2977",
                "cname": "灵台县",
                "pid": "2974"
              },
              {
                "id": "2980",
                "cname": "庄浪县",
                "pid": "2974"
              },
              {
                "id": "100357",
                "cname": "其他",
                "pid": "2974"
              }
            ]
          },
          {
            "id": "2990",
            "cname": "庆阳",
            "pid": "2933",
            "childrens": [
              {
                "id": "2993",
                "cname": "环县",
                "pid": "2990"
              },
              {
                "id": "2994",
                "cname": "华池县",
                "pid": "2990"
              },
              {
                "id": "2995",
                "cname": "合水县",
                "pid": "2990"
              },
              {
                "id": "2997",
                "cname": "宁县",
                "pid": "2990"
              },
              {
                "id": "2992",
                "cname": "庆城县",
                "pid": "2990"
              },
              {
                "id": "2991",
                "cname": "西峰区",
                "pid": "2990"
              },
              {
                "id": "2996",
                "cname": "正宁县",
                "pid": "2990"
              },
              {
                "id": "2998",
                "cname": "镇原县",
                "pid": "2990"
              },
              {
                "id": "100514",
                "cname": "其他",
                "pid": "2990"
              }
            ]
          },
          {
            "id": "2954",
            "cname": "天水",
            "pid": "2933",
            "childrens": [
              {
                "id": "2959",
                "cname": "甘谷县",
                "pid": "2954"
              },
              {
                "id": "2956",
                "cname": "麦积区",
                "pid": "2954"
              },
              {
                "id": "2955",
                "cname": "秦州区",
                "pid": "2954"
              },
              {
                "id": "2957",
                "cname": "清水县",
                "pid": "2954"
              },
              {
                "id": "2958",
                "cname": "秦安县",
                "pid": "2954"
              },
              {
                "id": "2960",
                "cname": "武山县",
                "pid": "2954"
              },
              {
                "id": "2961",
                "cname": "张家川回族自治县",
                "pid": "2954"
              },
              {
                "id": "100481",
                "cname": "其他",
                "pid": "2954"
              }
            ]
          },
          {
            "id": "2962",
            "cname": "武威",
            "pid": "2933",
            "childrens": [
              {
                "id": "2965",
                "cname": "古浪县",
                "pid": "2962"
              },
              {
                "id": "2963",
                "cname": "凉州区",
                "pid": "2962"
              },
              {
                "id": "2964",
                "cname": "民勤县",
                "pid": "2962"
              },
              {
                "id": "2966",
                "cname": "天祝藏族自治县",
                "pid": "2962"
              },
              {
                "id": "100482",
                "cname": "其他",
                "pid": "2962"
              }
            ]
          },
          {
            "id": "2967",
            "cname": "张掖",
            "pid": "2933",
            "childrens": [
              {
                "id": "2968",
                "cname": "甘州区",
                "pid": "2967"
              },
              {
                "id": "2972",
                "cname": "高台县",
                "pid": "2967"
              },
              {
                "id": "2971",
                "cname": "临泽县",
                "pid": "2967"
              },
              {
                "id": "2970",
                "cname": "民乐县",
                "pid": "2967"
              },
              {
                "id": "2969",
                "cname": "肃南裕固族自治县",
                "pid": "2967"
              },
              {
                "id": "2973",
                "cname": "山丹县",
                "pid": "2967"
              },
              {
                "id": "100483",
                "cname": "其他",
                "pid": "2967"
              }
            ]
          }
        ]
      },
      {
        "id": "38",
        "cname": "河北",
        "pid": "1",
        "childrens": [
          {
            "id": "126",
            "cname": "保定",
            "pid": "38",
            "childrens": [
              {
                "id": "141",
                "cname": "安新县",
                "pid": "126"
              },
              {
                "id": "150",
                "cname": "安国市",
                "pid": "126"
              },
              {
                "id": "128",
                "cname": "北市区",
                "pid": "126"
              },
              {
                "id": "146",
                "cname": "博野县",
                "pid": "126"
              },
              {
                "id": "135",
                "cname": "定兴县",
                "pid": "126"
              },
              {
                "id": "149",
                "cname": "定州市",
                "pid": "126"
              },
              {
                "id": "133",
                "cname": "阜平县",
                "pid": "126"
              },
              {
                "id": "137",
                "cname": "高阳县",
                "pid": "126"
              },
              {
                "id": "151",
                "cname": "高碑店市",
                "pid": "126"
              },
              {
                "id": "132",
                "cname": "涞水县",
                "pid": "126"
              },
              {
                "id": "139",
                "cname": "涞源县",
                "pid": "126"
              },
              {
                "id": "144",
                "cname": "蠡县",
                "pid": "126"
              },
              {
                "id": "130",
                "cname": "满城县",
                "pid": "126"
              },
              {
                "id": "129",
                "cname": "南市区",
                "pid": "126"
              },
              {
                "id": "131",
                "cname": "清苑县",
                "pid": "126"
              },
              {
                "id": "143",
                "cname": "曲阳县",
                "pid": "126"
              },
              {
                "id": "138",
                "cname": "容城县",
                "pid": "126"
              },
              {
                "id": "145",
                "cname": "顺平县",
                "pid": "126"
              },
              {
                "id": "136",
                "cname": "唐县",
                "pid": "126"
              },
              {
                "id": "140",
                "cname": "望都县",
                "pid": "126"
              },
              {
                "id": "127",
                "cname": "新市区",
                "pid": "126"
              },
              {
                "id": "134",
                "cname": "徐水县",
                "pid": "126"
              },
              {
                "id": "147",
                "cname": "雄县",
                "pid": "126"
              },
              {
                "id": "142",
                "cname": "易县",
                "pid": "126"
              },
              {
                "id": "148",
                "cname": "涿州市",
                "pid": "126"
              },
              {
                "id": "100001",
                "cname": "其他",
                "pid": "126"
              }
            ]
          },
          {
            "id": "170",
            "cname": "承德",
            "pid": "38",
            "childrens": [
              {
                "id": "174",
                "cname": "承德县",
                "pid": "170"
              },
              {
                "id": "179",
                "cname": "丰宁满族自治县",
                "pid": "170"
              },
              {
                "id": "180",
                "cname": "宽城满族自治县",
                "pid": "170"
              },
              {
                "id": "177",
                "cname": "滦平县",
                "pid": "170"
              },
              {
                "id": "178",
                "cname": "隆化县",
                "pid": "170"
              },
              {
                "id": "176",
                "cname": "平泉县",
                "pid": "170"
              },
              {
                "id": "171",
                "cname": "双桥区",
                "pid": "170"
              },
              {
                "id": "172",
                "cname": "双滦区",
                "pid": "170"
              },
              {
                "id": "181",
                "cname": "围场满族蒙古族自治县",
                "pid": "170"
              },
              {
                "id": "175",
                "cname": "兴隆县",
                "pid": "170"
              },
              {
                "id": "173",
                "cname": "鹰手营子矿区",
                "pid": "170"
              },
              {
                "id": "100294",
                "cname": "其他",
                "pid": "170"
              }
            ]
          },
          {
            "id": "182",
            "cname": "沧州",
            "pid": "38",
            "childrens": [
              {
                "id": "195",
                "cname": "泊头市",
                "pid": "182"
              },
              {
                "id": "185",
                "cname": "沧县",
                "pid": "182"
              },
              {
                "id": "187",
                "cname": "东光县",
                "pid": "182"
              },
              {
                "id": "188",
                "cname": "海兴县",
                "pid": "182"
              },
              {
                "id": "197",
                "cname": "黄骅市",
                "pid": "182"
              },
              {
                "id": "198",
                "cname": "河间市",
                "pid": "182"
              },
              {
                "id": "194",
                "cname": "孟村回族自治县",
                "pid": "182"
              },
              {
                "id": "191",
                "cname": "南皮县",
                "pid": "182"
              },
              {
                "id": "186",
                "cname": "青县",
                "pid": "182"
              },
              {
                "id": "196",
                "cname": "任丘市",
                "pid": "182"
              },
              {
                "id": "190",
                "cname": "肃宁县",
                "pid": "182"
              },
              {
                "id": "192",
                "cname": "吴桥县",
                "pid": "182"
              },
              {
                "id": "183",
                "cname": "新华区",
                "pid": "182"
              },
              {
                "id": "193",
                "cname": "献县",
                "pid": "182"
              },
              {
                "id": "184",
                "cname": "运河区",
                "pid": "182"
              },
              {
                "id": "189",
                "cname": "盐山县",
                "pid": "182"
              },
              {
                "id": "100157",
                "cname": "其他",
                "pid": "182"
              }
            ]
          },
          {
            "id": "86",
            "cname": "邯郸",
            "pid": "38",
            "childrens": [
              {
                "id": "88",
                "cname": "丛台区",
                "pid": "86"
              },
              {
                "id": "93",
                "cname": "成安县",
                "pid": "86"
              },
              {
                "id": "96",
                "cname": "磁县",
                "pid": "86"
              },
              {
                "id": "94",
                "cname": "大名县",
                "pid": "86"
              },
              {
                "id": "89",
                "cname": "复兴区",
                "pid": "86"
              },
              {
                "id": "90",
                "cname": "峰峰矿区",
                "pid": "86"
              },
              {
                "id": "97",
                "cname": "肥乡县",
                "pid": "86"
              },
              {
                "id": "101",
                "cname": "广平县",
                "pid": "86"
              },
              {
                "id": "102",
                "cname": "馆陶县",
                "pid": "86"
              },
              {
                "id": "87",
                "cname": "邯山区",
                "pid": "86"
              },
              {
                "id": "91",
                "cname": "邯郸县",
                "pid": "86"
              },
              {
                "id": "100",
                "cname": "鸡泽县",
                "pid": "86"
              },
              {
                "id": "92",
                "cname": "临漳县",
                "pid": "86"
              },
              {
                "id": "99",
                "cname": "邱县",
                "pid": "86"
              },
              {
                "id": "104",
                "cname": "曲周县",
                "pid": "86"
              },
              {
                "id": "95",
                "cname": "涉县",
                "pid": "86"
              },
              {
                "id": "103",
                "cname": "魏县",
                "pid": "86"
              },
              {
                "id": "105",
                "cname": "武安市",
                "pid": "86"
              },
              {
                "id": "98",
                "cname": "永年县",
                "pid": "86"
              },
              {
                "id": "100292",
                "cname": "其他",
                "pid": "86"
              }
            ]
          },
          {
            "id": "210",
            "cname": "衡水",
            "pid": "38",
            "childrens": [
              {
                "id": "216",
                "cname": "安平县",
                "pid": "210"
              },
              {
                "id": "219",
                "cname": "阜城县",
                "pid": "210"
              },
              {
                "id": "217",
                "cname": "故城县",
                "pid": "210"
              },
              {
                "id": "218",
                "cname": "景县",
                "pid": "210"
              },
              {
                "id": "220",
                "cname": "冀州市",
                "pid": "210"
              },
              {
                "id": "215",
                "cname": "饶阳县",
                "pid": "210"
              },
              {
                "id": "221",
                "cname": "深州市",
                "pid": "210"
              },
              {
                "id": "211",
                "cname": "桃城区",
                "pid": "210"
              },
              {
                "id": "213",
                "cname": "武邑县",
                "pid": "210"
              },
              {
                "id": "214",
                "cname": "武强县",
                "pid": "210"
              },
              {
                "id": "212",
                "cname": "枣强县",
                "pid": "210"
              },
              {
                "id": "100003",
                "cname": "其他",
                "pid": "210"
              }
            ]
          },
          {
            "id": "199",
            "cname": "廊坊",
            "pid": "38",
            "childrens": [
              {
                "id": "200",
                "cname": "安次区",
                "pid": "199"
              },
              {
                "id": "208",
                "cname": "霸州市",
                "pid": "199"
              },
              {
                "id": "205",
                "cname": "大城县",
                "pid": "199"
              },
              {
                "id": "207",
                "cname": "大厂回族自治县",
                "pid": "199"
              },
              {
                "id": "201",
                "cname": "广阳区",
                "pid": "199"
              },
              {
                "id": "202",
                "cname": "固安县",
                "pid": "199"
              },
              {
                "id": "209",
                "cname": "三河市",
                "pid": "199"
              },
              {
                "id": "206",
                "cname": "文安县",
                "pid": "199"
              },
              {
                "id": "204",
                "cname": "香河县",
                "pid": "199"
              },
              {
                "id": "203",
                "cname": "永清县",
                "pid": "199"
              },
              {
                "id": "100002",
                "cname": "其他",
                "pid": "199"
              }
            ]
          },
          {
            "id": "78",
            "cname": "秦皇岛",
            "pid": "38",
            "childrens": [
              {
                "id": "81",
                "cname": "北戴河区",
                "pid": "78"
              },
              {
                "id": "83",
                "cname": "昌黎县",
                "pid": "78"
              },
              {
                "id": "84",
                "cname": "抚宁县",
                "pid": "78"
              },
              {
                "id": "79",
                "cname": "海港区",
                "pid": "78"
              },
              {
                "id": "85",
                "cname": "卢龙县",
                "pid": "78"
              },
              {
                "id": "82",
                "cname": "青龙满族自治县",
                "pid": "78"
              },
              {
                "id": "80",
                "cname": "山海关区",
                "pid": "78"
              },
              {
                "id": "100155",
                "cname": "其他",
                "pid": "78"
              }
            ]
          },
          {
            "id": "39",
            "cname": "石家庄",
            "pid": "38",
            "childrens": [
              {
                "id": "40",
                "cname": "长安区",
                "pid": "39"
              },
              {
                "id": "51",
                "cname": "高邑县",
                "pid": "39"
              },
              {
                "id": "59",
                "cname": "藁城市",
                "pid": "39"
              },
              {
                "id": "49",
                "cname": "行唐县",
                "pid": "39"
              },
              {
                "id": "44",
                "cname": "井陉矿区",
                "pid": "39"
              },
              {
                "id": "46",
                "cname": "井陉县",
                "pid": "39"
              },
              {
                "id": "60",
                "cname": "晋州市",
                "pid": "39"
              },
              {
                "id": "48",
                "cname": "栾城县",
                "pid": "39"
              },
              {
                "id": "50",
                "cname": "灵寿县",
                "pid": "39"
              },
              {
                "id": "62",
                "cname": "鹿泉市",
                "pid": "39"
              },
              {
                "id": "55",
                "cname": "平山县",
                "pid": "39"
              },
              {
                "id": "41",
                "cname": "桥东区",
                "pid": "39"
              },
              {
                "id": "42",
                "cname": "桥西区",
                "pid": "39"
              },
              {
                "id": "52",
                "cname": "深泽县",
                "pid": "39"
              },
              {
                "id": "54",
                "cname": "无极县",
                "pid": "39"
              },
              {
                "id": "43",
                "cname": "新华区",
                "pid": "39"
              },
              {
                "id": "58",
                "cname": "辛集市",
                "pid": "39"
              },
              {
                "id": "61",
                "cname": "新乐市",
                "pid": "39"
              },
              {
                "id": "45",
                "cname": "裕华区",
                "pid": "39"
              },
              {
                "id": "56",
                "cname": "元氏县",
                "pid": "39"
              },
              {
                "id": "47",
                "cname": "正定县",
                "pid": "39"
              },
              {
                "id": "53",
                "cname": "赞皇县",
                "pid": "39"
              },
              {
                "id": "57",
                "cname": "赵县",
                "pid": "39"
              },
              {
                "id": "100290",
                "cname": "其他",
                "pid": "39"
              }
            ]
          },
          {
            "id": "63",
            "cname": "唐山",
            "pid": "38",
            "childrens": [
              {
                "id": "70",
                "cname": "曹妃甸区",
                "pid": "63"
              },
              {
                "id": "68",
                "cname": "丰南区",
                "pid": "63"
              },
              {
                "id": "69",
                "cname": "丰润区",
                "pid": "63"
              },
              {
                "id": "66",
                "cname": "古冶区",
                "pid": "63"
              },
              {
                "id": "67",
                "cname": "开平区",
                "pid": "63"
              },
              {
                "id": "64",
                "cname": "路南区",
                "pid": "63"
              },
              {
                "id": "65",
                "cname": "路北区",
                "pid": "63"
              },
              {
                "id": "71",
                "cname": "滦县",
                "pid": "63"
              },
              {
                "id": "72",
                "cname": "滦南县",
                "pid": "63"
              },
              {
                "id": "73",
                "cname": "乐亭县",
                "pid": "63"
              },
              {
                "id": "74",
                "cname": "迁西县",
                "pid": "63"
              },
              {
                "id": "77",
                "cname": "迁安市",
                "pid": "63"
              },
              {
                "id": "75",
                "cname": "玉田县",
                "pid": "63"
              },
              {
                "id": "76",
                "cname": "遵化市",
                "pid": "63"
              },
              {
                "id": "100291",
                "cname": "其他",
                "pid": "63"
              }
            ]
          },
          {
            "id": "106",
            "cname": "邢台",
            "pid": "38",
            "childrens": [
              {
                "id": "112",
                "cname": "柏乡县",
                "pid": "106"
              },
              {
                "id": "119",
                "cname": "广宗县",
                "pid": "106"
              },
              {
                "id": "117",
                "cname": "巨鹿县",
                "pid": "106"
              },
              {
                "id": "110",
                "cname": "临城县",
                "pid": "106"
              },
              {
                "id": "113",
                "cname": "隆尧县",
                "pid": "106"
              },
              {
                "id": "123",
                "cname": "临西县",
                "pid": "106"
              },
              {
                "id": "111",
                "cname": "内丘县",
                "pid": "106"
              },
              {
                "id": "115",
                "cname": "南和县",
                "pid": "106"
              },
              {
                "id": "116",
                "cname": "宁晋县",
                "pid": "106"
              },
              {
                "id": "124",
                "cname": "南宫市",
                "pid": "106"
              },
              {
                "id": "120",
                "cname": "平乡县",
                "pid": "106"
              },
              {
                "id": "107",
                "cname": "桥东区",
                "pid": "106"
              },
              {
                "id": "108",
                "cname": "桥西区",
                "pid": "106"
              },
              {
                "id": "122",
                "cname": "清河县",
                "pid": "106"
              },
              {
                "id": "114",
                "cname": "任县",
                "pid": "106"
              },
              {
                "id": "125",
                "cname": "沙河市",
                "pid": "106"
              },
              {
                "id": "121",
                "cname": "威县",
                "pid": "106"
              },
              {
                "id": "109",
                "cname": "邢台县",
                "pid": "106"
              },
              {
                "id": "118",
                "cname": "新河县",
                "pid": "106"
              },
              {
                "id": "100156",
                "cname": "其他",
                "pid": "106"
              }
            ]
          },
          {
            "id": "152",
            "cname": "张家口",
            "pid": "38",
            "childrens": [
              {
                "id": "168",
                "cname": "赤城县",
                "pid": "152"
              },
              {
                "id": "169",
                "cname": "崇礼县",
                "pid": "152"
              },
              {
                "id": "160",
                "cname": "沽源县",
                "pid": "152"
              },
              {
                "id": "164",
                "cname": "怀安县",
                "pid": "152"
              },
              {
                "id": "166",
                "cname": "怀来县",
                "pid": "152"
              },
              {
                "id": "159",
                "cname": "康保县",
                "pid": "152"
              },
              {
                "id": "153",
                "cname": "桥东区",
                "pid": "152"
              },
              {
                "id": "154",
                "cname": "桥西区",
                "pid": "152"
              },
              {
                "id": "161",
                "cname": "尚义县",
                "pid": "152"
              },
              {
                "id": "162",
                "cname": "蔚县",
                "pid": "152"
              },
              {
                "id": "165",
                "cname": "万全县",
                "pid": "152"
              },
              {
                "id": "155",
                "cname": "宣化区",
                "pid": "152"
              },
              {
                "id": "156",
                "cname": "下花园区",
                "pid": "152"
              },
              {
                "id": "157",
                "cname": "宣化县",
                "pid": "152"
              },
              {
                "id": "163",
                "cname": "阳原县",
                "pid": "152"
              },
              {
                "id": "158",
                "cname": "张北县",
                "pid": "152"
              },
              {
                "id": "167",
                "cname": "涿鹿县",
                "pid": "152"
              },
              {
                "id": "100293",
                "cname": "其他",
                "pid": "152"
              }
            ]
          }
        ]
      },
      {
        "id": "652",
        "cname": "黑龙江",
        "pid": "1",
        "childrens": [
          {
            "id": "717",
            "cname": "大庆",
            "pid": "652",
            "childrens": [
              {
                "id": "722",
                "cname": "大同区",
                "pid": "717"
              },
              {
                "id": "726",
                "cname": "杜尔伯特蒙古族自治县",
                "pid": "717"
              },
              {
                "id": "721",
                "cname": "红岗区",
                "pid": "717"
              },
              {
                "id": "719",
                "cname": "龙凤区",
                "pid": "717"
              },
              {
                "id": "725",
                "cname": "林甸县",
                "pid": "717"
              },
              {
                "id": "720",
                "cname": "让胡路区",
                "pid": "717"
              },
              {
                "id": "718",
                "cname": "萨尔图区",
                "pid": "717"
              },
              {
                "id": "723",
                "cname": "肇州县",
                "pid": "717"
              },
              {
                "id": "724",
                "cname": "肇源县",
                "pid": "717"
              },
              {
                "id": "100379",
                "cname": "其他",
                "pid": "717"
              }
            ]
          },
          {
            "id": "790",
            "cname": "大兴安岭",
            "pid": "652",
            "childrens": [
              {
                "id": "791",
                "cname": "呼玛县",
                "pid": "790"
              },
              {
                "id": "793",
                "cname": "漠河县",
                "pid": "790"
              },
              {
                "id": "792",
                "cname": "塔河县",
                "pid": "790"
              },
              {
                "id": "100498",
                "cname": "其他",
                "pid": "790"
              }
            ]
          },
          {
            "id": "653",
            "cname": "哈尔滨",
            "pid": "652",
            "childrens": [
              {
                "id": "661",
                "cname": "阿城区",
                "pid": "653"
              },
              {
                "id": "664",
                "cname": "宾县",
                "pid": "653"
              },
              {
                "id": "665",
                "cname": "巴彦县",
                "pid": "653"
              },
              {
                "id": "654",
                "cname": "道里区",
                "pid": "653"
              },
              {
                "id": "656",
                "cname": "道外区",
                "pid": "653"
              },
              {
                "id": "663",
                "cname": "方正县",
                "pid": "653"
              },
              {
                "id": "660",
                "cname": "呼兰区",
                "pid": "653"
              },
              {
                "id": "666",
                "cname": "木兰县",
                "pid": "653"
              },
              {
                "id": "655",
                "cname": "南岗区",
                "pid": "653"
              },
              {
                "id": "657",
                "cname": "平房区",
                "pid": "653"
              },
              {
                "id": "658",
                "cname": "松北区",
                "pid": "653"
              },
              {
                "id": "669",
                "cname": "双城市",
                "pid": "653"
              },
              {
                "id": "670",
                "cname": "尚志市",
                "pid": "653"
              },
              {
                "id": "667",
                "cname": "通河县",
                "pid": "653"
              },
              {
                "id": "671",
                "cname": "五常市",
                "pid": "653"
              },
              {
                "id": "659",
                "cname": "香坊区",
                "pid": "653"
              },
              {
                "id": "662",
                "cname": "依兰县",
                "pid": "653"
              },
              {
                "id": "668",
                "cname": "延寿县",
                "pid": "653"
              },
              {
                "id": "100011",
                "cname": "其他",
                "pid": "653"
              }
            ]
          },
          {
            "id": "699",
            "cname": "鹤岗",
            "pid": "652",
            "childrens": [
              {
                "id": "704",
                "cname": "东山区",
                "pid": "699"
              },
              {
                "id": "701",
                "cname": "工农区",
                "pid": "699"
              },
              {
                "id": "706",
                "cname": "萝北县",
                "pid": "699"
              },
              {
                "id": "702",
                "cname": "南山区",
                "pid": "699"
              },
              {
                "id": "707",
                "cname": "绥滨县",
                "pid": "699"
              },
              {
                "id": "700",
                "cname": "向阳区",
                "pid": "699"
              },
              {
                "id": "703",
                "cname": "兴安区",
                "pid": "699"
              },
              {
                "id": "705",
                "cname": "兴山区",
                "pid": "699"
              },
              {
                "id": "100378",
                "cname": "其他",
                "pid": "699"
              }
            ]
          },
          {
            "id": "772",
            "cname": "黑河",
            "pid": "652",
            "childrens": [
              {
                "id": "773",
                "cname": "爱辉区",
                "pid": "772"
              },
              {
                "id": "777",
                "cname": "北安市",
                "pid": "772"
              },
              {
                "id": "774",
                "cname": "嫩江县",
                "pid": "772"
              },
              {
                "id": "776",
                "cname": "孙吴县",
                "pid": "772"
              },
              {
                "id": "778",
                "cname": "五大连池市",
                "pid": "772"
              },
              {
                "id": "775",
                "cname": "逊克县",
                "pid": "772"
              },
              {
                "id": "100130",
                "cname": "其他",
                "pid": "772"
              }
            ]
          },
          {
            "id": "689",
            "cname": "鸡西",
            "pid": "652",
            "childrens": [
              {
                "id": "694",
                "cname": "城子河区",
                "pid": "689"
              },
              {
                "id": "692",
                "cname": "滴道区",
                "pid": "689"
              },
              {
                "id": "691",
                "cname": "恒山区",
                "pid": "689"
              },
              {
                "id": "697",
                "cname": "虎林市",
                "pid": "689"
              },
              {
                "id": "690",
                "cname": "鸡冠区",
                "pid": "689"
              },
              {
                "id": "696",
                "cname": "鸡东县",
                "pid": "689"
              },
              {
                "id": "693",
                "cname": "梨树区",
                "pid": "689"
              },
              {
                "id": "695",
                "cname": "麻山区",
                "pid": "689"
              },
              {
                "id": "698",
                "cname": "密山市",
                "pid": "689"
              },
              {
                "id": "100304",
                "cname": "其他",
                "pid": "689"
              }
            ]
          },
          {
            "id": "745",
            "cname": "佳木斯",
            "pid": "652",
            "childrens": [
              {
                "id": "748",
                "cname": "东风区",
                "pid": "745"
              },
              {
                "id": "753",
                "cname": "抚远县",
                "pid": "745"
              },
              {
                "id": "755",
                "cname": "富锦市",
                "pid": "745"
              },
              {
                "id": "750",
                "cname": "桦南县",
                "pid": "745"
              },
              {
                "id": "751",
                "cname": "桦川县",
                "pid": "745"
              },
              {
                "id": "749",
                "cname": "郊区",
                "pid": "745"
              },
              {
                "id": "747",
                "cname": "前进区",
                "pid": "745"
              },
              {
                "id": "752",
                "cname": "汤原县",
                "pid": "745"
              },
              {
                "id": "754",
                "cname": "同江市",
                "pid": "745"
              },
              {
                "id": "746",
                "cname": "向阳区",
                "pid": "745"
              },
              {
                "id": "100380",
                "cname": "其他",
                "pid": "745"
              }
            ]
          },
          {
            "id": "761",
            "cname": "牡丹江",
            "pid": "652",
            "childrens": [
              {
                "id": "764",
                "cname": "爱民区",
                "pid": "761"
              },
              {
                "id": "762",
                "cname": "东安区",
                "pid": "761"
              },
              {
                "id": "766",
                "cname": "东宁县",
                "pid": "761"
              },
              {
                "id": "769",
                "cname": "海林市",
                "pid": "761"
              },
              {
                "id": "767",
                "cname": "林口县",
                "pid": "761"
              },
              {
                "id": "771",
                "cname": "穆棱市",
                "pid": "761"
              },
              {
                "id": "770",
                "cname": "宁安市",
                "pid": "761"
              },
              {
                "id": "768",
                "cname": "绥芬河市",
                "pid": "761"
              },
              {
                "id": "765",
                "cname": "西安区",
                "pid": "761"
              },
              {
                "id": "763",
                "cname": "阳明区",
                "pid": "761"
              },
              {
                "id": "100129",
                "cname": "其他",
                "pid": "761"
              }
            ]
          },
          {
            "id": "672",
            "cname": "齐齐哈尔",
            "pid": "652",
            "childrens": [
              {
                "id": "676",
                "cname": "昂昂溪区",
                "pid": "672"
              },
              {
                "id": "687",
                "cname": "拜泉县",
                "pid": "672"
              },
              {
                "id": "677",
                "cname": "富拉尔基区",
                "pid": "672"
              },
              {
                "id": "684",
                "cname": "富裕县",
                "pid": "672"
              },
              {
                "id": "683",
                "cname": "甘南县",
                "pid": "672"
              },
              {
                "id": "674",
                "cname": "建华区",
                "pid": "672"
              },
              {
                "id": "685",
                "cname": "克山县",
                "pid": "672"
              },
              {
                "id": "686",
                "cname": "克东县",
                "pid": "672"
              },
              {
                "id": "673",
                "cname": "龙沙区",
                "pid": "672"
              },
              {
                "id": "680",
                "cname": "龙江县",
                "pid": "672"
              },
              {
                "id": "679",
                "cname": "梅里斯达斡尔族区",
                "pid": "672"
              },
              {
                "id": "678",
                "cname": "碾子山区",
                "pid": "672"
              },
              {
                "id": "688",
                "cname": "讷河市",
                "pid": "672"
              },
              {
                "id": "675",
                "cname": "铁锋区",
                "pid": "672"
              },
              {
                "id": "682",
                "cname": "泰来县",
                "pid": "672"
              },
              {
                "id": "681",
                "cname": "依安县",
                "pid": "672"
              },
              {
                "id": "100126",
                "cname": "其他",
                "pid": "672"
              }
            ]
          },
          {
            "id": "756",
            "cname": "七台河",
            "pid": "652",
            "childrens": [
              {
                "id": "760",
                "cname": "勃利县",
                "pid": "756"
              },
              {
                "id": "759",
                "cname": "茄子河区",
                "pid": "756"
              },
              {
                "id": "758",
                "cname": "桃山区",
                "pid": "756"
              },
              {
                "id": "757",
                "cname": "新兴区",
                "pid": "756"
              },
              {
                "id": "100167",
                "cname": "其他",
                "pid": "756"
              }
            ]
          },
          {
            "id": "708",
            "cname": "双鸭山",
            "pid": "652",
            "childrens": [
              {
                "id": "712",
                "cname": "宝山区",
                "pid": "708"
              },
              {
                "id": "715",
                "cname": "宝清县",
                "pid": "708"
              },
              {
                "id": "709",
                "cname": "尖山区",
                "pid": "708"
              },
              {
                "id": "713",
                "cname": "集贤县",
                "pid": "708"
              },
              {
                "id": "710",
                "cname": "岭东区",
                "pid": "708"
              },
              {
                "id": "716",
                "cname": "饶河县",
                "pid": "708"
              },
              {
                "id": "711",
                "cname": "四方台区",
                "pid": "708"
              },
              {
                "id": "714",
                "cname": "友谊县",
                "pid": "708"
              },
              {
                "id": "100166",
                "cname": "其他",
                "pid": "708"
              }
            ]
          },
          {
            "id": "779",
            "cname": "绥化",
            "pid": "652",
            "childrens": [
              {
                "id": "787",
                "cname": "安达市",
                "pid": "779"
              },
              {
                "id": "780",
                "cname": "北林区",
                "pid": "779"
              },
              {
                "id": "789",
                "cname": "海伦市",
                "pid": "779"
              },
              {
                "id": "782",
                "cname": "兰西县",
                "pid": "779"
              },
              {
                "id": "785",
                "cname": "明水县",
                "pid": "779"
              },
              {
                "id": "783",
                "cname": "青冈县",
                "pid": "779"
              },
              {
                "id": "784",
                "cname": "庆安县",
                "pid": "779"
              },
              {
                "id": "786",
                "cname": "绥棱县",
                "pid": "779"
              },
              {
                "id": "781",
                "cname": "望奎县",
                "pid": "779"
              },
              {
                "id": "788",
                "cname": "肇东市",
                "pid": "779"
              },
              {
                "id": "100012",
                "cname": "其他",
                "pid": "779"
              }
            ]
          },
          {
            "id": "727",
            "cname": "伊春",
            "pid": "652",
            "childrens": [
              {
                "id": "732",
                "cname": "翠峦区",
                "pid": "727"
              },
              {
                "id": "739",
                "cname": "带岭区",
                "pid": "727"
              },
              {
                "id": "741",
                "cname": "红星区",
                "pid": "727"
              },
              {
                "id": "735",
                "cname": "金山屯区",
                "pid": "727"
              },
              {
                "id": "743",
                "cname": "嘉荫县",
                "pid": "727"
              },
              {
                "id": "734",
                "cname": "美溪区",
                "pid": "727"
              },
              {
                "id": "729",
                "cname": "南岔区",
                "pid": "727"
              },
              {
                "id": "742",
                "cname": "上甘岭区",
                "pid": "727"
              },
              {
                "id": "738",
                "cname": "汤旺河区",
                "pid": "727"
              },
              {
                "id": "744",
                "cname": "铁力市",
                "pid": "727"
              },
              {
                "id": "736",
                "cname": "五营区",
                "pid": "727"
              },
              {
                "id": "737",
                "cname": "乌马河区",
                "pid": "727"
              },
              {
                "id": "740",
                "cname": "乌伊岭区",
                "pid": "727"
              },
              {
                "id": "731",
                "cname": "西林区",
                "pid": "727"
              },
              {
                "id": "733",
                "cname": "新青区",
                "pid": "727"
              },
              {
                "id": "728",
                "cname": "伊春区",
                "pid": "727"
              },
              {
                "id": "730",
                "cname": "友好区",
                "pid": "727"
              },
              {
                "id": "100305",
                "cname": "其他",
                "pid": "727"
              }
            ]
          }
        ]
      },
      {
        "id": "1520",
        "cname": "河南",
        "pid": "1",
        "childrens": [
          {
            "id": "1572",
            "cname": "安阳",
            "pid": "1520",
            "childrens": [
              {
                "id": "1577",
                "cname": "安阳县",
                "pid": "1572"
              },
              {
                "id": "1574",
                "cname": "北关区",
                "pid": "1572"
              },
              {
                "id": "1579",
                "cname": "滑县",
                "pid": "1572"
              },
              {
                "id": "1576",
                "cname": "龙安区",
                "pid": "1572"
              },
              {
                "id": "1581",
                "cname": "林州市",
                "pid": "1572"
              },
              {
                "id": "1580",
                "cname": "内黄县",
                "pid": "1572"
              },
              {
                "id": "1578",
                "cname": "汤阴县",
                "pid": "1572"
              },
              {
                "id": "1573",
                "cname": "文峰区",
                "pid": "1572"
              },
              {
                "id": "1575",
                "cname": "殷都区",
                "pid": "1572"
              },
              {
                "id": "100020",
                "cname": "其他",
                "pid": "1572"
              }
            ]
          },
          {
            "id": "1582",
            "cname": "鹤壁",
            "pid": "1520",
            "childrens": [
              {
                "id": "1583",
                "cname": "鹤山区",
                "pid": "1582"
              },
              {
                "id": "1586",
                "cname": "浚县",
                "pid": "1582"
              },
              {
                "id": "1585",
                "cname": "淇滨区",
                "pid": "1582"
              },
              {
                "id": "1587",
                "cname": "淇县",
                "pid": "1582"
              },
              {
                "id": "1584",
                "cname": "山城区",
                "pid": "1582"
              },
              {
                "id": "100506",
                "cname": "其他",
                "pid": "1582"
              }
            ]
          },
          {
            "id": "1601",
            "cname": "焦作",
            "pid": "1520",
            "childrens": [
              {
                "id": "1607",
                "cname": "博爱县",
                "pid": "1601"
              },
              {
                "id": "1602",
                "cname": "解放区",
                "pid": "1601"
              },
              {
                "id": "1604",
                "cname": "马村区",
                "pid": "1601"
              },
              {
                "id": "1611",
                "cname": "孟州市",
                "pid": "1601"
              },
              {
                "id": "1610",
                "cname": "沁阳市",
                "pid": "1601"
              },
              {
                "id": "1605",
                "cname": "山阳区",
                "pid": "1601"
              },
              {
                "id": "1608",
                "cname": "武陟县",
                "pid": "1601"
              },
              {
                "id": "1609",
                "cname": "温县",
                "pid": "1601"
              },
              {
                "id": "1606",
                "cname": "修武县",
                "pid": "1601"
              },
              {
                "id": "1603",
                "cname": "中站区",
                "pid": "1601"
              },
              {
                "id": "100182",
                "cname": "其他",
                "pid": "1601"
              }
            ]
          },
          {
            "id": "1696",
            "cname": "济源",
            "pid": "1520"
          },
          {
            "id": "1534",
            "cname": "开封",
            "pid": "1520",
            "childrens": [
              {
                "id": "1537",
                "cname": "鼓楼区",
                "pid": "1534"
              },
              {
                "id": "1539",
                "cname": "金明区",
                "pid": "1534"
              },
              {
                "id": "1543",
                "cname": "开封县",
                "pid": "1534"
              },
              {
                "id": "1535",
                "cname": "龙亭区",
                "pid": "1534"
              },
              {
                "id": "1544",
                "cname": "兰考县",
                "pid": "1534"
              },
              {
                "id": "1540",
                "cname": "杞县",
                "pid": "1534"
              },
              {
                "id": "1536",
                "cname": "顺河回族区",
                "pid": "1534"
              },
              {
                "id": "1541",
                "cname": "通许县",
                "pid": "1534"
              },
              {
                "id": "1542",
                "cname": "尉氏县",
                "pid": "1534"
              },
              {
                "id": "1538",
                "cname": "禹王台区",
                "pid": "1534"
              },
              {
                "id": "100469",
                "cname": "其他",
                "pid": "1534"
              }
            ]
          },
          {
            "id": "1545",
            "cname": "洛阳",
            "pid": "1520",
            "childrens": [
              {
                "id": "1548",
                "cname": "瀍河回族区",
                "pid": "1545"
              },
              {
                "id": "1549",
                "cname": "涧西区",
                "pid": "1545"
              },
              {
                "id": "1550",
                "cname": "吉利区",
                "pid": "1545"
              },
              {
                "id": "1546",
                "cname": "老城区",
                "pid": "1545"
              },
              {
                "id": "1551",
                "cname": "洛龙区",
                "pid": "1545"
              },
              {
                "id": "1554",
                "cname": "栾川县",
                "pid": "1545"
              },
              {
                "id": "1558",
                "cname": "洛宁县",
                "pid": "1545"
              },
              {
                "id": "1552",
                "cname": "孟津县",
                "pid": "1545"
              },
              {
                "id": "1556",
                "cname": "汝阳县",
                "pid": "1545"
              },
              {
                "id": "1555",
                "cname": "嵩县",
                "pid": "1545"
              },
              {
                "id": "1547",
                "cname": "西工区",
                "pid": "1545"
              },
              {
                "id": "1553",
                "cname": "新安县",
                "pid": "1545"
              },
              {
                "id": "1557",
                "cname": "宜阳县",
                "pid": "1545"
              },
              {
                "id": "1559",
                "cname": "伊川县",
                "pid": "1545"
              },
              {
                "id": "1560",
                "cname": "偃师市",
                "pid": "1545"
              },
              {
                "id": "100323",
                "cname": "其他",
                "pid": "1545"
              }
            ]
          },
          {
            "id": "1626",
            "cname": "漯河",
            "pid": "1520",
            "childrens": [
              {
                "id": "1631",
                "cname": "临颍县",
                "pid": "1626"
              },
              {
                "id": "1630",
                "cname": "舞阳县",
                "pid": "1626"
              },
              {
                "id": "1627",
                "cname": "源汇区",
                "pid": "1626"
              },
              {
                "id": "1628",
                "cname": "郾城区",
                "pid": "1626"
              },
              {
                "id": "1629",
                "cname": "召陵区",
                "pid": "1626"
              },
              {
                "id": "100545",
                "cname": "其他",
                "pid": "1626"
              }
            ]
          },
          {
            "id": "1639",
            "cname": "南阳",
            "pid": "1520",
            "childrens": [
              {
                "id": "1652",
                "cname": "邓州市",
                "pid": "1639"
              },
              {
                "id": "1643",
                "cname": "方城县",
                "pid": "1639"
              },
              {
                "id": "1642",
                "cname": "南召县",
                "pid": "1639"
              },
              {
                "id": "1646",
                "cname": "内乡县",
                "pid": "1639"
              },
              {
                "id": "1648",
                "cname": "社旗县",
                "pid": "1639"
              },
              {
                "id": "1649",
                "cname": "唐河县",
                "pid": "1639"
              },
              {
                "id": "1651",
                "cname": "桐柏县",
                "pid": "1639"
              },
              {
                "id": "1640",
                "cname": "宛城区",
                "pid": "1639"
              },
              {
                "id": "1641",
                "cname": "卧龙区",
                "pid": "1639"
              },
              {
                "id": "1644",
                "cname": "西峡县",
                "pid": "1639"
              },
              {
                "id": "1647",
                "cname": "淅川县",
                "pid": "1639"
              },
              {
                "id": "1650",
                "cname": "新野县",
                "pid": "1639"
              },
              {
                "id": "1645",
                "cname": "镇平县",
                "pid": "1639"
              },
              {
                "id": "100397",
                "cname": "其他",
                "pid": "1639"
              }
            ]
          },
          {
            "id": "1561",
            "cname": "平顶山",
            "pid": "1520",
            "childrens": [
              {
                "id": "1566",
                "cname": "宝丰县",
                "pid": "1561"
              },
              {
                "id": "1569",
                "cname": "郏县",
                "pid": "1561"
              },
              {
                "id": "1568",
                "cname": "鲁山县",
                "pid": "1561"
              },
              {
                "id": "1571",
                "cname": "汝州市",
                "pid": "1561"
              },
              {
                "id": "1564",
                "cname": "石龙区",
                "pid": "1561"
              },
              {
                "id": "1563",
                "cname": "卫东区",
                "pid": "1561"
              },
              {
                "id": "1570",
                "cname": "舞钢市",
                "pid": "1561"
              },
              {
                "id": "1562",
                "cname": "新华区",
                "pid": "1561"
              },
              {
                "id": "1567",
                "cname": "叶县",
                "pid": "1561"
              },
              {
                "id": "1565",
                "cname": "湛河区",
                "pid": "1561"
              },
              {
                "id": "100181",
                "cname": "其他",
                "pid": "1561"
              }
            ]
          },
          {
            "id": "1612",
            "cname": "濮阳",
            "pid": "1520",
            "childrens": [
              {
                "id": "1616",
                "cname": "范县",
                "pid": "1612"
              },
              {
                "id": "1613",
                "cname": "华龙区",
                "pid": "1612"
              },
              {
                "id": "1615",
                "cname": "南乐县",
                "pid": "1612"
              },
              {
                "id": "1618",
                "cname": "濮阳县",
                "pid": "1612"
              },
              {
                "id": "1614",
                "cname": "清丰县",
                "pid": "1612"
              },
              {
                "id": "1617",
                "cname": "台前县",
                "pid": "1612"
              },
              {
                "id": "100452",
                "cname": "其他",
                "pid": "1612"
              }
            ]
          },
          {
            "id": "1632",
            "cname": "三门峡",
            "pid": "1520",
            "childrens": [
              {
                "id": "1633",
                "cname": "湖滨区",
                "pid": "1632"
              },
              {
                "id": "1636",
                "cname": "卢氏县",
                "pid": "1632"
              },
              {
                "id": "1638",
                "cname": "灵宝市",
                "pid": "1632"
              },
              {
                "id": "1634",
                "cname": "渑池县",
                "pid": "1632"
              },
              {
                "id": "1635",
                "cname": "陕县",
                "pid": "1632"
              },
              {
                "id": "1637",
                "cname": "义马市",
                "pid": "1632"
              },
              {
                "id": "100507",
                "cname": "其他",
                "pid": "1632"
              }
            ]
          },
          {
            "id": "1653",
            "cname": "商丘",
            "pid": "1520",
            "childrens": [
              {
                "id": "1655",
                "cname": "睢阳区",
                "pid": "1653"
              },
              {
                "id": "1657",
                "cname": "睢县",
                "pid": "1653"
              },
              {
                "id": "1654",
                "cname": "梁园区",
                "pid": "1653"
              },
              {
                "id": "1656",
                "cname": "民权县",
                "pid": "1653"
              },
              {
                "id": "1658",
                "cname": "宁陵县",
                "pid": "1653"
              },
              {
                "id": "1661",
                "cname": "夏邑县",
                "pid": "1653"
              },
              {
                "id": "1660",
                "cname": "虞城县",
                "pid": "1653"
              },
              {
                "id": "1662",
                "cname": "永城市",
                "pid": "1653"
              },
              {
                "id": "1659",
                "cname": "柘城县",
                "pid": "1653"
              },
              {
                "id": "100508",
                "cname": "其他",
                "pid": "1653"
              }
            ]
          },
          {
            "id": "1588",
            "cname": "新乡",
            "pid": "1520",
            "childrens": [
              {
                "id": "1598",
                "cname": "长垣县",
                "pid": "1588"
              },
              {
                "id": "1591",
                "cname": "凤泉区",
                "pid": "1588"
              },
              {
                "id": "1597",
                "cname": "封丘县",
                "pid": "1588"
              },
              {
                "id": "1589",
                "cname": "红旗区",
                "pid": "1588"
              },
              {
                "id": "1594",
                "cname": "获嘉县",
                "pid": "1588"
              },
              {
                "id": "1600",
                "cname": "辉县市",
                "pid": "1588"
              },
              {
                "id": "1592",
                "cname": "牧野区",
                "pid": "1588"
              },
              {
                "id": "1590",
                "cname": "卫滨区",
                "pid": "1588"
              },
              {
                "id": "1599",
                "cname": "卫辉市",
                "pid": "1588"
              },
              {
                "id": "1593",
                "cname": "新乡县",
                "pid": "1588"
              },
              {
                "id": "1595",
                "cname": "原阳县",
                "pid": "1588"
              },
              {
                "id": "1596",
                "cname": "延津县",
                "pid": "1588"
              },
              {
                "id": "100324",
                "cname": "其他",
                "pid": "1588"
              }
            ]
          },
          {
            "id": "1619",
            "cname": "许昌",
            "pid": "1520",
            "childrens": [
              {
                "id": "1625",
                "cname": "长葛市",
                "pid": "1619"
              },
              {
                "id": "1620",
                "cname": "魏都区",
                "pid": "1619"
              },
              {
                "id": "1621",
                "cname": "许昌县",
                "pid": "1619"
              },
              {
                "id": "1623",
                "cname": "襄城县",
                "pid": "1619"
              },
              {
                "id": "1622",
                "cname": "鄢陵县",
                "pid": "1619"
              },
              {
                "id": "1624",
                "cname": "禹州市",
                "pid": "1619"
              },
              {
                "id": "100325",
                "cname": "其他",
                "pid": "1619"
              }
            ]
          },
          {
            "id": "1663",
            "cname": "信阳",
            "pid": "1520",
            "childrens": [
              {
                "id": "1667",
                "cname": "光山县",
                "pid": "1663"
              },
              {
                "id": "1670",
                "cname": "固始县",
                "pid": "1663"
              },
              {
                "id": "1671",
                "cname": "潢川县",
                "pid": "1663"
              },
              {
                "id": "1672",
                "cname": "淮滨县",
                "pid": "1663"
              },
              {
                "id": "1666",
                "cname": "罗山县",
                "pid": "1663"
              },
              {
                "id": "1665",
                "cname": "平桥区",
                "pid": "1663"
              },
              {
                "id": "1664",
                "cname": "浉河区",
                "pid": "1663"
              },
              {
                "id": "1669",
                "cname": "商城县",
                "pid": "1663"
              },
              {
                "id": "1668",
                "cname": "新县",
                "pid": "1663"
              },
              {
                "id": "1673",
                "cname": "息县",
                "pid": "1663"
              },
              {
                "id": "100470",
                "cname": "其他",
                "pid": "1663"
              }
            ]
          },
          {
            "id": "1521",
            "cname": "郑州",
            "pid": "1520",
            "childrens": [
              {
                "id": "1533",
                "cname": "登封市",
                "pid": "1521"
              },
              {
                "id": "1523",
                "cname": "二七区",
                "pid": "1521"
              },
              {
                "id": "1524",
                "cname": "管城回族区",
                "pid": "1521"
              },
              {
                "id": "1529",
                "cname": "巩义市",
                "pid": "1521"
              },
              {
                "id": "1527",
                "cname": "惠济区",
                "pid": "1521"
              },
              {
                "id": "1525",
                "cname": "金水区",
                "pid": "1521"
              },
              {
                "id": "1526",
                "cname": "上街区",
                "pid": "1521"
              },
              {
                "id": "1530",
                "cname": "荥阳市",
                "pid": "1521"
              },
              {
                "id": "1531",
                "cname": "新密市",
                "pid": "1521"
              },
              {
                "id": "1532",
                "cname": "新郑市",
                "pid": "1521"
              },
              {
                "id": "1522",
                "cname": "中原区",
                "pid": "1521"
              },
              {
                "id": "1528",
                "cname": "中牟县",
                "pid": "1521"
              },
              {
                "id": "100396",
                "cname": "其他",
                "pid": "1521"
              }
            ]
          },
          {
            "id": "1674",
            "cname": "周口",
            "pid": "1520",
            "childrens": [
              {
                "id": "1675",
                "cname": "川汇区",
                "pid": "1674"
              },
              {
                "id": "1680",
                "cname": "郸城县",
                "pid": "1674"
              },
              {
                "id": "1676",
                "cname": "扶沟县",
                "pid": "1674"
              },
              {
                "id": "1681",
                "cname": "淮阳县",
                "pid": "1674"
              },
              {
                "id": "1683",
                "cname": "鹿邑县",
                "pid": "1674"
              },
              {
                "id": "1678",
                "cname": "商水县",
                "pid": "1674"
              },
              {
                "id": "1679",
                "cname": "沈丘县",
                "pid": "1674"
              },
              {
                "id": "1682",
                "cname": "太康县",
                "pid": "1674"
              },
              {
                "id": "1677",
                "cname": "西华县",
                "pid": "1674"
              },
              {
                "id": "1684",
                "cname": "项城市",
                "pid": "1674"
              },
              {
                "id": "100326",
                "cname": "其他",
                "pid": "1674"
              }
            ]
          },
          {
            "id": "1685",
            "cname": "驻马店",
            "pid": "1520",
            "childrens": [
              {
                "id": "1692",
                "cname": "泌阳县",
                "pid": "1685"
              },
              {
                "id": "1689",
                "cname": "平舆县",
                "pid": "1685"
              },
              {
                "id": "1691",
                "cname": "确山县",
                "pid": "1685"
              },
              {
                "id": "1693",
                "cname": "汝南县",
                "pid": "1685"
              },
              {
                "id": "1688",
                "cname": "上蔡县",
                "pid": "1685"
              },
              {
                "id": "1694",
                "cname": "遂平县",
                "pid": "1685"
              },
              {
                "id": "1687",
                "cname": "西平县",
                "pid": "1685"
              },
              {
                "id": "1695",
                "cname": "新蔡县",
                "pid": "1685"
              },
              {
                "id": "1686",
                "cname": "驿城区",
                "pid": "1685"
              },
              {
                "id": "1690",
                "cname": "正阳县",
                "pid": "1685"
              },
              {
                "id": "100555",
                "cname": "其他",
                "pid": "1685"
              }
            ]
          },
          {
            "id": "100529",
            "cname": "其他",
            "pid": "1520"
          }
        ]
      },
      {
        "id": "1697",
        "cname": "湖北",
        "pid": "1",
        "childrens": [
          {
            "id": "1801",
            "cname": "恩施",
            "pid": "1697",
            "childrens": [
              {
                "id": "1805",
                "cname": "巴东县",
                "pid": "1801"
              },
              {
                "id": "1802",
                "cname": "恩施市",
                "pid": "1801"
              },
              {
                "id": "1809",
                "cname": "鹤峰县",
                "pid": "1801"
              },
              {
                "id": "1804",
                "cname": "建始县",
                "pid": "1801"
              },
              {
                "id": "1803",
                "cname": "利川市",
                "pid": "1801"
              },
              {
                "id": "1808",
                "cname": "来凤县",
                "pid": "1801"
              },
              {
                "id": "1806",
                "cname": "宣恩县",
                "pid": "1801"
              },
              {
                "id": "1807",
                "cname": "咸丰县",
                "pid": "1801"
              },
              {
                "id": "100184",
                "cname": "其他",
                "pid": "1801"
              }
            ]
          },
          {
            "id": "1752",
            "cname": "鄂州",
            "pid": "1697",
            "childrens": [
              {
                "id": "1755",
                "cname": "鄂城区",
                "pid": "1752"
              },
              {
                "id": "1754",
                "cname": "华容区",
                "pid": "1752"
              },
              {
                "id": "1753",
                "cname": "梁子湖区",
                "pid": "1752"
              },
              {
                "id": "100443",
                "cname": "其他",
                "pid": "1752"
              }
            ]
          },
          {
            "id": "1712",
            "cname": "黄石",
            "pid": "1697",
            "childrens": [
              {
                "id": "1718",
                "cname": "大冶市",
                "pid": "1712"
              },
              {
                "id": "1713",
                "cname": "黄石港区",
                "pid": "1712"
              },
              {
                "id": "1716",
                "cname": "铁山区",
                "pid": "1712"
              },
              {
                "id": "1714",
                "cname": "西塞山区",
                "pid": "1712"
              },
              {
                "id": "1715",
                "cname": "下陆区",
                "pid": "1712"
              },
              {
                "id": "1717",
                "cname": "阳新县",
                "pid": "1712"
              },
              {
                "id": "100398",
                "cname": "其他",
                "pid": "1712"
              }
            ]
          },
          {
            "id": "1779",
            "cname": "黄冈",
            "pid": "1697",
            "childrens": [
              {
                "id": "1780",
                "cname": "黄州区",
                "pid": "1779"
              },
              {
                "id": "1782",
                "cname": "红安县",
                "pid": "1779"
              },
              {
                "id": "1787",
                "cname": "黄梅县",
                "pid": "1779"
              },
              {
                "id": "1783",
                "cname": "罗田县",
                "pid": "1779"
              },
              {
                "id": "1788",
                "cname": "麻城市",
                "pid": "1779"
              },
              {
                "id": "1786",
                "cname": "蕲春县",
                "pid": "1779"
              },
              {
                "id": "1781",
                "cname": "团风县",
                "pid": "1779"
              },
              {
                "id": "1789",
                "cname": "武穴市",
                "pid": "1779"
              },
              {
                "id": "1785",
                "cname": "浠水县",
                "pid": "1779"
              },
              {
                "id": "1784",
                "cname": "英山县",
                "pid": "1779"
              },
              {
                "id": "100509",
                "cname": "其他",
                "pid": "1779"
              }
            ]
          },
          {
            "id": "1756",
            "cname": "荆门",
            "pid": "1697",
            "childrens": [
              {
                "id": "1757",
                "cname": "东宝区",
                "pid": "1756"
              },
              {
                "id": "1758",
                "cname": "掇刀区",
                "pid": "1756"
              },
              {
                "id": "1759",
                "cname": "京山县",
                "pid": "1756"
              },
              {
                "id": "1760",
                "cname": "沙洋县",
                "pid": "1756"
              },
              {
                "id": "1761",
                "cname": "钟祥市",
                "pid": "1756"
              },
              {
                "id": "100400",
                "cname": "其他",
                "pid": "1756"
              }
            ]
          },
          {
            "id": "1770",
            "cname": "荆州",
            "pid": "1697",
            "childrens": [
              {
                "id": "1773",
                "cname": "公安县",
                "pid": "1770"
              },
              {
                "id": "1777",
                "cname": "洪湖市",
                "pid": "1770"
              },
              {
                "id": "1772",
                "cname": "荆州区",
                "pid": "1770"
              },
              {
                "id": "1774",
                "cname": "监利县",
                "pid": "1770"
              },
              {
                "id": "1775",
                "cname": "江陵县",
                "pid": "1770"
              },
              {
                "id": "1771",
                "cname": "沙市区",
                "pid": "1770"
              },
              {
                "id": "1776",
                "cname": "石首市",
                "pid": "1770"
              },
              {
                "id": "1778",
                "cname": "松滋市",
                "pid": "1770"
              },
              {
                "id": "100471",
                "cname": "其他",
                "pid": "1770"
              }
            ]
          },
          {
            "id": "1811",
            "cname": "潜江",
            "pid": "1697"
          },
          {
            "id": "1719",
            "cname": "十堰",
            "pid": "1697",
            "childrens": [
              {
                "id": "1727",
                "cname": "丹江口市",
                "pid": "1719"
              },
              {
                "id": "1726",
                "cname": "房县",
                "pid": "1719"
              },
              {
                "id": "1720",
                "cname": "茅箭区",
                "pid": "1719"
              },
              {
                "id": "1722",
                "cname": "郧县",
                "pid": "1719"
              },
              {
                "id": "1723",
                "cname": "郧西县",
                "pid": "1719"
              },
              {
                "id": "1721",
                "cname": "张湾区",
                "pid": "1719"
              },
              {
                "id": "1724",
                "cname": "竹山县",
                "pid": "1719"
              },
              {
                "id": "1725",
                "cname": "竹溪县",
                "pid": "1719"
              },
              {
                "id": "100399",
                "cname": "其他",
                "pid": "1719"
              }
            ]
          },
          {
            "id": "1797",
            "cname": "随州",
            "pid": "1697",
            "childrens": [
              {
                "id": "1800",
                "cname": "广水市",
                "pid": "1797"
              },
              {
                "id": "1799",
                "cname": "随县",
                "pid": "1797"
              },
              {
                "id": "1798",
                "cname": "曾都区",
                "pid": "1797"
              },
              {
                "id": "100472",
                "cname": "其他",
                "pid": "1797"
              }
            ]
          },
          {
            "id": "1813",
            "cname": "神农架",
            "pid": "1697"
          },
          {
            "id": "1812",
            "cname": "天门",
            "pid": "1697"
          },
          {
            "id": "1698",
            "cname": "武汉",
            "pid": "1697",
            "childrens": [
              {
                "id": "1708",
                "cname": "蔡甸区",
                "pid": "1698"
              },
              {
                "id": "1706",
                "cname": "东西湖区",
                "pid": "1698"
              },
              {
                "id": "1702",
                "cname": "汉阳区",
                "pid": "1698"
              },
              {
                "id": "1705",
                "cname": "洪山区",
                "pid": "1698"
              },
              {
                "id": "1707",
                "cname": "汉南区",
                "pid": "1698"
              },
              {
                "id": "1710",
                "cname": "黄陂区",
                "pid": "1698"
              },
              {
                "id": "1699",
                "cname": "江岸区",
                "pid": "1698"
              },
              {
                "id": "1700",
                "cname": "江汉区",
                "pid": "1698"
              },
              {
                "id": "1709",
                "cname": "江夏区",
                "pid": "1698"
              },
              {
                "id": "1701",
                "cname": "硚口区",
                "pid": "1698"
              },
              {
                "id": "1704",
                "cname": "青山区",
                "pid": "1698"
              },
              {
                "id": "1703",
                "cname": "武昌区",
                "pid": "1698"
              },
              {
                "id": "1711",
                "cname": "新洲区",
                "pid": "1698"
              },
              {
                "id": "100327",
                "cname": "其他",
                "pid": "1698"
              }
            ]
          },
          {
            "id": "1742",
            "cname": "襄阳",
            "pid": "1697",
            "childrens": [
              {
                "id": "1748",
                "cname": "保康县",
                "pid": "1742"
              },
              {
                "id": "1744",
                "cname": "樊城区",
                "pid": "1742"
              },
              {
                "id": "1747",
                "cname": "谷城县",
                "pid": "1742"
              },
              {
                "id": "1749",
                "cname": "老河口市",
                "pid": "1742"
              },
              {
                "id": "1746",
                "cname": "南漳县",
                "pid": "1742"
              },
              {
                "id": "1743",
                "cname": "襄城区",
                "pid": "1742"
              },
              {
                "id": "1745",
                "cname": "襄州区",
                "pid": "1742"
              },
              {
                "id": "1751",
                "cname": "宜城市",
                "pid": "1742"
              },
              {
                "id": "1750",
                "cname": "枣阳市",
                "pid": "1742"
              },
              {
                "id": "100183",
                "cname": "其他",
                "pid": "1742"
              }
            ]
          },
          {
            "id": "1762",
            "cname": "孝感",
            "pid": "1697",
            "childrens": [
              {
                "id": "1768",
                "cname": "安陆市",
                "pid": "1762"
              },
              {
                "id": "1765",
                "cname": "大悟县",
                "pid": "1762"
              },
              {
                "id": "1769",
                "cname": "汉川市",
                "pid": "1762"
              },
              {
                "id": "1763",
                "cname": "孝南区",
                "pid": "1762"
              },
              {
                "id": "1764",
                "cname": "孝昌县",
                "pid": "1762"
              },
              {
                "id": "1766",
                "cname": "云梦县",
                "pid": "1762"
              },
              {
                "id": "1767",
                "cname": "应城市",
                "pid": "1762"
              },
              {
                "id": "100021",
                "cname": "其他",
                "pid": "1762"
              }
            ]
          },
          {
            "id": "1790",
            "cname": "咸宁",
            "pid": "1697",
            "childrens": [
              {
                "id": "1794",
                "cname": "崇阳县",
                "pid": "1790"
              },
              {
                "id": "1796",
                "cname": "赤壁市",
                "pid": "1790"
              },
              {
                "id": "1792",
                "cname": "嘉鱼县",
                "pid": "1790"
              },
              {
                "id": "1793",
                "cname": "通城县",
                "pid": "1790"
              },
              {
                "id": "1795",
                "cname": "通山县",
                "pid": "1790"
              },
              {
                "id": "1791",
                "cname": "咸安区",
                "pid": "1790"
              },
              {
                "id": "100329",
                "cname": "其他",
                "pid": "1790"
              }
            ]
          },
          {
            "id": "1810",
            "cname": "仙桃",
            "pid": "1697"
          },
          {
            "id": "1728",
            "cname": "宜昌",
            "pid": "1697",
            "childrens": [
              {
                "id": "1737",
                "cname": "长阳土家族自治县",
                "pid": "1728"
              },
              {
                "id": "1731",
                "cname": "点军区",
                "pid": "1728"
              },
              {
                "id": "1740",
                "cname": "当阳市",
                "pid": "1728"
              },
              {
                "id": "1730",
                "cname": "伍家岗区",
                "pid": "1728"
              },
              {
                "id": "1738",
                "cname": "五峰土家族自治县",
                "pid": "1728"
              },
              {
                "id": "1729",
                "cname": "西陵区",
                "pid": "1728"
              },
              {
                "id": "1732",
                "cname": "猇亭区",
                "pid": "1728"
              },
              {
                "id": "1735",
                "cname": "兴山县",
                "pid": "1728"
              },
              {
                "id": "1733",
                "cname": "夷陵区",
                "pid": "1728"
              },
              {
                "id": "1734",
                "cname": "远安县",
                "pid": "1728"
              },
              {
                "id": "1739",
                "cname": "宜都市",
                "pid": "1728"
              },
              {
                "id": "1736",
                "cname": "秭归县",
                "pid": "1728"
              },
              {
                "id": "1741",
                "cname": "枝江市",
                "pid": "1728"
              },
              {
                "id": "100328",
                "cname": "其他",
                "pid": "1728"
              }
            ]
          },
          {
            "id": "100561",
            "cname": "其他",
            "pid": "1697"
          }
        ]
      },
      {
        "id": "1814",
        "cname": "湖南",
        "pid": "1",
        "childrens": [
          {
            "id": "1815",
            "cname": "长沙",
            "pid": "1814",
            "childrens": [
              {
                "id": "1821",
                "cname": "长沙县",
                "pid": "1815"
              },
              {
                "id": "1816",
                "cname": "芙蓉区",
                "pid": "1815"
              },
              {
                "id": "1819",
                "cname": "开福区",
                "pid": "1815"
              },
              {
                "id": "1824",
                "cname": "浏阳市",
                "pid": "1815"
              },
              {
                "id": "1823",
                "cname": "宁乡县",
                "pid": "1815"
              },
              {
                "id": "1817",
                "cname": "天心区",
                "pid": "1815"
              },
              {
                "id": "1822",
                "cname": "望城区",
                "pid": "1815"
              },
              {
                "id": "1818",
                "cname": "岳麓区",
                "pid": "1815"
              },
              {
                "id": "1820",
                "cname": "雨花区",
                "pid": "1815"
              },
              {
                "id": "100330",
                "cname": "其他",
                "pid": "1815"
              }
            ]
          },
          {
            "id": "1877",
            "cname": "常德",
            "pid": "1814",
            "childrens": [
              {
                "id": "1880",
                "cname": "安乡县",
                "pid": "1877"
              },
              {
                "id": "1879",
                "cname": "鼎城区",
                "pid": "1877"
              },
              {
                "id": "1881",
                "cname": "汉寿县",
                "pid": "1877"
              },
              {
                "id": "1886",
                "cname": "津市市",
                "pid": "1877"
              },
              {
                "id": "1882",
                "cname": "澧县",
                "pid": "1877"
              },
              {
                "id": "1883",
                "cname": "临澧县",
                "pid": "1877"
              },
              {
                "id": "1885",
                "cname": "石门县",
                "pid": "1877"
              },
              {
                "id": "1884",
                "cname": "桃源县",
                "pid": "1877"
              },
              {
                "id": "1878",
                "cname": "武陵区",
                "pid": "1877"
              },
              {
                "id": "100022",
                "cname": "其他",
                "pid": "1877"
              }
            ]
          },
          {
            "id": "1899",
            "cname": "郴州",
            "pid": "1814",
            "childrens": [
              {
                "id": "1909",
                "cname": "安仁县",
                "pid": "1899"
              },
              {
                "id": "1900",
                "cname": "北湖区",
                "pid": "1899"
              },
              {
                "id": "1902",
                "cname": "桂阳县",
                "pid": "1899"
              },
              {
                "id": "1908",
                "cname": "桂东县",
                "pid": "1899"
              },
              {
                "id": "1905",
                "cname": "嘉禾县",
                "pid": "1899"
              },
              {
                "id": "1906",
                "cname": "临武县",
                "pid": "1899"
              },
              {
                "id": "1907",
                "cname": "汝城县",
                "pid": "1899"
              },
              {
                "id": "1901",
                "cname": "苏仙区",
                "pid": "1899"
              },
              {
                "id": "1903",
                "cname": "宜章县",
                "pid": "1899"
              },
              {
                "id": "1904",
                "cname": "永兴县",
                "pid": "1899"
              },
              {
                "id": "1910",
                "cname": "资兴市",
                "pid": "1899"
              },
              {
                "id": "100024",
                "cname": "其他",
                "pid": "1899"
              }
            ]
          },
          {
            "id": "1841",
            "cname": "衡阳",
            "pid": "1814",
            "childrens": [
              {
                "id": "1853",
                "cname": "常宁市",
                "pid": "1841"
              },
              {
                "id": "1847",
                "cname": "衡阳县",
                "pid": "1841"
              },
              {
                "id": "1848",
                "cname": "衡南县",
                "pid": "1841"
              },
              {
                "id": "1849",
                "cname": "衡山县",
                "pid": "1841"
              },
              {
                "id": "1850",
                "cname": "衡东县",
                "pid": "1841"
              },
              {
                "id": "1852",
                "cname": "耒阳市",
                "pid": "1841"
              },
              {
                "id": "1846",
                "cname": "南岳区",
                "pid": "1841"
              },
              {
                "id": "1851",
                "cname": "祁东县",
                "pid": "1841"
              },
              {
                "id": "1844",
                "cname": "石鼓区",
                "pid": "1841"
              },
              {
                "id": "1843",
                "cname": "雁峰区",
                "pid": "1841"
              },
              {
                "id": "1842",
                "cname": "珠晖区",
                "pid": "1841"
              },
              {
                "id": "1845",
                "cname": "蒸湘区",
                "pid": "1841"
              },
              {
                "id": "100332",
                "cname": "其他",
                "pid": "1841"
              }
            ]
          },
          {
            "id": "1923",
            "cname": "怀化",
            "pid": "1814",
            "childrens": [
              {
                "id": "1927",
                "cname": "辰溪县",
                "pid": "1923"
              },
              {
                "id": "1924",
                "cname": "鹤城区",
                "pid": "1923"
              },
              {
                "id": "1929",
                "cname": "会同县",
                "pid": "1923"
              },
              {
                "id": "1935",
                "cname": "洪江市",
                "pid": "1923"
              },
              {
                "id": "1933",
                "cname": "靖州苗族侗族自治县",
                "pid": "1923"
              },
              {
                "id": "1930",
                "cname": "麻阳苗族自治县",
                "pid": "1923"
              },
              {
                "id": "1934",
                "cname": "通道侗族自治县",
                "pid": "1923"
              },
              {
                "id": "1928",
                "cname": "溆浦县",
                "pid": "1923"
              },
              {
                "id": "1931",
                "cname": "新晃侗族自治县",
                "pid": "1923"
              },
              {
                "id": "1926",
                "cname": "沅陵县",
                "pid": "1923"
              },
              {
                "id": "1925",
                "cname": "中方县",
                "pid": "1923"
              },
              {
                "id": "1932",
                "cname": "芷江侗族自治县",
                "pid": "1923"
              },
              {
                "id": "100334",
                "cname": "其他",
                "pid": "1923"
              }
            ]
          },
          {
            "id": "1936",
            "cname": "娄底",
            "pid": "1814",
            "childrens": [
              {
                "id": "1937",
                "cname": "娄星区",
                "pid": "1936"
              },
              {
                "id": "1940",
                "cname": "冷水江市",
                "pid": "1936"
              },
              {
                "id": "1941",
                "cname": "涟源市",
                "pid": "1936"
              },
              {
                "id": "1938",
                "cname": "双峰县",
                "pid": "1936"
              },
              {
                "id": "1939",
                "cname": "新化县",
                "pid": "1936"
              },
              {
                "id": "100546",
                "cname": "其他",
                "pid": "1936"
              }
            ]
          },
          {
            "id": "1854",
            "cname": "邵阳",
            "pid": "1814",
            "childrens": [
              {
                "id": "1857",
                "cname": "北塔区",
                "pid": "1854"
              },
              {
                "id": "1865",
                "cname": "城步苗族自治县",
                "pid": "1854"
              },
              {
                "id": "1856",
                "cname": "大祥区",
                "pid": "1854"
              },
              {
                "id": "1862",
                "cname": "洞口县",
                "pid": "1854"
              },
              {
                "id": "1861",
                "cname": "隆回县",
                "pid": "1854"
              },
              {
                "id": "1855",
                "cname": "双清区",
                "pid": "1854"
              },
              {
                "id": "1858",
                "cname": "邵东县",
                "pid": "1854"
              },
              {
                "id": "1860",
                "cname": "邵阳县",
                "pid": "1854"
              },
              {
                "id": "1863",
                "cname": "绥宁县",
                "pid": "1854"
              },
              {
                "id": "1866",
                "cname": "武冈市",
                "pid": "1854"
              },
              {
                "id": "1859",
                "cname": "新邵县",
                "pid": "1854"
              },
              {
                "id": "1864",
                "cname": "新宁县",
                "pid": "1854"
              },
              {
                "id": "100185",
                "cname": "其他",
                "pid": "1854"
              }
            ]
          },
          {
            "id": "1835",
            "cname": "湘潭",
            "pid": "1814",
            "childrens": [
              {
                "id": "1840",
                "cname": "韶山市",
                "pid": "1835"
              },
              {
                "id": "1838",
                "cname": "湘潭县",
                "pid": "1835"
              },
              {
                "id": "1839",
                "cname": "湘乡市",
                "pid": "1835"
              },
              {
                "id": "1836",
                "cname": "雨湖区",
                "pid": "1835"
              },
              {
                "id": "1837",
                "cname": "岳塘区",
                "pid": "1835"
              },
              {
                "id": "100565",
                "cname": "其他",
                "pid": "1835"
              }
            ]
          },
          {
            "id": "1942",
            "cname": "湘西",
            "pid": "1814",
            "childrens": [
              {
                "id": "1947",
                "cname": "保靖县",
                "pid": "1942"
              },
              {
                "id": "1945",
                "cname": "凤凰县",
                "pid": "1942"
              },
              {
                "id": "1948",
                "cname": "古丈县",
                "pid": "1942"
              },
              {
                "id": "1946",
                "cname": "花垣县",
                "pid": "1942"
              },
              {
                "id": "1943",
                "cname": "吉首市",
                "pid": "1942"
              },
              {
                "id": "1944",
                "cname": "泸溪县",
                "pid": "1942"
              },
              {
                "id": "1950",
                "cname": "龙山县",
                "pid": "1942"
              },
              {
                "id": "1949",
                "cname": "永顺县",
                "pid": "1942"
              },
              {
                "id": "100186",
                "cname": "其他",
                "pid": "1942"
              }
            ]
          },
          {
            "id": "1867",
            "cname": "岳阳",
            "pid": "1814",
            "childrens": [
              {
                "id": "1872",
                "cname": "华容县",
                "pid": "1867"
              },
              {
                "id": "1870",
                "cname": "君山区",
                "pid": "1867"
              },
              {
                "id": "1876",
                "cname": "临湘市",
                "pid": "1867"
              },
              {
                "id": "1875",
                "cname": "汨罗市",
                "pid": "1867"
              },
              {
                "id": "1874",
                "cname": "平江县",
                "pid": "1867"
              },
              {
                "id": "1873",
                "cname": "湘阴县",
                "pid": "1867"
              },
              {
                "id": "1868",
                "cname": "岳阳楼区",
                "pid": "1867"
              },
              {
                "id": "1869",
                "cname": "云溪区",
                "pid": "1867"
              },
              {
                "id": "1871",
                "cname": "岳阳县",
                "pid": "1867"
              },
              {
                "id": "100510",
                "cname": "其他",
                "pid": "1867"
              }
            ]
          },
          {
            "id": "1892",
            "cname": "益阳",
            "pid": "1814",
            "childrens": [
              {
                "id": "1897",
                "cname": "安化县",
                "pid": "1892"
              },
              {
                "id": "1894",
                "cname": "赫山区",
                "pid": "1892"
              },
              {
                "id": "1895",
                "cname": "南县",
                "pid": "1892"
              },
              {
                "id": "1896",
                "cname": "桃江县",
                "pid": "1892"
              },
              {
                "id": "1898",
                "cname": "沅江市",
                "pid": "1892"
              },
              {
                "id": "1893",
                "cname": "资阳区",
                "pid": "1892"
              },
              {
                "id": "100023",
                "cname": "其他",
                "pid": "1892"
              }
            ]
          },
          {
            "id": "1911",
            "cname": "永州",
            "pid": "1814",
            "childrens": [
              {
                "id": "1915",
                "cname": "东安县",
                "pid": "1911"
              },
              {
                "id": "1917",
                "cname": "道县",
                "pid": "1911"
              },
              {
                "id": "1918",
                "cname": "江永县",
                "pid": "1911"
              },
              {
                "id": "1922",
                "cname": "江华瑶族自治县",
                "pid": "1911"
              },
              {
                "id": "1912",
                "cname": "零陵区",
                "pid": "1911"
              },
              {
                "id": "1913",
                "cname": "冷水滩区",
                "pid": "1911"
              },
              {
                "id": "1920",
                "cname": "蓝山县",
                "pid": "1911"
              },
              {
                "id": "1919",
                "cname": "宁远县",
                "pid": "1911"
              },
              {
                "id": "1914",
                "cname": "祁阳县",
                "pid": "1911"
              },
              {
                "id": "1916",
                "cname": "双牌县",
                "pid": "1911"
              },
              {
                "id": "1921",
                "cname": "新田县",
                "pid": "1911"
              },
              {
                "id": "100401",
                "cname": "其他",
                "pid": "1911"
              }
            ]
          },
          {
            "id": "1825",
            "cname": "株洲",
            "pid": "1814",
            "childrens": [
              {
                "id": "1832",
                "cname": "茶陵县",
                "pid": "1825"
              },
              {
                "id": "1826",
                "cname": "荷塘区",
                "pid": "1825"
              },
              {
                "id": "1827",
                "cname": "芦淞区",
                "pid": "1825"
              },
              {
                "id": "1834",
                "cname": "醴陵市",
                "pid": "1825"
              },
              {
                "id": "1828",
                "cname": "石峰区",
                "pid": "1825"
              },
              {
                "id": "1829",
                "cname": "天元区",
                "pid": "1825"
              },
              {
                "id": "1831",
                "cname": "攸县",
                "pid": "1825"
              },
              {
                "id": "1833",
                "cname": "炎陵县",
                "pid": "1825"
              },
              {
                "id": "1830",
                "cname": "株洲县",
                "pid": "1825"
              },
              {
                "id": "100331",
                "cname": "其他",
                "pid": "1825"
              }
            ]
          },
          {
            "id": "1887",
            "cname": "张家界",
            "pid": "1814",
            "childrens": [
              {
                "id": "1890",
                "cname": "慈利县",
                "pid": "1887"
              },
              {
                "id": "1891",
                "cname": "桑植县",
                "pid": "1887"
              },
              {
                "id": "1889",
                "cname": "武陵源区",
                "pid": "1887"
              },
              {
                "id": "1888",
                "cname": "永定区",
                "pid": "1887"
              },
              {
                "id": "100333",
                "cname": "其他",
                "pid": "1887"
              }
            ]
          }
        ]
      },
      {
        "id": "2220",
        "cname": "海南",
        "pid": "1",
        "childrens": [
          {
            "id": "2238",
            "cname": "白沙",
            "pid": "2220"
          },
          {
            "id": "2242",
            "cname": "保亭",
            "pid": "2220"
          },
          {
            "id": "2236",
            "cname": "澄迈",
            "pid": "2220"
          },
          {
            "id": "2239",
            "cname": "昌江",
            "pid": "2220"
          },
          {
            "id": "2230",
            "cname": "儋州",
            "pid": "2220"
          },
          {
            "id": "2233",
            "cname": "东方",
            "pid": "2220"
          },
          {
            "id": "2234",
            "cname": "定安",
            "pid": "2220"
          },
          {
            "id": "2221",
            "cname": "海口",
            "pid": "2220",
            "childrens": [
              {
                "id": "2223",
                "cname": "龙华区",
                "pid": "2221"
              },
              {
                "id": "2225",
                "cname": "美兰区",
                "pid": "2221"
              },
              {
                "id": "2224",
                "cname": "琼山区",
                "pid": "2221"
              },
              {
                "id": "2222",
                "cname": "秀英区",
                "pid": "2221"
              },
              {
                "id": "100550",
                "cname": "其他",
                "pid": "2221"
              }
            ]
          },
          {
            "id": "2237",
            "cname": "临高",
            "pid": "2220"
          },
          {
            "id": "2240",
            "cname": "乐东",
            "pid": "2220"
          },
          {
            "id": "2241",
            "cname": "陵水",
            "pid": "2220"
          },
          {
            "id": "2229",
            "cname": "琼海",
            "pid": "2220"
          },
          {
            "id": "2243",
            "cname": "琼中",
            "pid": "2220"
          },
          {
            "id": "2226",
            "cname": "三亚",
            "pid": "2220"
          },
          {
            "id": "2227",
            "cname": "三沙",
            "pid": "2220"
          },
          {
            "id": "2235",
            "cname": "屯昌",
            "pid": "2220"
          },
          {
            "id": "2228",
            "cname": "五指山",
            "pid": "2220"
          },
          {
            "id": "2231",
            "cname": "文昌",
            "pid": "2220"
          },
          {
            "id": "2232",
            "cname": "万宁",
            "pid": "2220"
          },
          {
            "id": "100194",
            "cname": "其他",
            "pid": "2220"
          }
        ]
      },
      {
        "id": "582",
        "cname": "吉林",
        "pid": "1",
        "childrens": [
          {
            "id": "624",
            "cname": "白山",
            "pid": "582",
            "childrens": [
              {
                "id": "625",
                "cname": "八道江区",
                "pid": "624"
              },
              {
                "id": "629",
                "cname": "长白朝鲜族自治县",
                "pid": "624"
              },
              {
                "id": "627",
                "cname": "抚松县",
                "pid": "624"
              },
              {
                "id": "626",
                "cname": "江源区",
                "pid": "624"
              },
              {
                "id": "628",
                "cname": "靖宇县",
                "pid": "624"
              },
              {
                "id": "630",
                "cname": "临江市",
                "pid": "624"
              },
              {
                "id": "100165",
                "cname": "其他",
                "pid": "624"
              }
            ]
          },
          {
            "id": "637",
            "cname": "白城",
            "pid": "582",
            "childrens": [
              {
                "id": "642",
                "cname": "大安市",
                "pid": "637"
              },
              {
                "id": "638",
                "cname": "洮北区",
                "pid": "637"
              },
              {
                "id": "640",
                "cname": "通榆县",
                "pid": "637"
              },
              {
                "id": "641",
                "cname": "洮南市",
                "pid": "637"
              },
              {
                "id": "639",
                "cname": "镇赉县",
                "pid": "637"
              },
              {
                "id": "100377",
                "cname": "其他",
                "pid": "637"
              }
            ]
          },
          {
            "id": "583",
            "cname": "长春",
            "pid": "582",
            "childrens": [
              {
                "id": "593",
                "cname": "德惠市",
                "pid": "583"
              },
              {
                "id": "587",
                "cname": "二道区",
                "pid": "583"
              },
              {
                "id": "591",
                "cname": "九台市",
                "pid": "583"
              },
              {
                "id": "585",
                "cname": "宽城区",
                "pid": "583"
              },
              {
                "id": "588",
                "cname": "绿园区",
                "pid": "583"
              },
              {
                "id": "584",
                "cname": "南关区",
                "pid": "583"
              },
              {
                "id": "590",
                "cname": "农安县",
                "pid": "583"
              },
              {
                "id": "589",
                "cname": "双阳区",
                "pid": "583"
              },
              {
                "id": "592",
                "cname": "榆树市",
                "pid": "583"
              },
              {
                "id": "586",
                "cname": "朝阳区",
                "pid": "583"
              },
              {
                "id": "100374",
                "cname": "其他",
                "pid": "583"
              }
            ]
          },
          {
            "id": "594",
            "cname": "吉林",
            "pid": "582",
            "childrens": [
              {
                "id": "595",
                "cname": "昌邑区",
                "pid": "594"
              },
              {
                "id": "597",
                "cname": "船营区",
                "pid": "594"
              },
              {
                "id": "598",
                "cname": "丰满区",
                "pid": "594"
              },
              {
                "id": "601",
                "cname": "桦甸市",
                "pid": "594"
              },
              {
                "id": "600",
                "cname": "蛟河市",
                "pid": "594"
              },
              {
                "id": "596",
                "cname": "龙潭区",
                "pid": "594"
              },
              {
                "id": "603",
                "cname": "磐石市",
                "pid": "594"
              },
              {
                "id": "602",
                "cname": "舒兰市",
                "pid": "594"
              },
              {
                "id": "599",
                "cname": "永吉县",
                "pid": "594"
              },
              {
                "id": "100302",
                "cname": "其他",
                "pid": "594"
              }
            ]
          },
          {
            "id": "611",
            "cname": "辽源",
            "pid": "582",
            "childrens": [
              {
                "id": "614",
                "cname": "东丰县",
                "pid": "611"
              },
              {
                "id": "615",
                "cname": "东辽县",
                "pid": "611"
              },
              {
                "id": "612",
                "cname": "龙山区",
                "pid": "611"
              },
              {
                "id": "613",
                "cname": "西安区",
                "pid": "611"
              },
              {
                "id": "100375",
                "cname": "其他",
                "pid": "611"
              }
            ]
          },
          {
            "id": "604",
            "cname": "四平",
            "pid": "582",
            "childrens": [
              {
                "id": "609",
                "cname": "公主岭市",
                "pid": "604"
              },
              {
                "id": "607",
                "cname": "梨树县",
                "pid": "604"
              },
              {
                "id": "610",
                "cname": "双辽市",
                "pid": "604"
              },
              {
                "id": "605",
                "cname": "铁西区",
                "pid": "604"
              },
              {
                "id": "606",
                "cname": "铁东区",
                "pid": "604"
              },
              {
                "id": "608",
                "cname": "伊通满族自治县",
                "pid": "604"
              },
              {
                "id": "100463",
                "cname": "其他",
                "pid": "604"
              }
            ]
          },
          {
            "id": "631",
            "cname": "松原",
            "pid": "582",
            "childrens": [
              {
                "id": "634",
                "cname": "长岭县",
                "pid": "631"
              },
              {
                "id": "636",
                "cname": "扶余县",
                "pid": "631"
              },
              {
                "id": "632",
                "cname": "宁江区",
                "pid": "631"
              },
              {
                "id": "633",
                "cname": "前郭尔罗斯蒙古族自治县",
                "pid": "631"
              },
              {
                "id": "635",
                "cname": "乾安县",
                "pid": "631"
              },
              {
                "id": "100303",
                "cname": "其他",
                "pid": "631"
              }
            ]
          },
          {
            "id": "616",
            "cname": "通化",
            "pid": "582",
            "childrens": [
              {
                "id": "617",
                "cname": "东昌区",
                "pid": "616"
              },
              {
                "id": "618",
                "cname": "二道江区",
                "pid": "616"
              },
              {
                "id": "620",
                "cname": "辉南县",
                "pid": "616"
              },
              {
                "id": "623",
                "cname": "集安市",
                "pid": "616"
              },
              {
                "id": "621",
                "cname": "柳河县",
                "pid": "616"
              },
              {
                "id": "622",
                "cname": "梅河口市",
                "pid": "616"
              },
              {
                "id": "619",
                "cname": "通化县",
                "pid": "616"
              },
              {
                "id": "100376",
                "cname": "其他",
                "pid": "616"
              }
            ]
          },
          {
            "id": "643",
            "cname": "延边",
            "pid": "582",
            "childrens": [
              {
                "id": "651",
                "cname": "安图县",
                "pid": "643"
              },
              {
                "id": "646",
                "cname": "敦化市",
                "pid": "643"
              },
              {
                "id": "647",
                "cname": "珲春市",
                "pid": "643"
              },
              {
                "id": "649",
                "cname": "和龙市",
                "pid": "643"
              },
              {
                "id": "648",
                "cname": "龙井市",
                "pid": "643"
              },
              {
                "id": "645",
                "cname": "图们市",
                "pid": "643"
              },
              {
                "id": "650",
                "cname": "汪清县",
                "pid": "643"
              },
              {
                "id": "644",
                "cname": "延吉市",
                "pid": "643"
              },
              {
                "id": "100010",
                "cname": "其他",
                "pid": "643"
              }
            ]
          }
        ]
      },
      {
        "id": "814",
        "cname": "江苏",
        "pid": "1",
        "childrens": [
          {
            "id": "850",
            "cname": "常州",
            "pid": "814",
            "childrens": [
              {
                "id": "857",
                "cname": "金坛市",
                "pid": "850"
              },
              {
                "id": "856",
                "cname": "溧阳市",
                "pid": "850"
              },
              {
                "id": "853",
                "cname": "戚墅堰区",
                "pid": "850"
              },
              {
                "id": "851",
                "cname": "天宁区",
                "pid": "850"
              },
              {
                "id": "855",
                "cname": "武进区",
                "pid": "850"
              },
              {
                "id": "854",
                "cname": "新北区",
                "pid": "850"
              },
              {
                "id": "852",
                "cname": "钟楼区",
                "pid": "850"
              },
              {
                "id": "100525",
                "cname": "其他",
                "pid": "850"
              }
            ]
          },
          {
            "id": "885",
            "cname": "淮安",
            "pid": "814",
            "childrens": [
              {
                "id": "887",
                "cname": "淮安区",
                "pid": "885"
              },
              {
                "id": "888",
                "cname": "淮阴区",
                "pid": "885"
              },
              {
                "id": "891",
                "cname": "洪泽县",
                "pid": "885"
              },
              {
                "id": "893",
                "cname": "金湖县",
                "pid": "885"
              },
              {
                "id": "890",
                "cname": "涟水县",
                "pid": "885"
              },
              {
                "id": "886",
                "cname": "清河区",
                "pid": "885"
              },
              {
                "id": "889",
                "cname": "清浦区",
                "pid": "885"
              },
              {
                "id": "892",
                "cname": "盱眙县",
                "pid": "885"
              },
              {
                "id": "100499",
                "cname": "其他",
                "pid": "885"
              }
            ]
          },
          {
            "id": "877",
            "cname": "连云港",
            "pid": "814",
            "childrens": [
              {
                "id": "882",
                "cname": "东海县",
                "pid": "877"
              },
              {
                "id": "881",
                "cname": "赣榆县",
                "pid": "877"
              },
              {
                "id": "883",
                "cname": "灌云县",
                "pid": "877"
              },
              {
                "id": "884",
                "cname": "灌南县",
                "pid": "877"
              },
              {
                "id": "880",
                "cname": "海州区",
                "pid": "877"
              },
              {
                "id": "878",
                "cname": "连云区",
                "pid": "877"
              },
              {
                "id": "879",
                "cname": "新浦区",
                "pid": "877"
              },
              {
                "id": "100381",
                "cname": "其他",
                "pid": "877"
              }
            ]
          },
          {
            "id": "815",
            "cname": "南京",
            "pid": "814",
            "childrens": [
              {
                "id": "817",
                "cname": "白下区",
                "pid": "815"
              },
              {
                "id": "820",
                "cname": "鼓楼区",
                "pid": "815"
              },
              {
                "id": "828",
                "cname": "高淳县",
                "pid": "815"
              },
              {
                "id": "819",
                "cname": "建邺区",
                "pid": "815"
              },
              {
                "id": "825",
                "cname": "江宁区",
                "pid": "815"
              },
              {
                "id": "826",
                "cname": "六合区",
                "pid": "815"
              },
              {
                "id": "827",
                "cname": "溧水县",
                "pid": "815"
              },
              {
                "id": "822",
                "cname": "浦口区",
                "pid": "815"
              },
              {
                "id": "818",
                "cname": "秦淮区",
                "pid": "815"
              },
              {
                "id": "823",
                "cname": "栖霞区",
                "pid": "815"
              },
              {
                "id": "816",
                "cname": "玄武区",
                "pid": "815"
              },
              {
                "id": "821",
                "cname": "下关区",
                "pid": "815"
              },
              {
                "id": "824",
                "cname": "雨花台区",
                "pid": "815"
              },
              {
                "id": "100169",
                "cname": "其他",
                "pid": "815"
              }
            ]
          },
          {
            "id": "868",
            "cname": "南通",
            "pid": "814",
            "childrens": [
              {
                "id": "869",
                "cname": "崇川区",
                "pid": "868"
              },
              {
                "id": "870",
                "cname": "港闸区",
                "pid": "868"
              },
              {
                "id": "871",
                "cname": "海安县",
                "pid": "868"
              },
              {
                "id": "876",
                "cname": "海门市",
                "pid": "868"
              },
              {
                "id": "873",
                "cname": "启东市",
                "pid": "868"
              },
              {
                "id": "872",
                "cname": "如东县",
                "pid": "868"
              },
              {
                "id": "874",
                "cname": "如皋市",
                "pid": "868"
              },
              {
                "id": "875",
                "cname": "通州市",
                "pid": "868"
              },
              {
                "id": "100307",
                "cname": "其他",
                "pid": "868"
              }
            ]
          },
          {
            "id": "858",
            "cname": "苏州",
            "pid": "814",
            "childrens": [
              {
                "id": "864",
                "cname": "常熟市",
                "pid": "858"
              },
              {
                "id": "859",
                "cname": "姑苏区",
                "pid": "858"
              },
              {
                "id": "860",
                "cname": "虎丘区",
                "pid": "858"
              },
              {
                "id": "866",
                "cname": "昆山市",
                "pid": "858"
              },
              {
                "id": "867",
                "cname": "太仓市",
                "pid": "858"
              },
              {
                "id": "861",
                "cname": "吴中区",
                "pid": "858"
              },
              {
                "id": "863",
                "cname": "吴江区",
                "pid": "858"
              },
              {
                "id": "862",
                "cname": "相城区",
                "pid": "858"
              },
              {
                "id": "865",
                "cname": "张家港市",
                "pid": "858"
              },
              {
                "id": "100306",
                "cname": "其他",
                "pid": "858"
              }
            ]
          },
          {
            "id": "926",
            "cname": "宿迁",
            "pid": "814",
            "childrens": [
              {
                "id": "927",
                "cname": "宿城区",
                "pid": "926"
              },
              {
                "id": "928",
                "cname": "宿豫区",
                "pid": "926"
              },
              {
                "id": "929",
                "cname": "沭阳县",
                "pid": "926"
              },
              {
                "id": "930",
                "cname": "泗阳县",
                "pid": "926"
              },
              {
                "id": "931",
                "cname": "泗洪县",
                "pid": "926"
              },
              {
                "id": "100562",
                "cname": "其他",
                "pid": "926"
              }
            ]
          },
          {
            "id": "919",
            "cname": "泰州",
            "pid": "814",
            "childrens": [
              {
                "id": "921",
                "cname": "高港区",
                "pid": "919"
              },
              {
                "id": "920",
                "cname": "海陵区",
                "pid": "919"
              },
              {
                "id": "923",
                "cname": "靖江市",
                "pid": "919"
              },
              {
                "id": "925",
                "cname": "姜堰市",
                "pid": "919"
              },
              {
                "id": "924",
                "cname": "泰兴市",
                "pid": "919"
              },
              {
                "id": "922",
                "cname": "兴化市",
                "pid": "919"
              },
              {
                "id": "100464",
                "cname": "其他",
                "pid": "919"
              }
            ]
          },
          {
            "id": "829",
            "cname": "无锡",
            "pid": "814",
            "childrens": [
              {
                "id": "832",
                "cname": "北塘区",
                "pid": "829"
              },
              {
                "id": "835",
                "cname": "滨湖区",
                "pid": "829"
              },
              {
                "id": "830",
                "cname": "崇安区",
                "pid": "829"
              },
              {
                "id": "834",
                "cname": "惠山区",
                "pid": "829"
              },
              {
                "id": "836",
                "cname": "江阴市",
                "pid": "829"
              },
              {
                "id": "831",
                "cname": "南长区",
                "pid": "829"
              },
              {
                "id": "833",
                "cname": "锡山区",
                "pid": "829"
              },
              {
                "id": "837",
                "cname": "宜兴市",
                "pid": "829"
              },
              {
                "id": "100170",
                "cname": "其他",
                "pid": "829"
              }
            ]
          },
          {
            "id": "838",
            "cname": "徐州",
            "pid": "814",
            "childrens": [
              {
                "id": "844",
                "cname": "丰县",
                "pid": "838"
              },
              {
                "id": "839",
                "cname": "鼓楼区",
                "pid": "838"
              },
              {
                "id": "847",
                "cname": "睢宁县",
                "pid": "838"
              },
              {
                "id": "841",
                "cname": "九里区",
                "pid": "838"
              },
              {
                "id": "842",
                "cname": "贾汪区",
                "pid": "838"
              },
              {
                "id": "845",
                "cname": "沛县",
                "pid": "838"
              },
              {
                "id": "849",
                "cname": "邳州市",
                "pid": "838"
              },
              {
                "id": "843",
                "cname": "泉山区",
                "pid": "838"
              },
              {
                "id": "846",
                "cname": "铜山县",
                "pid": "838"
              },
              {
                "id": "848",
                "cname": "新沂市",
                "pid": "838"
              },
              {
                "id": "840",
                "cname": "云龙区",
                "pid": "838"
              },
              {
                "id": "100446",
                "cname": "其他",
                "pid": "838"
              }
            ]
          },
          {
            "id": "894",
            "cname": "盐城",
            "pid": "814",
            "childrens": [
              {
                "id": "898",
                "cname": "滨海县",
                "pid": "894"
              },
              {
                "id": "902",
                "cname": "东台市",
                "pid": "894"
              },
              {
                "id": "903",
                "cname": "大丰市",
                "pid": "894"
              },
              {
                "id": "899",
                "cname": "阜宁县",
                "pid": "894"
              },
              {
                "id": "901",
                "cname": "建湖县",
                "pid": "894"
              },
              {
                "id": "900",
                "cname": "射阳县",
                "pid": "894"
              },
              {
                "id": "895",
                "cname": "亭湖区",
                "pid": "894"
              },
              {
                "id": "897",
                "cname": "响水县",
                "pid": "894"
              },
              {
                "id": "896",
                "cname": "盐都区",
                "pid": "894"
              },
              {
                "id": "100171",
                "cname": "其他",
                "pid": "894"
              }
            ]
          },
          {
            "id": "904",
            "cname": "扬州",
            "pid": "814",
            "childrens": [
              {
                "id": "908",
                "cname": "宝应县",
                "pid": "904"
              },
              {
                "id": "905",
                "cname": "广陵区",
                "pid": "904"
              },
              {
                "id": "910",
                "cname": "高邮市",
                "pid": "904"
              },
              {
                "id": "906",
                "cname": "邗江区",
                "pid": "904"
              },
              {
                "id": "911",
                "cname": "江都市",
                "pid": "904"
              },
              {
                "id": "907",
                "cname": "维扬区",
                "pid": "904"
              },
              {
                "id": "909",
                "cname": "仪征市",
                "pid": "904"
              },
              {
                "id": "100172",
                "cname": "其他",
                "pid": "904"
              }
            ]
          },
          {
            "id": "912",
            "cname": "镇江",
            "pid": "814",
            "childrens": [
              {
                "id": "915",
                "cname": "丹徒区",
                "pid": "912"
              },
              {
                "id": "916",
                "cname": "丹阳市",
                "pid": "912"
              },
              {
                "id": "913",
                "cname": "京口区",
                "pid": "912"
              },
              {
                "id": "918",
                "cname": "句容市",
                "pid": "912"
              },
              {
                "id": "914",
                "cname": "润州区",
                "pid": "912"
              },
              {
                "id": "917",
                "cname": "扬中市",
                "pid": "912"
              },
              {
                "id": "100382",
                "cname": "其他",
                "pid": "912"
              }
            ]
          }
        ]
      },
      {
        "id": "1251",
        "cname": "江西",
        "pid": "1",
        "childrens": [
          {
            "id": "1337",
            "cname": "抚州",
            "pid": "1251",
            "childrens": [
              {
                "id": "1342",
                "cname": "崇仁县",
                "pid": "1337"
              },
              {
                "id": "1347",
                "cname": "东乡县",
                "pid": "1337"
              },
              {
                "id": "1348",
                "cname": "广昌县",
                "pid": "1337"
              },
              {
                "id": "1345",
                "cname": "金溪县",
                "pid": "1337"
              },
              {
                "id": "1338",
                "cname": "临川区",
                "pid": "1337"
              },
              {
                "id": "1340",
                "cname": "黎川县",
                "pid": "1337"
              },
              {
                "id": "1343",
                "cname": "乐安县",
                "pid": "1337"
              },
              {
                "id": "1339",
                "cname": "南城县",
                "pid": "1337"
              },
              {
                "id": "1341",
                "cname": "南丰县",
                "pid": "1337"
              },
              {
                "id": "1344",
                "cname": "宜黄县",
                "pid": "1337"
              },
              {
                "id": "1346",
                "cname": "资溪县",
                "pid": "1337"
              },
              {
                "id": "100316",
                "cname": "其他",
                "pid": "1337"
              }
            ]
          },
          {
            "id": "1293",
            "cname": "赣州",
            "pid": "1251",
            "childrens": [
              {
                "id": "1300",
                "cname": "安远县",
                "pid": "1293"
              },
              {
                "id": "1299",
                "cname": "崇义县",
                "pid": "1293"
              },
              {
                "id": "1297",
                "cname": "大余县",
                "pid": "1293"
              },
              {
                "id": "1302",
                "cname": "定南县",
                "pid": "1293"
              },
              {
                "id": "1295",
                "cname": "赣县",
                "pid": "1293"
              },
              {
                "id": "1307",
                "cname": "会昌县",
                "pid": "1293"
              },
              {
                "id": "1301",
                "cname": "龙南县",
                "pid": "1293"
              },
              {
                "id": "1304",
                "cname": "宁都县",
                "pid": "1293"
              },
              {
                "id": "1311",
                "cname": "南康市",
                "pid": "1293"
              },
              {
                "id": "1303",
                "cname": "全南县",
                "pid": "1293"
              },
              {
                "id": "1310",
                "cname": "瑞金市",
                "pid": "1293"
              },
              {
                "id": "1298",
                "cname": "上犹县",
                "pid": "1293"
              },
              {
                "id": "1309",
                "cname": "石城县",
                "pid": "1293"
              },
              {
                "id": "1296",
                "cname": "信丰县",
                "pid": "1293"
              },
              {
                "id": "1306",
                "cname": "兴国县",
                "pid": "1293"
              },
              {
                "id": "1308",
                "cname": "寻乌县",
                "pid": "1293"
              },
              {
                "id": "1305",
                "cname": "于都县",
                "pid": "1293"
              },
              {
                "id": "1294",
                "cname": "章贡区",
                "pid": "1293"
              },
              {
                "id": "100017",
                "cname": "其他",
                "pid": "1293"
              }
            ]
          },
          {
            "id": "1262",
            "cname": "景德镇",
            "pid": "1251",
            "childrens": [
              {
                "id": "1263",
                "cname": "昌江区",
                "pid": "1262"
              },
              {
                "id": "1265",
                "cname": "浮梁县",
                "pid": "1262"
              },
              {
                "id": "1266",
                "cname": "乐平市",
                "pid": "1262"
              },
              {
                "id": "1264",
                "cname": "珠山区",
                "pid": "1262"
              },
              {
                "id": "100315",
                "cname": "其他",
                "pid": "1262"
              }
            ]
          },
          {
            "id": "1273",
            "cname": "九江",
            "pid": "1251",
            "childrens": [
              {
                "id": "1280",
                "cname": "德安县",
                "pid": "1273"
              },
              {
                "id": "1282",
                "cname": "都昌县",
                "pid": "1273"
              },
              {
                "id": "1283",
                "cname": "湖口县",
                "pid": "1273"
              },
              {
                "id": "1276",
                "cname": "九江县",
                "pid": "1273"
              },
              {
                "id": "1274",
                "cname": "庐山区",
                "pid": "1273"
              },
              {
                "id": "1284",
                "cname": "彭泽县",
                "pid": "1273"
              },
              {
                "id": "1285",
                "cname": "瑞昌市",
                "pid": "1273"
              },
              {
                "id": "1277",
                "cname": "武宁县",
                "pid": "1273"
              },
              {
                "id": "1275",
                "cname": "浔阳区",
                "pid": "1273"
              },
              {
                "id": "1278",
                "cname": "修水县",
                "pid": "1273"
              },
              {
                "id": "1281",
                "cname": "星子县",
                "pid": "1273"
              },
              {
                "id": "1279",
                "cname": "永修县",
                "pid": "1273"
              },
              {
                "id": "100390",
                "cname": "其他",
                "pid": "1273"
              }
            ]
          },
          {
            "id": "1312",
            "cname": "吉安",
            "pid": "1251",
            "childrens": [
              {
                "id": "1323",
                "cname": "安福县",
                "pid": "1312"
              },
              {
                "id": "1313",
                "cname": "吉州区",
                "pid": "1312"
              },
              {
                "id": "1315",
                "cname": "吉安县",
                "pid": "1312"
              },
              {
                "id": "1316",
                "cname": "吉水县",
                "pid": "1312"
              },
              {
                "id": "1325",
                "cname": "井冈山市",
                "pid": "1312"
              },
              {
                "id": "1314",
                "cname": "青原区",
                "pid": "1312"
              },
              {
                "id": "1321",
                "cname": "遂川县",
                "pid": "1312"
              },
              {
                "id": "1320",
                "cname": "泰和县",
                "pid": "1312"
              },
              {
                "id": "1322",
                "cname": "万安县",
                "pid": "1312"
              },
              {
                "id": "1317",
                "cname": "峡江县",
                "pid": "1312"
              },
              {
                "id": "1318",
                "cname": "新干县",
                "pid": "1312"
              },
              {
                "id": "1319",
                "cname": "永丰县",
                "pid": "1312"
              },
              {
                "id": "1324",
                "cname": "永新县",
                "pid": "1312"
              },
              {
                "id": "100018",
                "cname": "其他",
                "pid": "1312"
              }
            ]
          },
          {
            "id": "1252",
            "cname": "南昌",
            "pid": "1251",
            "childrens": [
              {
                "id": "1260",
                "cname": "安义县",
                "pid": "1252"
              },
              {
                "id": "1253",
                "cname": "东湖区",
                "pid": "1252"
              },
              {
                "id": "1261",
                "cname": "进贤县",
                "pid": "1252"
              },
              {
                "id": "1258",
                "cname": "南昌县",
                "pid": "1252"
              },
              {
                "id": "1255",
                "cname": "青云谱区",
                "pid": "1252"
              },
              {
                "id": "1257",
                "cname": "青山湖区",
                "pid": "1252"
              },
              {
                "id": "1256",
                "cname": "湾里区",
                "pid": "1252"
              },
              {
                "id": "1254",
                "cname": "西湖区",
                "pid": "1252"
              },
              {
                "id": "1259",
                "cname": "新建县",
                "pid": "1252"
              },
              {
                "id": "100015",
                "cname": "其他",
                "pid": "1252"
              }
            ]
          },
          {
            "id": "1267",
            "cname": "萍乡",
            "pid": "1251",
            "childrens": [
              {
                "id": "1268",
                "cname": "安源区",
                "pid": "1267"
              },
              {
                "id": "1270",
                "cname": "莲花县",
                "pid": "1267"
              },
              {
                "id": "1272",
                "cname": "芦溪县",
                "pid": "1267"
              },
              {
                "id": "1271",
                "cname": "上栗县",
                "pid": "1267"
              },
              {
                "id": "1269",
                "cname": "湘东区",
                "pid": "1267"
              },
              {
                "id": "100016",
                "cname": "其他",
                "pid": "1267"
              }
            ]
          },
          {
            "id": "1349",
            "cname": "上饶",
            "pid": "1251",
            "childrens": [
              {
                "id": "1361",
                "cname": "德兴市",
                "pid": "1349"
              },
              {
                "id": "1352",
                "cname": "广丰县",
                "pid": "1349"
              },
              {
                "id": "1355",
                "cname": "横峰县",
                "pid": "1349"
              },
              {
                "id": "1358",
                "cname": "鄱阳县",
                "pid": "1349"
              },
              {
                "id": "1354",
                "cname": "铅山县",
                "pid": "1349"
              },
              {
                "id": "1351",
                "cname": "上饶县",
                "pid": "1349"
              },
              {
                "id": "1359",
                "cname": "万年县",
                "pid": "1349"
              },
              {
                "id": "1360",
                "cname": "婺源县",
                "pid": "1349"
              },
              {
                "id": "1350",
                "cname": "信州区",
                "pid": "1349"
              },
              {
                "id": "1353",
                "cname": "玉山县",
                "pid": "1349"
              },
              {
                "id": "1356",
                "cname": "弋阳县",
                "pid": "1349"
              },
              {
                "id": "1357",
                "cname": "余干县",
                "pid": "1349"
              },
              {
                "id": "100391",
                "cname": "其他",
                "pid": "1349"
              }
            ]
          },
          {
            "id": "1286",
            "cname": "新余",
            "pid": "1251",
            "childrens": [
              {
                "id": "1288",
                "cname": "分宜县",
                "pid": "1286"
              },
              {
                "id": "1287",
                "cname": "渝水区",
                "pid": "1286"
              },
              {
                "id": "100450",
                "cname": "其他",
                "pid": "1286"
              }
            ]
          },
          {
            "id": "1289",
            "cname": "鹰潭",
            "pid": "1251",
            "childrens": [
              {
                "id": "1292",
                "cname": "贵溪市",
                "pid": "1289"
              },
              {
                "id": "1290",
                "cname": "月湖区",
                "pid": "1289"
              },
              {
                "id": "1291",
                "cname": "余江县",
                "pid": "1289"
              },
              {
                "id": "100467",
                "cname": "其他",
                "pid": "1289"
              }
            ]
          },
          {
            "id": "1326",
            "cname": "宜春",
            "pid": "1251",
            "childrens": [
              {
                "id": "1328",
                "cname": "奉新县",
                "pid": "1326"
              },
              {
                "id": "1334",
                "cname": "丰城市",
                "pid": "1326"
              },
              {
                "id": "1336",
                "cname": "高安市",
                "pid": "1326"
              },
              {
                "id": "1332",
                "cname": "靖安县",
                "pid": "1326"
              },
              {
                "id": "1330",
                "cname": "上高县",
                "pid": "1326"
              },
              {
                "id": "1333",
                "cname": "铜鼓县",
                "pid": "1326"
              },
              {
                "id": "1329",
                "cname": "万载县",
                "pid": "1326"
              },
              {
                "id": "1327",
                "cname": "袁州区",
                "pid": "1326"
              },
              {
                "id": "1331",
                "cname": "宜丰县",
                "pid": "1326"
              },
              {
                "id": "1335",
                "cname": "樟树市",
                "pid": "1326"
              },
              {
                "id": "100451",
                "cname": "其他",
                "pid": "1326"
              }
            ]
          }
        ]
      },
      {
        "id": "467",
        "cname": "辽宁",
        "pid": "1",
        "childrens": [
          {
            "id": "493",
            "cname": "鞍山",
            "pid": "467",
            "childrens": [
              {
                "id": "500",
                "cname": "海城市",
                "pid": "493"
              },
              {
                "id": "496",
                "cname": "立山区",
                "pid": "493"
              },
              {
                "id": "497",
                "cname": "千山区",
                "pid": "493"
              },
              {
                "id": "494",
                "cname": "铁东区",
                "pid": "493"
              },
              {
                "id": "495",
                "cname": "铁西区",
                "pid": "493"
              },
              {
                "id": "498",
                "cname": "台安县",
                "pid": "493"
              },
              {
                "id": "499",
                "cname": "岫岩满族自治县",
                "pid": "493"
              },
              {
                "id": "100497",
                "cname": "其他",
                "pid": "493"
              }
            ]
          },
          {
            "id": "509",
            "cname": "本溪",
            "pid": "467",
            "childrens": [
              {
                "id": "514",
                "cname": "本溪满族自治县",
                "pid": "509"
              },
              {
                "id": "515",
                "cname": "桓仁满族自治县",
                "pid": "509"
              },
              {
                "id": "512",
                "cname": "明山区",
                "pid": "509"
              },
              {
                "id": "513",
                "cname": "南芬区",
                "pid": "509"
              },
              {
                "id": "510",
                "cname": "平山区",
                "pid": "509"
              },
              {
                "id": "511",
                "cname": "溪湖区",
                "pid": "509"
              },
              {
                "id": "100160",
                "cname": "其他",
                "pid": "509"
              }
            ]
          },
          {
            "id": "482",
            "cname": "大连",
            "pid": "467",
            "childrens": [
              {
                "id": "489",
                "cname": "长海县",
                "pid": "482"
              },
              {
                "id": "486",
                "cname": "甘井子区",
                "pid": "482"
              },
              {
                "id": "488",
                "cname": "金州区",
                "pid": "482"
              },
              {
                "id": "487",
                "cname": "旅顺口区",
                "pid": "482"
              },
              {
                "id": "491",
                "cname": "普兰店市",
                "pid": "482"
              },
              {
                "id": "485",
                "cname": "沙河口区",
                "pid": "482"
              },
              {
                "id": "490",
                "cname": "瓦房店市",
                "pid": "482"
              },
              {
                "id": "484",
                "cname": "西岗区",
                "pid": "482"
              },
              {
                "id": "483",
                "cname": "中山区",
                "pid": "482"
              },
              {
                "id": "492",
                "cname": "庄河市",
                "pid": "482"
              },
              {
                "id": "100300",
                "cname": "其他",
                "pid": "482"
              }
            ]
          },
          {
            "id": "516",
            "cname": "丹东",
            "pid": "467",
            "childrens": [
              {
                "id": "521",
                "cname": "东港市",
                "pid": "516"
              },
              {
                "id": "522",
                "cname": "凤城市",
                "pid": "516"
              },
              {
                "id": "520",
                "cname": "宽甸满族自治县",
                "pid": "516"
              },
              {
                "id": "517",
                "cname": "元宝区",
                "pid": "516"
              },
              {
                "id": "518",
                "cname": "振兴区",
                "pid": "516"
              },
              {
                "id": "519",
                "cname": "振安区",
                "pid": "516"
              },
              {
                "id": "100372",
                "cname": "其他",
                "pid": "516"
              }
            ]
          },
          {
            "id": "501",
            "cname": "抚顺",
            "pid": "467",
            "childrens": [
              {
                "id": "503",
                "cname": "东洲区",
                "pid": "501"
              },
              {
                "id": "506",
                "cname": "抚顺县",
                "pid": "501"
              },
              {
                "id": "508",
                "cname": "清原满族自治县",
                "pid": "501"
              },
              {
                "id": "505",
                "cname": "顺城区",
                "pid": "501"
              },
              {
                "id": "504",
                "cname": "望花区",
                "pid": "501"
              },
              {
                "id": "502",
                "cname": "新抚区",
                "pid": "501"
              },
              {
                "id": "507",
                "cname": "新宾满族自治县",
                "pid": "501"
              },
              {
                "id": "100371",
                "cname": "其他",
                "pid": "501"
              }
            ]
          },
          {
            "id": "538",
            "cname": "阜新",
            "pid": "467",
            "childrens": [
              {
                "id": "544",
                "cname": "阜新蒙古族自治县",
                "pid": "538"
              },
              {
                "id": "539",
                "cname": "海州区",
                "pid": "538"
              },
              {
                "id": "542",
                "cname": "清河门区",
                "pid": "538"
              },
              {
                "id": "541",
                "cname": "太平区",
                "pid": "538"
              },
              {
                "id": "540",
                "cname": "新邱区",
                "pid": "538"
              },
              {
                "id": "543",
                "cname": "细河区",
                "pid": "538"
              },
              {
                "id": "545",
                "cname": "彰武县",
                "pid": "538"
              },
              {
                "id": "100445",
                "cname": "其他",
                "pid": "538"
              }
            ]
          },
          {
            "id": "575",
            "cname": "葫芦岛",
            "pid": "467",
            "childrens": [
              {
                "id": "580",
                "cname": "建昌县",
                "pid": "575"
              },
              {
                "id": "576",
                "cname": "连山区",
                "pid": "575"
              },
              {
                "id": "577",
                "cname": "龙港区",
                "pid": "575"
              },
              {
                "id": "578",
                "cname": "南票区",
                "pid": "575"
              },
              {
                "id": "579",
                "cname": "绥中县",
                "pid": "575"
              },
              {
                "id": "581",
                "cname": "兴城市",
                "pid": "575"
              },
              {
                "id": "100524",
                "cname": "其他",
                "pid": "575"
              }
            ]
          },
          {
            "id": "523",
            "cname": "锦州",
            "pid": "467",
            "childrens": [
              {
                "id": "530",
                "cname": "北镇市",
                "pid": "523"
              },
              {
                "id": "524",
                "cname": "古塔区",
                "pid": "523"
              },
              {
                "id": "527",
                "cname": "黑山县",
                "pid": "523"
              },
              {
                "id": "525",
                "cname": "凌河区",
                "pid": "523"
              },
              {
                "id": "529",
                "cname": "凌海市",
                "pid": "523"
              },
              {
                "id": "526",
                "cname": "太和区",
                "pid": "523"
              },
              {
                "id": "528",
                "cname": "义县",
                "pid": "523"
              },
              {
                "id": "100161",
                "cname": "其他",
                "pid": "523"
              }
            ]
          },
          {
            "id": "546",
            "cname": "辽阳",
            "pid": "467",
            "childrens": [
              {
                "id": "547",
                "cname": "白塔区",
                "pid": "546"
              },
              {
                "id": "553",
                "cname": "灯塔市",
                "pid": "546"
              },
              {
                "id": "550",
                "cname": "弓长岭区",
                "pid": "546"
              },
              {
                "id": "549",
                "cname": "宏伟区",
                "pid": "546"
              },
              {
                "id": "552",
                "cname": "辽阳县",
                "pid": "546"
              },
              {
                "id": "551",
                "cname": "太子河区",
                "pid": "546"
              },
              {
                "id": "548",
                "cname": "文圣区",
                "pid": "546"
              },
              {
                "id": "100163",
                "cname": "其他",
                "pid": "546"
              }
            ]
          },
          {
            "id": "554",
            "cname": "盘锦",
            "pid": "467",
            "childrens": [
              {
                "id": "557",
                "cname": "大洼县",
                "pid": "554"
              },
              {
                "id": "558",
                "cname": "盘山县",
                "pid": "554"
              },
              {
                "id": "555",
                "cname": "双台子区",
                "pid": "554"
              },
              {
                "id": "556",
                "cname": "兴隆台区",
                "pid": "554"
              },
              {
                "id": "100373",
                "cname": "其他",
                "pid": "554"
              }
            ]
          },
          {
            "id": "468",
            "cname": "沈阳",
            "pid": "467",
            "childrens": [
              {
                "id": "471",
                "cname": "大东区",
                "pid": "468"
              },
              {
                "id": "475",
                "cname": "东陵区",
                "pid": "468"
              },
              {
                "id": "480",
                "cname": "法库县",
                "pid": "468"
              },
              {
                "id": "469",
                "cname": "和平区",
                "pid": "468"
              },
              {
                "id": "472",
                "cname": "皇姑区",
                "pid": "468"
              },
              {
                "id": "479",
                "cname": "康平县",
                "pid": "468"
              },
              {
                "id": "478",
                "cname": "辽中县",
                "pid": "468"
              },
              {
                "id": "470",
                "cname": "沈河区",
                "pid": "468"
              },
              {
                "id": "474",
                "cname": "苏家屯区",
                "pid": "468"
              },
              {
                "id": "476",
                "cname": "沈北新区",
                "pid": "468"
              },
              {
                "id": "473",
                "cname": "铁西区",
                "pid": "468"
              },
              {
                "id": "481",
                "cname": "新民市",
                "pid": "468"
              },
              {
                "id": "477",
                "cname": "于洪区",
                "pid": "468"
              },
              {
                "id": "100370",
                "cname": "其他",
                "pid": "468"
              }
            ]
          },
          {
            "id": "559",
            "cname": "铁岭",
            "pid": "467",
            "childrens": [
              {
                "id": "564",
                "cname": "昌图县",
                "pid": "559"
              },
              {
                "id": "566",
                "cname": "开原市",
                "pid": "559"
              },
              {
                "id": "561",
                "cname": "清河区",
                "pid": "559"
              },
              {
                "id": "562",
                "cname": "铁岭县",
                "pid": "559"
              },
              {
                "id": "565",
                "cname": "调兵山市",
                "pid": "559"
              },
              {
                "id": "563",
                "cname": "西丰县",
                "pid": "559"
              },
              {
                "id": "560",
                "cname": "银州区",
                "pid": "559"
              },
              {
                "id": "100301",
                "cname": "其他",
                "pid": "559"
              }
            ]
          },
          {
            "id": "531",
            "cname": "营口",
            "pid": "467",
            "childrens": [
              {
                "id": "534",
                "cname": "鲅鱼圈区",
                "pid": "531"
              },
              {
                "id": "537",
                "cname": "大石桥市",
                "pid": "531"
              },
              {
                "id": "536",
                "cname": "盖州市",
                "pid": "531"
              },
              {
                "id": "535",
                "cname": "老边区",
                "pid": "531"
              },
              {
                "id": "533",
                "cname": "西市区",
                "pid": "531"
              },
              {
                "id": "532",
                "cname": "站前区",
                "pid": "531"
              },
              {
                "id": "100162",
                "cname": "其他",
                "pid": "531"
              }
            ]
          },
          {
            "id": "567",
            "cname": "朝阳",
            "pid": "467",
            "childrens": [
              {
                "id": "573",
                "cname": "北票市",
                "pid": "567"
              },
              {
                "id": "571",
                "cname": "建平县",
                "pid": "567"
              },
              {
                "id": "572",
                "cname": "喀喇沁左翼蒙古族自治县",
                "pid": "567"
              },
              {
                "id": "569",
                "cname": "龙城区",
                "pid": "567"
              },
              {
                "id": "574",
                "cname": "凌源市",
                "pid": "567"
              },
              {
                "id": "568",
                "cname": "双塔区",
                "pid": "567"
              },
              {
                "id": "570",
                "cname": "朝阳县",
                "pid": "567"
              },
              {
                "id": "100164",
                "cname": "其他",
                "pid": "567"
              }
            ]
          }
        ]
      },
      {
        "id": "353",
        "cname": "内蒙古",
        "pid": "1",
        "childrens": [
          {
            "id": "463",
            "cname": "阿拉善",
            "pid": "353",
            "childrens": [
              {
                "id": "464",
                "cname": "阿拉善左旗",
                "pid": "463"
              },
              {
                "id": "465",
                "cname": "阿拉善右旗",
                "pid": "463"
              },
              {
                "id": "466",
                "cname": "额济纳旗",
                "pid": "463"
              },
              {
                "id": "100009",
                "cname": "其他",
                "pid": "463"
              }
            ]
          },
          {
            "id": "364",
            "cname": "包头",
            "pid": "353",
            "childrens": [
              {
                "id": "369",
                "cname": "白云鄂博矿区",
                "pid": "364"
              },
              {
                "id": "365",
                "cname": "东河区",
                "pid": "364"
              },
              {
                "id": "373",
                "cname": "达尔罕茂明安联合旗",
                "pid": "364"
              },
              {
                "id": "372",
                "cname": "固阳县",
                "pid": "364"
              },
              {
                "id": "370",
                "cname": "九原区",
                "pid": "364"
              },
              {
                "id": "366",
                "cname": "昆都仑区",
                "pid": "364"
              },
              {
                "id": "367",
                "cname": "青山区",
                "pid": "364"
              },
              {
                "id": "368",
                "cname": "石拐区",
                "pid": "364"
              },
              {
                "id": "371",
                "cname": "土默特右旗",
                "pid": "364"
              },
              {
                "id": "100159",
                "cname": "其他",
                "pid": "364"
              }
            ]
          },
          {
            "id": "423",
            "cname": "巴彦淖尔",
            "pid": "353",
            "childrens": [
              {
                "id": "426",
                "cname": "磴口县",
                "pid": "423"
              },
              {
                "id": "430",
                "cname": "杭锦后旗",
                "pid": "423"
              },
              {
                "id": "424",
                "cname": "临河区",
                "pid": "423"
              },
              {
                "id": "425",
                "cname": "五原县",
                "pid": "423"
              },
              {
                "id": "427",
                "cname": "乌拉特前旗",
                "pid": "423"
              },
              {
                "id": "428",
                "cname": "乌拉特中旗",
                "pid": "423"
              },
              {
                "id": "429",
                "cname": "乌拉特后旗",
                "pid": "423"
              },
              {
                "id": "100369",
                "cname": "其他",
                "pid": "423"
              }
            ]
          },
          {
            "id": "378",
            "cname": "赤峰",
            "pid": "353",
            "childrens": [
              {
                "id": "382",
                "cname": "阿鲁科尔沁旗",
                "pid": "378"
              },
              {
                "id": "390",
                "cname": "敖汉旗",
                "pid": "378"
              },
              {
                "id": "383",
                "cname": "巴林左旗",
                "pid": "378"
              },
              {
                "id": "384",
                "cname": "巴林右旗",
                "pid": "378"
              },
              {
                "id": "379",
                "cname": "红山区",
                "pid": "378"
              },
              {
                "id": "386",
                "cname": "克什克腾旗",
                "pid": "378"
              },
              {
                "id": "388",
                "cname": "喀喇沁旗",
                "pid": "378"
              },
              {
                "id": "385",
                "cname": "林西县",
                "pid": "378"
              },
              {
                "id": "389",
                "cname": "宁城县",
                "pid": "378"
              },
              {
                "id": "381",
                "cname": "松山区",
                "pid": "378"
              },
              {
                "id": "387",
                "cname": "翁牛特旗",
                "pid": "378"
              },
              {
                "id": "380",
                "cname": "元宝山区",
                "pid": "378"
              },
              {
                "id": "100005",
                "cname": "其他",
                "pid": "378"
              }
            ]
          },
          {
            "id": "400",
            "cname": "鄂尔多斯",
            "pid": "353",
            "childrens": [
              {
                "id": "401",
                "cname": "东胜区",
                "pid": "400"
              },
              {
                "id": "402",
                "cname": "达拉特旗",
                "pid": "400"
              },
              {
                "id": "404",
                "cname": "鄂托克前旗",
                "pid": "400"
              },
              {
                "id": "405",
                "cname": "鄂托克旗",
                "pid": "400"
              },
              {
                "id": "406",
                "cname": "杭锦旗",
                "pid": "400"
              },
              {
                "id": "407",
                "cname": "乌审旗",
                "pid": "400"
              },
              {
                "id": "408",
                "cname": "伊金霍洛旗",
                "pid": "400"
              },
              {
                "id": "403",
                "cname": "准格尔旗",
                "pid": "400"
              },
              {
                "id": "100368",
                "cname": "其他",
                "pid": "400"
              }
            ]
          },
          {
            "id": "354",
            "cname": "呼和浩特",
            "pid": "353",
            "childrens": [
              {
                "id": "356",
                "cname": "回民区",
                "pid": "354"
              },
              {
                "id": "361",
                "cname": "和林格尔县",
                "pid": "354"
              },
              {
                "id": "362",
                "cname": "清水河县",
                "pid": "354"
              },
              {
                "id": "358",
                "cname": "赛罕区",
                "pid": "354"
              },
              {
                "id": "359",
                "cname": "土默特左旗",
                "pid": "354"
              },
              {
                "id": "360",
                "cname": "托克托县",
                "pid": "354"
              },
              {
                "id": "363",
                "cname": "武川县",
                "pid": "354"
              },
              {
                "id": "355",
                "cname": "新城区",
                "pid": "354"
              },
              {
                "id": "357",
                "cname": "玉泉区",
                "pid": "354"
              },
              {
                "id": "100494",
                "cname": "其他",
                "pid": "354"
              }
            ]
          },
          {
            "id": "409",
            "cname": "呼伦贝尔",
            "pid": "353",
            "childrens": [
              {
                "id": "411",
                "cname": "阿荣旗",
                "pid": "409"
              },
              {
                "id": "415",
                "cname": "陈巴尔虎旗",
                "pid": "409"
              },
              {
                "id": "421",
                "cname": "额尔古纳市",
                "pid": "409"
              },
              {
                "id": "413",
                "cname": "鄂伦春自治旗",
                "pid": "409"
              },
              {
                "id": "414",
                "cname": "鄂温克族自治旗",
                "pid": "409"
              },
              {
                "id": "422",
                "cname": "根河市",
                "pid": "409"
              },
              {
                "id": "410",
                "cname": "海拉尔区",
                "pid": "409"
              },
              {
                "id": "412",
                "cname": "莫力达瓦达斡尔族自治旗",
                "pid": "409"
              },
              {
                "id": "418",
                "cname": "满洲里市",
                "pid": "409"
              },
              {
                "id": "416",
                "cname": "新巴尔虎左旗",
                "pid": "409"
              },
              {
                "id": "417",
                "cname": "新巴尔虎右旗",
                "pid": "409"
              },
              {
                "id": "419",
                "cname": "牙克石市",
                "pid": "409"
              },
              {
                "id": "420",
                "cname": "扎兰屯市",
                "pid": "409"
              },
              {
                "id": "100006",
                "cname": "其他",
                "pid": "409"
              }
            ]
          },
          {
            "id": "391",
            "cname": "通辽",
            "pid": "353",
            "childrens": [
              {
                "id": "399",
                "cname": "霍林郭勒市",
                "pid": "391"
              },
              {
                "id": "392",
                "cname": "科尔沁区",
                "pid": "391"
              },
              {
                "id": "393",
                "cname": "科尔沁左翼中旗",
                "pid": "391"
              },
              {
                "id": "394",
                "cname": "科尔沁左翼后旗",
                "pid": "391"
              },
              {
                "id": "395",
                "cname": "开鲁县",
                "pid": "391"
              },
              {
                "id": "396",
                "cname": "库伦旗",
                "pid": "391"
              },
              {
                "id": "397",
                "cname": "奈曼旗",
                "pid": "391"
              },
              {
                "id": "398",
                "cname": "扎鲁特旗",
                "pid": "391"
              },
              {
                "id": "100496",
                "cname": "其他",
                "pid": "391"
              }
            ]
          },
          {
            "id": "374",
            "cname": "乌海",
            "pid": "353",
            "childrens": [
              {
                "id": "375",
                "cname": "海勃湾区",
                "pid": "374"
              },
              {
                "id": "376",
                "cname": "海南区",
                "pid": "374"
              },
              {
                "id": "377",
                "cname": "乌达区",
                "pid": "374"
              },
              {
                "id": "100495",
                "cname": "其他",
                "pid": "374"
              }
            ]
          },
          {
            "id": "431",
            "cname": "乌兰察布",
            "pid": "353",
            "childrens": [
              {
                "id": "438",
                "cname": "察哈尔右翼前旗",
                "pid": "431"
              },
              {
                "id": "439",
                "cname": "察哈尔右翼中旗",
                "pid": "431"
              },
              {
                "id": "440",
                "cname": "察哈尔右翼后旗",
                "pid": "431"
              },
              {
                "id": "442",
                "cname": "丰镇市",
                "pid": "431"
              },
              {
                "id": "434",
                "cname": "化德县",
                "pid": "431"
              },
              {
                "id": "432",
                "cname": "集宁区",
                "pid": "431"
              },
              {
                "id": "437",
                "cname": "凉城县",
                "pid": "431"
              },
              {
                "id": "435",
                "cname": "商都县",
                "pid": "431"
              },
              {
                "id": "441",
                "cname": "四子王旗",
                "pid": "431"
              },
              {
                "id": "436",
                "cname": "兴和县",
                "pid": "431"
              },
              {
                "id": "433",
                "cname": "卓资县",
                "pid": "431"
              },
              {
                "id": "100299",
                "cname": "其他",
                "pid": "431"
              }
            ]
          },
          {
            "id": "443",
            "cname": "兴安",
            "pid": "353",
            "childrens": [
              {
                "id": "445",
                "cname": "阿尔山市",
                "pid": "443"
              },
              {
                "id": "446",
                "cname": "科尔沁右翼前旗",
                "pid": "443"
              },
              {
                "id": "447",
                "cname": "科尔沁右翼中旗",
                "pid": "443"
              },
              {
                "id": "449",
                "cname": "突泉县",
                "pid": "443"
              },
              {
                "id": "444",
                "cname": "乌兰浩特市",
                "pid": "443"
              },
              {
                "id": "448",
                "cname": "扎赉特旗",
                "pid": "443"
              },
              {
                "id": "100007",
                "cname": "其他",
                "pid": "443"
              }
            ]
          },
          {
            "id": "450",
            "cname": "锡林郭勒",
            "pid": "353",
            "childrens": [
              {
                "id": "453",
                "cname": "阿巴嘎旗",
                "pid": "450"
              },
              {
                "id": "456",
                "cname": "东乌珠穆沁旗",
                "pid": "450"
              },
              {
                "id": "462",
                "cname": "多伦县",
                "pid": "450"
              },
              {
                "id": "451",
                "cname": "二连浩特市",
                "pid": "450"
              },
              {
                "id": "454",
                "cname": "苏尼特左旗",
                "pid": "450"
              },
              {
                "id": "455",
                "cname": "苏尼特右旗",
                "pid": "450"
              },
              {
                "id": "458",
                "cname": "太仆寺旗",
                "pid": "450"
              },
              {
                "id": "452",
                "cname": "锡林浩特市",
                "pid": "450"
              },
              {
                "id": "457",
                "cname": "西乌珠穆沁旗",
                "pid": "450"
              },
              {
                "id": "459",
                "cname": "镶黄旗",
                "pid": "450"
              },
              {
                "id": "460",
                "cname": "正镶白旗",
                "pid": "450"
              },
              {
                "id": "461",
                "cname": "正蓝旗",
                "pid": "450"
              },
              {
                "id": "100008",
                "cname": "其他",
                "pid": "450"
              }
            ]
          }
        ]
      },
      {
        "id": "3087",
        "cname": "宁夏",
        "pid": "1",
        "childrens": [
          {
            "id": "3105",
            "cname": "固原",
            "pid": "3087",
            "childrens": [
              {
                "id": "3109",
                "cname": "泾源县",
                "pid": "3105"
              },
              {
                "id": "3108",
                "cname": "隆德县",
                "pid": "3105"
              },
              {
                "id": "3110",
                "cname": "彭阳县",
                "pid": "3105"
              },
              {
                "id": "3107",
                "cname": "西吉县",
                "pid": "3105"
              },
              {
                "id": "3106",
                "cname": "原州区",
                "pid": "3105"
              },
              {
                "id": "100535",
                "cname": "其他",
                "pid": "3105"
              }
            ]
          },
          {
            "id": "3095",
            "cname": "石嘴山",
            "pid": "3087",
            "childrens": [
              {
                "id": "3096",
                "cname": "大武口区",
                "pid": "3095"
              },
              {
                "id": "3097",
                "cname": "惠农区",
                "pid": "3095"
              },
              {
                "id": "3098",
                "cname": "平罗县",
                "pid": "3095"
              },
              {
                "id": "100425",
                "cname": "其他",
                "pid": "3095"
              }
            ]
          },
          {
            "id": "3099",
            "cname": "吴忠",
            "pid": "3087",
            "childrens": [
              {
                "id": "3101",
                "cname": "红寺堡区",
                "pid": "3099"
              },
              {
                "id": "3100",
                "cname": "利通区",
                "pid": "3099"
              },
              {
                "id": "3104",
                "cname": "青铜峡市",
                "pid": "3099"
              },
              {
                "id": "3103",
                "cname": "同心县",
                "pid": "3099"
              },
              {
                "id": "3102",
                "cname": "盐池县",
                "pid": "3099"
              },
              {
                "id": "100518",
                "cname": "其他",
                "pid": "3099"
              }
            ]
          },
          {
            "id": "3088",
            "cname": "银川",
            "pid": "3087",
            "childrens": [
              {
                "id": "3093",
                "cname": "贺兰县",
                "pid": "3088"
              },
              {
                "id": "3091",
                "cname": "金凤区",
                "pid": "3088"
              },
              {
                "id": "3094",
                "cname": "灵武市",
                "pid": "3088"
              },
              {
                "id": "3089",
                "cname": "兴庆区",
                "pid": "3088"
              },
              {
                "id": "3090",
                "cname": "西夏区",
                "pid": "3088"
              },
              {
                "id": "3092",
                "cname": "永宁县",
                "pid": "3088"
              },
              {
                "id": "100517",
                "cname": "其他",
                "pid": "3088"
              }
            ]
          },
          {
            "id": "3111",
            "cname": "中卫",
            "pid": "3087",
            "childrens": [
              {
                "id": "3114",
                "cname": "海原县",
                "pid": "3111"
              },
              {
                "id": "3112",
                "cname": "沙坡头区",
                "pid": "3111"
              },
              {
                "id": "3113",
                "cname": "中宁县",
                "pid": "3111"
              },
              {
                "id": "100519",
                "cname": "其他",
                "pid": "3111"
              }
            ]
          }
        ]
      },
      {
        "id": "3035",
        "cname": "青海",
        "pid": "1",
        "childrens": [
          {
            "id": "3067",
            "cname": "果洛",
            "pid": "3035",
            "childrens": [
              {
                "id": "3069",
                "cname": "班玛县",
                "pid": "3067"
              },
              {
                "id": "3071",
                "cname": "达日县",
                "pid": "3067"
              },
              {
                "id": "3070",
                "cname": "甘德县",
                "pid": "3067"
              },
              {
                "id": "3072",
                "cname": "久治县",
                "pid": "3067"
              },
              {
                "id": "3068",
                "cname": "玛沁县",
                "pid": "3067"
              },
              {
                "id": "3073",
                "cname": "玛多县",
                "pid": "3067"
              },
              {
                "id": "100210",
                "cname": "其他",
                "pid": "3067"
              }
            ]
          },
          {
            "id": "3044",
            "cname": "海东",
            "pid": "3035",
            "childrens": [
              {
                "id": "3048",
                "cname": "互助土族自治县",
                "pid": "3044"
              },
              {
                "id": "3049",
                "cname": "化隆回族自治县",
                "pid": "3044"
              },
              {
                "id": "3047",
                "cname": "乐都县",
                "pid": "3044"
              },
              {
                "id": "3046",
                "cname": "民和回族土族自治县",
                "pid": "3044"
              },
              {
                "id": "3045",
                "cname": "平安县",
                "pid": "3044"
              },
              {
                "id": "3050",
                "cname": "循化撒拉族自治县",
                "pid": "3044"
              },
              {
                "id": "100515",
                "cname": "其他",
                "pid": "3044"
              }
            ]
          },
          {
            "id": "3051",
            "cname": "海北",
            "pid": "3035",
            "childrens": [
              {
                "id": "3055",
                "cname": "刚察县",
                "pid": "3051"
              },
              {
                "id": "3054",
                "cname": "海晏县",
                "pid": "3051"
              },
              {
                "id": "3052",
                "cname": "门源回族自治县",
                "pid": "3051"
              },
              {
                "id": "3053",
                "cname": "祁连县",
                "pid": "3051"
              },
              {
                "id": "100484",
                "cname": "其他",
                "pid": "3051"
              }
            ]
          },
          {
            "id": "3056",
            "cname": "黄南",
            "pid": "3035",
            "childrens": [
              {
                "id": "3060",
                "cname": "河南蒙古族自治县",
                "pid": "3056"
              },
              {
                "id": "3058",
                "cname": "尖扎县",
                "pid": "3056"
              },
              {
                "id": "3057",
                "cname": "同仁县",
                "pid": "3056"
              },
              {
                "id": "3059",
                "cname": "泽库县",
                "pid": "3056"
              },
              {
                "id": "100516",
                "cname": "其他",
                "pid": "3056"
              }
            ]
          },
          {
            "id": "3061",
            "cname": "海南",
            "pid": "3035",
            "childrens": [
              {
                "id": "3062",
                "cname": "共和县",
                "pid": "3061"
              },
              {
                "id": "3064",
                "cname": "贵德县",
                "pid": "3061"
              },
              {
                "id": "3066",
                "cname": "贵南县",
                "pid": "3061"
              },
              {
                "id": "3063",
                "cname": "同德县",
                "pid": "3061"
              },
              {
                "id": "3065",
                "cname": "兴海县",
                "pid": "3061"
              },
              {
                "id": "100485",
                "cname": "其他",
                "pid": "3061"
              }
            ]
          },
          {
            "id": "3081",
            "cname": "海西",
            "pid": "3035",
            "childrens": [
              {
                "id": "3083",
                "cname": "德令哈市",
                "pid": "3081"
              },
              {
                "id": "3085",
                "cname": "都兰县",
                "pid": "3081"
              },
              {
                "id": "3082",
                "cname": "格尔木市",
                "pid": "3081"
              },
              {
                "id": "3086",
                "cname": "天峻县",
                "pid": "3081"
              },
              {
                "id": "3084",
                "cname": "乌兰县",
                "pid": "3081"
              },
              {
                "id": "100424",
                "cname": "其他",
                "pid": "3081"
              }
            ]
          },
          {
            "id": "3036",
            "cname": "西宁",
            "pid": "3035",
            "childrens": [
              {
                "id": "3037",
                "cname": "城东区",
                "pid": "3036"
              },
              {
                "id": "3038",
                "cname": "城中区",
                "pid": "3036"
              },
              {
                "id": "3039",
                "cname": "城西区",
                "pid": "3036"
              },
              {
                "id": "3040",
                "cname": "城北区",
                "pid": "3036"
              },
              {
                "id": "3041",
                "cname": "大通回族土族自治县",
                "pid": "3036"
              },
              {
                "id": "3042",
                "cname": "湟中县",
                "pid": "3036"
              },
              {
                "id": "3043",
                "cname": "湟源县",
                "pid": "3036"
              },
              {
                "id": "100359",
                "cname": "其他",
                "pid": "3036"
              }
            ]
          },
          {
            "id": "3074",
            "cname": "玉树",
            "pid": "3035",
            "childrens": [
              {
                "id": "3077",
                "cname": "称多县",
                "pid": "3074"
              },
              {
                "id": "3079",
                "cname": "囊谦县",
                "pid": "3074"
              },
              {
                "id": "3080",
                "cname": "曲麻莱县",
                "pid": "3074"
              },
              {
                "id": "3075",
                "cname": "玉树县",
                "pid": "3074"
              },
              {
                "id": "3076",
                "cname": "杂多县",
                "pid": "3074"
              },
              {
                "id": "3078",
                "cname": "治多县",
                "pid": "3074"
              },
              {
                "id": "100360",
                "cname": "其他",
                "pid": "3074"
              }
            ]
          }
        ]
      },
      {
        "id": "222",
        "cname": "山西",
        "pid": "1",
        "childrens": [
          {
            "id": "252",
            "cname": "长治",
            "pid": "222",
            "childrens": [
              {
                "id": "253",
                "cname": "城区",
                "pid": "252"
              },
              {
                "id": "255",
                "cname": "长治县",
                "pid": "252"
              },
              {
                "id": "261",
                "cname": "长子县",
                "pid": "252"
              },
              {
                "id": "260",
                "cname": "壶关县",
                "pid": "252"
              },
              {
                "id": "254",
                "cname": "郊区",
                "pid": "252"
              },
              {
                "id": "259",
                "cname": "黎城县",
                "pid": "252"
              },
              {
                "id": "265",
                "cname": "潞城市",
                "pid": "252"
              },
              {
                "id": "258",
                "cname": "平顺县",
                "pid": "252"
              },
              {
                "id": "263",
                "cname": "沁县",
                "pid": "252"
              },
              {
                "id": "264",
                "cname": "沁源县",
                "pid": "252"
              },
              {
                "id": "257",
                "cname": "屯留县",
                "pid": "252"
              },
              {
                "id": "262",
                "cname": "武乡县",
                "pid": "252"
              },
              {
                "id": "256",
                "cname": "襄垣县",
                "pid": "252"
              },
              {
                "id": "100297",
                "cname": "其他",
                "pid": "252"
              }
            ]
          },
          {
            "id": "234",
            "cname": "大同",
            "pid": "222",
            "childrens": [
              {
                "id": "235",
                "cname": "城区",
                "pid": "234"
              },
              {
                "id": "245",
                "cname": "大同县",
                "pid": "234"
              },
              {
                "id": "241",
                "cname": "广灵县",
                "pid": "234"
              },
              {
                "id": "243",
                "cname": "浑源县",
                "pid": "234"
              },
              {
                "id": "236",
                "cname": "矿区",
                "pid": "234"
              },
              {
                "id": "242",
                "cname": "灵丘县",
                "pid": "234"
              },
              {
                "id": "237",
                "cname": "南郊区",
                "pid": "234"
              },
              {
                "id": "240",
                "cname": "天镇县",
                "pid": "234"
              },
              {
                "id": "238",
                "cname": "新荣区",
                "pid": "234"
              },
              {
                "id": "239",
                "cname": "阳高县",
                "pid": "234"
              },
              {
                "id": "244",
                "cname": "左云县",
                "pid": "234"
              },
              {
                "id": "100295",
                "cname": "其他",
                "pid": "234"
              }
            ]
          },
          {
            "id": "266",
            "cname": "晋城",
            "pid": "222",
            "childrens": [
              {
                "id": "267",
                "cname": "城区",
                "pid": "266"
              },
              {
                "id": "272",
                "cname": "高平市",
                "pid": "266"
              },
              {
                "id": "270",
                "cname": "陵川县",
                "pid": "266"
              },
              {
                "id": "268",
                "cname": "沁水县",
                "pid": "266"
              },
              {
                "id": "269",
                "cname": "阳城县",
                "pid": "266"
              },
              {
                "id": "271",
                "cname": "泽州县",
                "pid": "266"
              },
              {
                "id": "100298",
                "cname": "其他",
                "pid": "266"
              }
            ]
          },
          {
            "id": "280",
            "cname": "晋中",
            "pid": "222",
            "childrens": [
              {
                "id": "284",
                "cname": "和顺县",
                "pid": "280"
              },
              {
                "id": "291",
                "cname": "介休市",
                "pid": "280"
              },
              {
                "id": "290",
                "cname": "灵石县",
                "pid": "280"
              },
              {
                "id": "289",
                "cname": "平遥县",
                "pid": "280"
              },
              {
                "id": "288",
                "cname": "祁县",
                "pid": "280"
              },
              {
                "id": "286",
                "cname": "寿阳县",
                "pid": "280"
              },
              {
                "id": "287",
                "cname": "太谷县",
                "pid": "280"
              },
              {
                "id": "285",
                "cname": "昔阳县",
                "pid": "280"
              },
              {
                "id": "281",
                "cname": "榆次区",
                "pid": "280"
              },
              {
                "id": "282",
                "cname": "榆社县",
                "pid": "280"
              },
              {
                "id": "283",
                "cname": "左权县",
                "pid": "280"
              },
              {
                "id": "100492",
                "cname": "其他",
                "pid": "280"
              }
            ]
          },
          {
            "id": "321",
            "cname": "临汾",
            "pid": "222",
            "childrens": [
              {
                "id": "328",
                "cname": "安泽县",
                "pid": "321"
              },
              {
                "id": "332",
                "cname": "大宁县",
                "pid": "321"
              },
              {
                "id": "329",
                "cname": "浮山县",
                "pid": "321"
              },
              {
                "id": "336",
                "cname": "汾西县",
                "pid": "321"
              },
              {
                "id": "327",
                "cname": "古县",
                "pid": "321"
              },
              {
                "id": "326",
                "cname": "洪洞县",
                "pid": "321"
              },
              {
                "id": "337",
                "cname": "侯马市",
                "pid": "321"
              },
              {
                "id": "338",
                "cname": "霍州市",
                "pid": "321"
              },
              {
                "id": "330",
                "cname": "吉县",
                "pid": "321"
              },
              {
                "id": "335",
                "cname": "蒲县",
                "pid": "321"
              },
              {
                "id": "323",
                "cname": "曲沃县",
                "pid": "321"
              },
              {
                "id": "325",
                "cname": "襄汾县",
                "pid": "321"
              },
              {
                "id": "331",
                "cname": "乡宁县",
                "pid": "321"
              },
              {
                "id": "333",
                "cname": "隰县",
                "pid": "321"
              },
              {
                "id": "322",
                "cname": "尧都区",
                "pid": "321"
              },
              {
                "id": "324",
                "cname": "翼城县",
                "pid": "321"
              },
              {
                "id": "334",
                "cname": "永和县",
                "pid": "321"
              },
              {
                "id": "100004",
                "cname": "其他",
                "pid": "321"
              }
            ]
          },
          {
            "id": "339",
            "cname": "吕梁",
            "pid": "222",
            "childrens": [
              {
                "id": "348",
                "cname": "方山县",
                "pid": "339"
              },
              {
                "id": "352",
                "cname": "汾阳市",
                "pid": "339"
              },
              {
                "id": "342",
                "cname": "交城县",
                "pid": "339"
              },
              {
                "id": "350",
                "cname": "交口县",
                "pid": "339"
              },
              {
                "id": "340",
                "cname": "离石区",
                "pid": "339"
              },
              {
                "id": "344",
                "cname": "临县",
                "pid": "339"
              },
              {
                "id": "345",
                "cname": "柳林县",
                "pid": "339"
              },
              {
                "id": "347",
                "cname": "岚县",
                "pid": "339"
              },
              {
                "id": "346",
                "cname": "石楼县",
                "pid": "339"
              },
              {
                "id": "341",
                "cname": "文水县",
                "pid": "339"
              },
              {
                "id": "343",
                "cname": "兴县",
                "pid": "339"
              },
              {
                "id": "351",
                "cname": "孝义市",
                "pid": "339"
              },
              {
                "id": "349",
                "cname": "中阳县",
                "pid": "339"
              },
              {
                "id": "100444",
                "cname": "其他",
                "pid": "339"
              }
            ]
          },
          {
            "id": "273",
            "cname": "朔州",
            "pid": "222",
            "childrens": [
              {
                "id": "279",
                "cname": "怀仁县",
                "pid": "273"
              },
              {
                "id": "275",
                "cname": "平鲁区",
                "pid": "273"
              },
              {
                "id": "274",
                "cname": "朔城区",
                "pid": "273"
              },
              {
                "id": "276",
                "cname": "山阴县",
                "pid": "273"
              },
              {
                "id": "277",
                "cname": "应县",
                "pid": "273"
              },
              {
                "id": "278",
                "cname": "右玉县",
                "pid": "273"
              },
              {
                "id": "100491",
                "cname": "其他",
                "pid": "273"
              }
            ]
          },
          {
            "id": "223",
            "cname": "太原",
            "pid": "222",
            "childrens": [
              {
                "id": "233",
                "cname": "古交市",
                "pid": "223"
              },
              {
                "id": "227",
                "cname": "尖草坪区",
                "pid": "223"
              },
              {
                "id": "229",
                "cname": "晋源区",
                "pid": "223"
              },
              {
                "id": "232",
                "cname": "娄烦县",
                "pid": "223"
              },
              {
                "id": "230",
                "cname": "清徐县",
                "pid": "223"
              },
              {
                "id": "228",
                "cname": "万柏林区",
                "pid": "223"
              },
              {
                "id": "224",
                "cname": "小店区",
                "pid": "223"
              },
              {
                "id": "226",
                "cname": "杏花岭区",
                "pid": "223"
              },
              {
                "id": "225",
                "cname": "迎泽区",
                "pid": "223"
              },
              {
                "id": "231",
                "cname": "阳曲县",
                "pid": "223"
              },
              {
                "id": "100462",
                "cname": "其他",
                "pid": "223"
              }
            ]
          },
          {
            "id": "306",
            "cname": "忻州",
            "pid": "222",
            "childrens": [
              {
                "id": "318",
                "cname": "保德县",
                "pid": "306"
              },
              {
                "id": "308",
                "cname": "定襄县",
                "pid": "306"
              },
              {
                "id": "310",
                "cname": "代县",
                "pid": "306"
              },
              {
                "id": "311",
                "cname": "繁峙县",
                "pid": "306"
              },
              {
                "id": "317",
                "cname": "河曲县",
                "pid": "306"
              },
              {
                "id": "313",
                "cname": "静乐县",
                "pid": "306"
              },
              {
                "id": "316",
                "cname": "岢岚县",
                "pid": "306"
              },
              {
                "id": "312",
                "cname": "宁武县",
                "pid": "306"
              },
              {
                "id": "319",
                "cname": "偏关县",
                "pid": "306"
              },
              {
                "id": "314",
                "cname": "神池县",
                "pid": "306"
              },
              {
                "id": "309",
                "cname": "五台县",
                "pid": "306"
              },
              {
                "id": "315",
                "cname": "五寨县",
                "pid": "306"
              },
              {
                "id": "307",
                "cname": "忻府区",
                "pid": "306"
              },
              {
                "id": "320",
                "cname": "原平市",
                "pid": "306"
              },
              {
                "id": "100158",
                "cname": "其他",
                "pid": "306"
              }
            ]
          },
          {
            "id": "246",
            "cname": "阳泉",
            "pid": "222",
            "childrens": [
              {
                "id": "247",
                "cname": "城区",
                "pid": "246"
              },
              {
                "id": "249",
                "cname": "郊区",
                "pid": "246"
              },
              {
                "id": "248",
                "cname": "矿区",
                "pid": "246"
              },
              {
                "id": "250",
                "cname": "平定县",
                "pid": "246"
              },
              {
                "id": "251",
                "cname": "盂县",
                "pid": "246"
              },
              {
                "id": "100296",
                "cname": "其他",
                "pid": "246"
              }
            ]
          },
          {
            "id": "292",
            "cname": "运城",
            "pid": "222",
            "childrens": [
              {
                "id": "305",
                "cname": "河津市",
                "pid": "292"
              },
              {
                "id": "297",
                "cname": "稷山县",
                "pid": "292"
              },
              {
                "id": "299",
                "cname": "绛县",
                "pid": "292"
              },
              {
                "id": "294",
                "cname": "临猗县",
                "pid": "292"
              },
              {
                "id": "302",
                "cname": "平陆县",
                "pid": "292"
              },
              {
                "id": "303",
                "cname": "芮城县",
                "pid": "292"
              },
              {
                "id": "295",
                "cname": "万荣县",
                "pid": "292"
              },
              {
                "id": "296",
                "cname": "闻喜县",
                "pid": "292"
              },
              {
                "id": "298",
                "cname": "新绛县",
                "pid": "292"
              },
              {
                "id": "301",
                "cname": "夏县",
                "pid": "292"
              },
              {
                "id": "293",
                "cname": "盐湖区",
                "pid": "292"
              },
              {
                "id": "300",
                "cname": "垣曲县",
                "pid": "292"
              },
              {
                "id": "304",
                "cname": "永济市",
                "pid": "292"
              },
              {
                "id": "100493",
                "cname": "其他",
                "pid": "292"
              }
            ]
          }
        ]
      },
      {
        "id": "794",
        "cname": "上海",
        "pid": "1",
        "childrens": [
          {
            "id": "795",
            "cname": "上海",
            "pid": "794",
            "childrens": [
              {
                "id": "806",
                "cname": "宝山",
                "pid": "795"
              },
              {
                "id": "799",
                "cname": "长宁",
                "pid": "795"
              },
              {
                "id": "813",
                "cname": "崇明",
                "pid": "795"
              },
              {
                "id": "811",
                "cname": "奉贤",
                "pid": "795"
              },
              {
                "id": "796",
                "cname": "黄浦",
                "pid": "795"
              },
              {
                "id": "803",
                "cname": "虹口",
                "pid": "795"
              },
              {
                "id": "800",
                "cname": "静安",
                "pid": "795"
              },
              {
                "id": "807",
                "cname": "嘉定",
                "pid": "795"
              },
              {
                "id": "809",
                "cname": "金山",
                "pid": "795"
              },
              {
                "id": "797",
                "cname": "卢湾",
                "pid": "795"
              },
              {
                "id": "805",
                "cname": "闵行",
                "pid": "795"
              },
              {
                "id": "801",
                "cname": "普陀",
                "pid": "795"
              },
              {
                "id": "808",
                "cname": "浦东新区",
                "pid": "795"
              },
              {
                "id": "812",
                "cname": "青浦",
                "pid": "795"
              },
              {
                "id": "810",
                "cname": "松江",
                "pid": "795"
              },
              {
                "id": "798",
                "cname": "徐汇",
                "pid": "795"
              },
              {
                "id": "804",
                "cname": "杨浦",
                "pid": "795"
              },
              {
                "id": "802",
                "cname": "闸北",
                "pid": "795"
              },
              {
                "id": "100168",
                "cname": "其他",
                "pid": "795"
              }
            ]
          }
        ]
      },
      {
        "id": "1362",
        "cname": "山东",
        "pid": "1",
        "childrens": [
          {
            "id": "1502",
            "cname": "滨州",
            "pid": "1362",
            "childrens": [
              {
                "id": "1503",
                "cname": "滨城区",
                "pid": "1502"
              },
              {
                "id": "1508",
                "cname": "博兴县",
                "pid": "1502"
              },
              {
                "id": "1504",
                "cname": "惠民县",
                "pid": "1502"
              },
              {
                "id": "1506",
                "cname": "无棣县",
                "pid": "1502"
              },
              {
                "id": "1505",
                "cname": "阳信县",
                "pid": "1502"
              },
              {
                "id": "1507",
                "cname": "沾化县",
                "pid": "1502"
              },
              {
                "id": "1509",
                "cname": "邹平县",
                "pid": "1502"
              },
              {
                "id": "100180",
                "cname": "其他",
                "pid": "1502"
              }
            ]
          },
          {
            "id": "1403",
            "cname": "东营",
            "pid": "1362",
            "childrens": [
              {
                "id": "1404",
                "cname": "东营区",
                "pid": "1403"
              },
              {
                "id": "1408",
                "cname": "广饶县",
                "pid": "1403"
              },
              {
                "id": "1405",
                "cname": "河口区",
                "pid": "1403"
              },
              {
                "id": "1406",
                "cname": "垦利县",
                "pid": "1403"
              },
              {
                "id": "1407",
                "cname": "利津县",
                "pid": "1403"
              },
              {
                "id": "100392",
                "cname": "其他",
                "pid": "1403"
              }
            ]
          },
          {
            "id": "1481",
            "cname": "德州",
            "pid": "1362",
            "childrens": [
              {
                "id": "1482",
                "cname": "德城区",
                "pid": "1481"
              },
              {
                "id": "1483",
                "cname": "陵县",
                "pid": "1481"
              },
              {
                "id": "1486",
                "cname": "临邑县",
                "pid": "1481"
              },
              {
                "id": "1484",
                "cname": "宁津县",
                "pid": "1481"
              },
              {
                "id": "1488",
                "cname": "平原县",
                "pid": "1481"
              },
              {
                "id": "1485",
                "cname": "庆云县",
                "pid": "1481"
              },
              {
                "id": "1487",
                "cname": "齐河县",
                "pid": "1481"
              },
              {
                "id": "1490",
                "cname": "武城县",
                "pid": "1481"
              },
              {
                "id": "1489",
                "cname": "夏津县",
                "pid": "1481"
              },
              {
                "id": "1492",
                "cname": "禹城市",
                "pid": "1481"
              },
              {
                "id": "100395",
                "cname": "其他",
                "pid": "1481"
              }
            ]
          },
          {
            "id": "1510",
            "cname": "菏泽",
            "pid": "1362",
            "childrens": [
              {
                "id": "1512",
                "cname": "曹县",
                "pid": "1510"
              },
              {
                "id": "1514",
                "cname": "成武县",
                "pid": "1510"
              },
              {
                "id": "1513",
                "cname": "单县",
                "pid": "1510"
              },
              {
                "id": "1518",
                "cname": "定陶县",
                "pid": "1510"
              },
              {
                "id": "1519",
                "cname": "东明县",
                "pid": "1510"
              },
              {
                "id": "1515",
                "cname": "巨野县",
                "pid": "1510"
              },
              {
                "id": "1517",
                "cname": "鄄城县",
                "pid": "1510"
              },
              {
                "id": "1511",
                "cname": "牡丹区",
                "pid": "1510"
              },
              {
                "id": "1516",
                "cname": "郓城县",
                "pid": "1510"
              },
              {
                "id": "100322",
                "cname": "其他",
                "pid": "1510"
              }
            ]
          },
          {
            "id": "1363",
            "cname": "济南",
            "pid": "1362",
            "childrens": [
              {
                "id": "1369",
                "cname": "长清区",
                "pid": "1363"
              },
              {
                "id": "1366",
                "cname": "槐荫区",
                "pid": "1363"
              },
              {
                "id": "1371",
                "cname": "济阳县",
                "pid": "1363"
              },
              {
                "id": "1364",
                "cname": "历下区",
                "pid": "1363"
              },
              {
                "id": "1368",
                "cname": "历城区",
                "pid": "1363"
              },
              {
                "id": "1370",
                "cname": "平阴县",
                "pid": "1363"
              },
              {
                "id": "1365",
                "cname": "市中区",
                "pid": "1363"
              },
              {
                "id": "1372",
                "cname": "商河县",
                "pid": "1363"
              },
              {
                "id": "1367",
                "cname": "天桥区",
                "pid": "1363"
              },
              {
                "id": "1373",
                "cname": "章丘市",
                "pid": "1363"
              },
              {
                "id": "100317",
                "cname": "其他",
                "pid": "1363"
              }
            ]
          },
          {
            "id": "1435",
            "cname": "济宁",
            "pid": "1362",
            "childrens": [
              {
                "id": "1440",
                "cname": "金乡县",
                "pid": "1435"
              },
              {
                "id": "1441",
                "cname": "嘉祥县",
                "pid": "1435"
              },
              {
                "id": "1444",
                "cname": "梁山县",
                "pid": "1435"
              },
              {
                "id": "1445",
                "cname": "曲阜市",
                "pid": "1435"
              },
              {
                "id": "1437",
                "cname": "任城区",
                "pid": "1435"
              },
              {
                "id": "1436",
                "cname": "市中区",
                "pid": "1435"
              },
              {
                "id": "1443",
                "cname": "泗水县",
                "pid": "1435"
              },
              {
                "id": "1438",
                "cname": "微山县",
                "pid": "1435"
              },
              {
                "id": "1442",
                "cname": "汶上县",
                "pid": "1435"
              },
              {
                "id": "1439",
                "cname": "鱼台县",
                "pid": "1435"
              },
              {
                "id": "1446",
                "cname": "兖州市",
                "pid": "1435"
              },
              {
                "id": "1447",
                "cname": "邹城市",
                "pid": "1435"
              },
              {
                "id": "100528",
                "cname": "其他",
                "pid": "1435"
              }
            ]
          },
          {
            "id": "1465",
            "cname": "莱芜",
            "pid": "1362",
            "childrens": [
              {
                "id": "1467",
                "cname": "钢城区",
                "pid": "1465"
              },
              {
                "id": "1466",
                "cname": "莱城区",
                "pid": "1465"
              },
              {
                "id": "100468",
                "cname": "其他",
                "pid": "1465"
              }
            ]
          },
          {
            "id": "1468",
            "cname": "临沂",
            "pid": "1362",
            "childrens": [
              {
                "id": "1475",
                "cname": "苍山县",
                "pid": "1468"
              },
              {
                "id": "1476",
                "cname": "费县",
                "pid": "1468"
              },
              {
                "id": "1471",
                "cname": "河东区",
                "pid": "1468"
              },
              {
                "id": "1478",
                "cname": "莒南县",
                "pid": "1468"
              },
              {
                "id": "1469",
                "cname": "兰山区",
                "pid": "1468"
              },
              {
                "id": "1470",
                "cname": "罗庄区",
                "pid": "1468"
              },
              {
                "id": "1480",
                "cname": "临沭县",
                "pid": "1468"
              },
              {
                "id": "1479",
                "cname": "蒙阴县",
                "pid": "1468"
              },
              {
                "id": "1477",
                "cname": "平邑县",
                "pid": "1468"
              },
              {
                "id": "1473",
                "cname": "郯城县",
                "pid": "1468"
              },
              {
                "id": "1472",
                "cname": "沂南县",
                "pid": "1468"
              },
              {
                "id": "1474",
                "cname": "沂水县",
                "pid": "1468"
              },
              {
                "id": "100320",
                "cname": "其他",
                "pid": "1468"
              }
            ]
          },
          {
            "id": "1493",
            "cname": "聊城",
            "pid": "1362",
            "childrens": [
              {
                "id": "1497",
                "cname": "茌平县",
                "pid": "1493"
              },
              {
                "id": "1494",
                "cname": "东昌府区",
                "pid": "1493"
              },
              {
                "id": "1498",
                "cname": "东阿县",
                "pid": "1493"
              },
              {
                "id": "1499",
                "cname": "冠县",
                "pid": "1493"
              },
              {
                "id": "1500",
                "cname": "高唐县",
                "pid": "1493"
              },
              {
                "id": "1501",
                "cname": "临清市",
                "pid": "1493"
              },
              {
                "id": "1496",
                "cname": "莘县",
                "pid": "1493"
              },
              {
                "id": "1495",
                "cname": "阳谷县",
                "pid": "1493"
              },
              {
                "id": "100321",
                "cname": "其他",
                "pid": "1493"
              }
            ]
          },
          {
            "id": "1374",
            "cname": "青岛",
            "pid": "1362",
            "childrens": [
              {
                "id": "1381",
                "cname": "城阳区",
                "pid": "1374"
              },
              {
                "id": "1378",
                "cname": "黄岛区",
                "pid": "1374"
              },
              {
                "id": "1382",
                "cname": "胶州市",
                "pid": "1374"
              },
              {
                "id": "1383",
                "cname": "即墨市",
                "pid": "1374"
              },
              {
                "id": "1385",
                "cname": "胶南市",
                "pid": "1374"
              },
              {
                "id": "1379",
                "cname": "崂山区",
                "pid": "1374"
              },
              {
                "id": "1380",
                "cname": "李沧区",
                "pid": "1374"
              },
              {
                "id": "1386",
                "cname": "莱西市",
                "pid": "1374"
              },
              {
                "id": "1384",
                "cname": "平度市",
                "pid": "1374"
              },
              {
                "id": "1375",
                "cname": "市南区",
                "pid": "1374"
              },
              {
                "id": "1376",
                "cname": "市北区",
                "pid": "1374"
              },
              {
                "id": "1377",
                "cname": "四方区",
                "pid": "1374"
              },
              {
                "id": "100318",
                "cname": "其他",
                "pid": "1374"
              }
            ]
          },
          {
            "id": "1460",
            "cname": "日照",
            "pid": "1362",
            "childrens": [
              {
                "id": "1461",
                "cname": "东港区",
                "pid": "1460"
              },
              {
                "id": "1464",
                "cname": "莒县",
                "pid": "1460"
              },
              {
                "id": "1462",
                "cname": "岚山区",
                "pid": "1460"
              },
              {
                "id": "1463",
                "cname": "五莲县",
                "pid": "1460"
              },
              {
                "id": "100394",
                "cname": "其他",
                "pid": "1460"
              }
            ]
          },
          {
            "id": "1448",
            "cname": "泰安",
            "pid": "1362",
            "childrens": [
              {
                "id": "1450",
                "cname": "岱岳区",
                "pid": "1448"
              },
              {
                "id": "1452",
                "cname": "东平县",
                "pid": "1448"
              },
              {
                "id": "1454",
                "cname": "肥城市",
                "pid": "1448"
              },
              {
                "id": "1451",
                "cname": "宁阳县",
                "pid": "1448"
              },
              {
                "id": "1449",
                "cname": "泰山区",
                "pid": "1448"
              },
              {
                "id": "1453",
                "cname": "新泰市",
                "pid": "1448"
              },
              {
                "id": "100393",
                "cname": "其他",
                "pid": "1448"
              }
            ]
          },
          {
            "id": "1422",
            "cname": "潍坊",
            "pid": "1362",
            "childrens": [
              {
                "id": "1432",
                "cname": "安丘市",
                "pid": "1422"
              },
              {
                "id": "1428",
                "cname": "昌乐县",
                "pid": "1422"
              },
              {
                "id": "1434",
                "cname": "昌邑市",
                "pid": "1422"
              },
              {
                "id": "1425",
                "cname": "坊子区",
                "pid": "1422"
              },
              {
                "id": "1433",
                "cname": "高密市",
                "pid": "1422"
              },
              {
                "id": "1424",
                "cname": "寒亭区",
                "pid": "1422"
              },
              {
                "id": "1426",
                "cname": "奎文区",
                "pid": "1422"
              },
              {
                "id": "1427",
                "cname": "临朐县",
                "pid": "1422"
              },
              {
                "id": "1429",
                "cname": "青州市",
                "pid": "1422"
              },
              {
                "id": "1431",
                "cname": "寿光市",
                "pid": "1422"
              },
              {
                "id": "1423",
                "cname": "潍城区",
                "pid": "1422"
              },
              {
                "id": "1430",
                "cname": "诸城市",
                "pid": "1422"
              },
              {
                "id": "100019",
                "cname": "其他",
                "pid": "1422"
              }
            ]
          },
          {
            "id": "1455",
            "cname": "威海",
            "pid": "1362",
            "childrens": [
              {
                "id": "1456",
                "cname": "环翠区",
                "pid": "1455"
              },
              {
                "id": "1458",
                "cname": "荣成市",
                "pid": "1455"
              },
              {
                "id": "1459",
                "cname": "乳山市",
                "pid": "1455"
              },
              {
                "id": "1457",
                "cname": "文登市",
                "pid": "1455"
              },
              {
                "id": "100505",
                "cname": "其他",
                "pid": "1455"
              }
            ]
          },
          {
            "id": "1409",
            "cname": "烟台",
            "pid": "1362",
            "childrens": [
              {
                "id": "1414",
                "cname": "长岛县",
                "pid": "1409"
              },
              {
                "id": "1411",
                "cname": "福山区",
                "pid": "1409"
              },
              {
                "id": "1421",
                "cname": "海阳市",
                "pid": "1409"
              },
              {
                "id": "1413",
                "cname": "莱山区",
                "pid": "1409"
              },
              {
                "id": "1415",
                "cname": "龙口市",
                "pid": "1409"
              },
              {
                "id": "1416",
                "cname": "莱阳市",
                "pid": "1409"
              },
              {
                "id": "1417",
                "cname": "莱州市",
                "pid": "1409"
              },
              {
                "id": "1412",
                "cname": "牟平区",
                "pid": "1409"
              },
              {
                "id": "1418",
                "cname": "蓬莱市",
                "pid": "1409"
              },
              {
                "id": "1420",
                "cname": "栖霞市",
                "pid": "1409"
              },
              {
                "id": "1410",
                "cname": "芝罘区",
                "pid": "1409"
              },
              {
                "id": "1419",
                "cname": "招远市",
                "pid": "1409"
              },
              {
                "id": "100319",
                "cname": "其他",
                "pid": "1409"
              }
            ]
          },
          {
            "id": "1387",
            "cname": "淄博",
            "pid": "1362",
            "childrens": [
              {
                "id": "1390",
                "cname": "博山区",
                "pid": "1387"
              },
              {
                "id": "1394",
                "cname": "高青县",
                "pid": "1387"
              },
              {
                "id": "1393",
                "cname": "桓台县",
                "pid": "1387"
              },
              {
                "id": "1391",
                "cname": "临淄区",
                "pid": "1387"
              },
              {
                "id": "1395",
                "cname": "沂源县",
                "pid": "1387"
              },
              {
                "id": "1388",
                "cname": "淄川区",
                "pid": "1387"
              },
              {
                "id": "1389",
                "cname": "张店区",
                "pid": "1387"
              },
              {
                "id": "1392",
                "cname": "周村区",
                "pid": "1387"
              },
              {
                "id": "100179",
                "cname": "其他",
                "pid": "1387"
              }
            ]
          },
          {
            "id": "1396",
            "cname": "枣庄",
            "pid": "1362",
            "childrens": [
              {
                "id": "1397",
                "cname": "市中区",
                "pid": "1396"
              },
              {
                "id": "1401",
                "cname": "山亭区",
                "pid": "1396"
              },
              {
                "id": "1400",
                "cname": "台儿庄区",
                "pid": "1396"
              },
              {
                "id": "1402",
                "cname": "滕州市",
                "pid": "1396"
              },
              {
                "id": "1398",
                "cname": "薛城区",
                "pid": "1396"
              },
              {
                "id": "1399",
                "cname": "峄城区",
                "pid": "1396"
              },
              {
                "id": "100564",
                "cname": "其他",
                "pid": "1396"
              }
            ]
          }
        ]
      },
      {
        "id": "2287",
        "cname": "四川",
        "pid": "1",
        "childrens": [
          {
            "id": "2439",
            "cname": "阿坝",
            "pid": "2287",
            "childrens": [
              {
                "id": "2450",
                "cname": "阿坝县",
                "pid": "2439"
              },
              {
                "id": "2447",
                "cname": "黑水县",
                "pid": "2439"
              },
              {
                "id": "2452",
                "cname": "红原县",
                "pid": "2439"
              },
              {
                "id": "2444",
                "cname": "九寨沟县",
                "pid": "2439"
              },
              {
                "id": "2445",
                "cname": "金川县",
                "pid": "2439"
              },
              {
                "id": "2441",
                "cname": "理县",
                "pid": "2439"
              },
              {
                "id": "2442",
                "cname": "茂县",
                "pid": "2439"
              },
              {
                "id": "2448",
                "cname": "马尔康县",
                "pid": "2439"
              },
              {
                "id": "2449",
                "cname": "壤塘县",
                "pid": "2439"
              },
              {
                "id": "2451",
                "cname": "若尔盖县",
                "pid": "2439"
              },
              {
                "id": "2443",
                "cname": "松潘县",
                "pid": "2439"
              },
              {
                "id": "2440",
                "cname": "汶川县",
                "pid": "2439"
              },
              {
                "id": "2446",
                "cname": "小金县",
                "pid": "2439"
              },
              {
                "id": "100028",
                "cname": "其他",
                "pid": "2439"
              }
            ]
          },
          {
            "id": "2429",
            "cname": "巴中",
            "pid": "2287",
            "childrens": [
              {
                "id": "2430",
                "cname": "巴州区",
                "pid": "2429"
              },
              {
                "id": "2432",
                "cname": "南江县",
                "pid": "2429"
              },
              {
                "id": "2433",
                "cname": "平昌县",
                "pid": "2429"
              },
              {
                "id": "2431",
                "cname": "通江县",
                "pid": "2429"
              },
              {
                "id": "100197",
                "cname": "其他",
                "pid": "2429"
              }
            ]
          },
          {
            "id": "2288",
            "cname": "成都",
            "pid": "2287",
            "childrens": [
              {
                "id": "2293",
                "cname": "成华区",
                "pid": "2288"
              },
              {
                "id": "2307",
                "cname": "崇州市",
                "pid": "2288"
              },
              {
                "id": "2301",
                "cname": "大邑县",
                "pid": "2288"
              },
              {
                "id": "2304",
                "cname": "都江堰市",
                "pid": "2288"
              },
              {
                "id": "2289",
                "cname": "锦江区",
                "pid": "2288"
              },
              {
                "id": "2291",
                "cname": "金牛区",
                "pid": "2288"
              },
              {
                "id": "2298",
                "cname": "金堂县",
                "pid": "2288"
              },
              {
                "id": "2294",
                "cname": "龙泉驿区",
                "pid": "2288"
              },
              {
                "id": "2300",
                "cname": "郫县",
                "pid": "2288"
              },
              {
                "id": "2302",
                "cname": "蒲江县",
                "pid": "2288"
              },
              {
                "id": "2305",
                "cname": "彭州市",
                "pid": "2288"
              },
              {
                "id": "2290",
                "cname": "青羊区",
                "pid": "2288"
              },
              {
                "id": "2295",
                "cname": "青白江区",
                "pid": "2288"
              },
              {
                "id": "2306",
                "cname": "邛崃市",
                "pid": "2288"
              },
              {
                "id": "2299",
                "cname": "双流县",
                "pid": "2288"
              },
              {
                "id": "2292",
                "cname": "武侯区",
                "pid": "2288"
              },
              {
                "id": "2297",
                "cname": "温江区",
                "pid": "2288"
              },
              {
                "id": "2296",
                "cname": "新都区",
                "pid": "2288"
              },
              {
                "id": "2303",
                "cname": "新津县",
                "pid": "2288"
              },
              {
                "id": "100342",
                "cname": "其他",
                "pid": "2288"
              }
            ]
          },
          {
            "id": "2329",
            "cname": "德阳",
            "pid": "2287",
            "childrens": [
              {
                "id": "2333",
                "cname": "广汉市",
                "pid": "2329"
              },
              {
                "id": "2330",
                "cname": "旌阳区",
                "pid": "2329"
              },
              {
                "id": "2332",
                "cname": "罗江县",
                "pid": "2329"
              },
              {
                "id": "2335",
                "cname": "绵竹市",
                "pid": "2329"
              },
              {
                "id": "2334",
                "cname": "什邡市",
                "pid": "2329"
              },
              {
                "id": "2331",
                "cname": "中江县",
                "pid": "2329"
              },
              {
                "id": "100475",
                "cname": "其他",
                "pid": "2329"
              }
            ]
          },
          {
            "id": "2412",
            "cname": "达州",
            "pid": "2287",
            "childrens": [
              {
                "id": "2414",
                "cname": "达县",
                "pid": "2412"
              },
              {
                "id": "2417",
                "cname": "大竹县",
                "pid": "2412"
              },
              {
                "id": "2416",
                "cname": "开江县",
                "pid": "2412"
              },
              {
                "id": "2418",
                "cname": "渠县",
                "pid": "2412"
              },
              {
                "id": "2413",
                "cname": "通川区",
                "pid": "2412"
              },
              {
                "id": "2419",
                "cname": "万源市",
                "pid": "2412"
              },
              {
                "id": "2415",
                "cname": "宣汉县",
                "pid": "2412"
              },
              {
                "id": "100416",
                "cname": "其他",
                "pid": "2412"
              }
            ]
          },
          {
            "id": "2346",
            "cname": "广元",
            "pid": "2287",
            "childrens": [
              {
                "id": "2353",
                "cname": "苍溪县",
                "pid": "2346"
              },
              {
                "id": "2352",
                "cname": "剑阁县",
                "pid": "2346"
              },
              {
                "id": "2351",
                "cname": "青川县",
                "pid": "2346"
              },
              {
                "id": "2347",
                "cname": "市中区",
                "pid": "2346"
              },
              {
                "id": "2350",
                "cname": "旺苍县",
                "pid": "2346"
              },
              {
                "id": "2348",
                "cname": "元坝区",
                "pid": "2346"
              },
              {
                "id": "2349",
                "cname": "朝天区",
                "pid": "2346"
              },
              {
                "id": "100343",
                "cname": "其他",
                "pid": "2346"
              }
            ]
          },
          {
            "id": "2406",
            "cname": "广安",
            "pid": "2287",
            "childrens": [
              {
                "id": "2407",
                "cname": "广安区",
                "pid": "2406"
              },
              {
                "id": "2411",
                "cname": "华蓥市",
                "pid": "2406"
              },
              {
                "id": "2410",
                "cname": "邻水县",
                "pid": "2406"
              },
              {
                "id": "2409",
                "cname": "武胜县",
                "pid": "2406"
              },
              {
                "id": "2408",
                "cname": "岳池县",
                "pid": "2406"
              },
              {
                "id": "100477",
                "cname": "其他",
                "pid": "2406"
              }
            ]
          },
          {
            "id": "2453",
            "cname": "甘孜",
            "pid": "2287",
            "childrens": [
              {
                "id": "2464",
                "cname": "白玉县",
                "pid": "2453"
              },
              {
                "id": "2468",
                "cname": "巴塘县",
                "pid": "2453"
              },
              {
                "id": "2456",
                "cname": "丹巴县",
                "pid": "2453"
              },
              {
                "id": "2459",
                "cname": "道孚县",
                "pid": "2453"
              },
              {
                "id": "2463",
                "cname": "德格县",
                "pid": "2453"
              },
              {
                "id": "2470",
                "cname": "稻城县",
                "pid": "2453"
              },
              {
                "id": "2471",
                "cname": "得荣县",
                "pid": "2453"
              },
              {
                "id": "2461",
                "cname": "甘孜县",
                "pid": "2453"
              },
              {
                "id": "2457",
                "cname": "九龙县",
                "pid": "2453"
              },
              {
                "id": "2454",
                "cname": "康定县",
                "pid": "2453"
              },
              {
                "id": "2455",
                "cname": "泸定县",
                "pid": "2453"
              },
              {
                "id": "2460",
                "cname": "炉霍县",
                "pid": "2453"
              },
              {
                "id": "2467",
                "cname": "理塘县",
                "pid": "2453"
              },
              {
                "id": "2465",
                "cname": "石渠县",
                "pid": "2453"
              },
              {
                "id": "2466",
                "cname": "色达县",
                "pid": "2453"
              },
              {
                "id": "2462",
                "cname": "新龙县",
                "pid": "2453"
              },
              {
                "id": "2469",
                "cname": "乡城县",
                "pid": "2453"
              },
              {
                "id": "2458",
                "cname": "雅江县",
                "pid": "2453"
              },
              {
                "id": "100198",
                "cname": "其他",
                "pid": "2453"
              }
            ]
          },
          {
            "id": "2321",
            "cname": "泸州",
            "pid": "2287",
            "childrens": [
              {
                "id": "2328",
                "cname": "古蔺县",
                "pid": "2321"
              },
              {
                "id": "2326",
                "cname": "合江县",
                "pid": "2321"
              },
              {
                "id": "2322",
                "cname": "江阳区",
                "pid": "2321"
              },
              {
                "id": "2324",
                "cname": "龙马潭区",
                "pid": "2321"
              },
              {
                "id": "2325",
                "cname": "泸县",
                "pid": "2321"
              },
              {
                "id": "2323",
                "cname": "纳溪区",
                "pid": "2321"
              },
              {
                "id": "2327",
                "cname": "叙永县",
                "pid": "2321"
              },
              {
                "id": "100474",
                "cname": "其他",
                "pid": "2321"
              }
            ]
          },
          {
            "id": "2366",
            "cname": "乐山",
            "pid": "2287",
            "childrens": [
              {
                "id": "2375",
                "cname": "峨边彝族自治县",
                "pid": "2366"
              },
              {
                "id": "2377",
                "cname": "峨眉山市",
                "pid": "2366"
              },
              {
                "id": "2370",
                "cname": "金口河区",
                "pid": "2366"
              },
              {
                "id": "2371",
                "cname": "犍为县",
                "pid": "2366"
              },
              {
                "id": "2372",
                "cname": "井研县",
                "pid": "2366"
              },
              {
                "id": "2373",
                "cname": "夹江县",
                "pid": "2366"
              },
              {
                "id": "2374",
                "cname": "沐川县",
                "pid": "2366"
              },
              {
                "id": "2376",
                "cname": "马边彝族自治县",
                "pid": "2366"
              },
              {
                "id": "2367",
                "cname": "市中区",
                "pid": "2366"
              },
              {
                "id": "2368",
                "cname": "沙湾区",
                "pid": "2366"
              },
              {
                "id": "2369",
                "cname": "五通桥区",
                "pid": "2366"
              },
              {
                "id": "100440",
                "cname": "其他",
                "pid": "2366"
              }
            ]
          },
          {
            "id": "2472",
            "cname": "凉山",
            "pid": "2287",
            "childrens": [
              {
                "id": "2481",
                "cname": "布拖县",
                "pid": "2472"
              },
              {
                "id": "2476",
                "cname": "德昌县",
                "pid": "2472"
              },
              {
                "id": "2487",
                "cname": "甘洛县",
                "pid": "2472"
              },
              {
                "id": "2477",
                "cname": "会理县",
                "pid": "2472"
              },
              {
                "id": "2478",
                "cname": "会东县",
                "pid": "2472"
              },
              {
                "id": "2482",
                "cname": "金阳县",
                "pid": "2472"
              },
              {
                "id": "2489",
                "cname": "雷波县",
                "pid": "2472"
              },
              {
                "id": "2474",
                "cname": "木里藏族自治县",
                "pid": "2472"
              },
              {
                "id": "2485",
                "cname": "冕宁县",
                "pid": "2472"
              },
              {
                "id": "2488",
                "cname": "美姑县",
                "pid": "2472"
              },
              {
                "id": "2479",
                "cname": "宁南县",
                "pid": "2472"
              },
              {
                "id": "2480",
                "cname": "普格县",
                "pid": "2472"
              },
              {
                "id": "2473",
                "cname": "西昌市",
                "pid": "2472"
              },
              {
                "id": "2484",
                "cname": "喜德县",
                "pid": "2472"
              },
              {
                "id": "2475",
                "cname": "盐源县",
                "pid": "2472"
              },
              {
                "id": "2486",
                "cname": "越西县",
                "pid": "2472"
              },
              {
                "id": "2483",
                "cname": "昭觉县",
                "pid": "2472"
              },
              {
                "id": "100199",
                "cname": "其他",
                "pid": "2472"
              }
            ]
          },
          {
            "id": "2336",
            "cname": "绵阳",
            "pid": "2287",
            "childrens": [
              {
                "id": "2341",
                "cname": "安县",
                "pid": "2336"
              },
              {
                "id": "2343",
                "cname": "北川羌族自治县",
                "pid": "2336"
              },
              {
                "id": "2337",
                "cname": "涪城区",
                "pid": "2336"
              },
              {
                "id": "2345",
                "cname": "江油市",
                "pid": "2336"
              },
              {
                "id": "2344",
                "cname": "平武县",
                "pid": "2336"
              },
              {
                "id": "2339",
                "cname": "三台县",
                "pid": "2336"
              },
              {
                "id": "2338",
                "cname": "游仙区",
                "pid": "2336"
              },
              {
                "id": "2340",
                "cname": "盐亭县",
                "pid": "2336"
              },
              {
                "id": "2342",
                "cname": "梓潼县",
                "pid": "2336"
              },
              {
                "id": "100025",
                "cname": "其他",
                "pid": "2336"
              }
            ]
          },
          {
            "id": "2388",
            "cname": "眉山",
            "pid": "2287",
            "childrens": [
              {
                "id": "2389",
                "cname": "东坡区",
                "pid": "2388"
              },
              {
                "id": "2393",
                "cname": "丹棱县",
                "pid": "2388"
              },
              {
                "id": "2392",
                "cname": "洪雅县",
                "pid": "2388"
              },
              {
                "id": "2391",
                "cname": "彭山县",
                "pid": "2388"
              },
              {
                "id": "2394",
                "cname": "青神县",
                "pid": "2388"
              },
              {
                "id": "2390",
                "cname": "仁寿县",
                "pid": "2388"
              },
              {
                "id": "100415",
                "cname": "其他",
                "pid": "2388"
              }
            ]
          },
          {
            "id": "2360",
            "cname": "内江",
            "pid": "2287",
            "childrens": [
              {
                "id": "2362",
                "cname": "东兴区",
                "pid": "2360"
              },
              {
                "id": "2365",
                "cname": "隆昌县",
                "pid": "2360"
              },
              {
                "id": "2361",
                "cname": "市中区",
                "pid": "2360"
              },
              {
                "id": "2363",
                "cname": "威远县",
                "pid": "2360"
              },
              {
                "id": "2364",
                "cname": "资中县",
                "pid": "2360"
              },
              {
                "id": "100414",
                "cname": "其他",
                "pid": "2360"
              }
            ]
          },
          {
            "id": "2378",
            "cname": "南充",
            "pid": "2287",
            "childrens": [
              {
                "id": "2380",
                "cname": "高坪区",
                "pid": "2378"
              },
              {
                "id": "2381",
                "cname": "嘉陵区",
                "pid": "2378"
              },
              {
                "id": "2387",
                "cname": "阆中市",
                "pid": "2378"
              },
              {
                "id": "2382",
                "cname": "南部县",
                "pid": "2378"
              },
              {
                "id": "2384",
                "cname": "蓬安县",
                "pid": "2378"
              },
              {
                "id": "2379",
                "cname": "顺庆区",
                "pid": "2378"
              },
              {
                "id": "2386",
                "cname": "西充县",
                "pid": "2378"
              },
              {
                "id": "2383",
                "cname": "营山县",
                "pid": "2378"
              },
              {
                "id": "2385",
                "cname": "仪陇县",
                "pid": "2378"
              },
              {
                "id": "100476",
                "cname": "其他",
                "pid": "2378"
              }
            ]
          },
          {
            "id": "2315",
            "cname": "攀枝花",
            "pid": "2287",
            "childrens": [
              {
                "id": "2316",
                "cname": "东区",
                "pid": "2315"
              },
              {
                "id": "2319",
                "cname": "米易县",
                "pid": "2315"
              },
              {
                "id": "2318",
                "cname": "仁和区",
                "pid": "2315"
              },
              {
                "id": "2317",
                "cname": "西区",
                "pid": "2315"
              },
              {
                "id": "2320",
                "cname": "盐边县",
                "pid": "2315"
              },
              {
                "id": "100413",
                "cname": "其他",
                "pid": "2315"
              }
            ]
          },
          {
            "id": "2354",
            "cname": "遂宁",
            "pid": "2287",
            "childrens": [
              {
                "id": "2356",
                "cname": "安居区",
                "pid": "2354"
              },
              {
                "id": "2355",
                "cname": "船山区",
                "pid": "2354"
              },
              {
                "id": "2359",
                "cname": "大英县",
                "pid": "2354"
              },
              {
                "id": "2357",
                "cname": "蓬溪县",
                "pid": "2354"
              },
              {
                "id": "2358",
                "cname": "射洪县",
                "pid": "2354"
              },
              {
                "id": "100026",
                "cname": "其他",
                "pid": "2354"
              }
            ]
          },
          {
            "id": "2395",
            "cname": "宜宾",
            "pid": "2287",
            "childrens": [
              {
                "id": "2396",
                "cname": "翠屏区",
                "pid": "2395"
              },
              {
                "id": "2400",
                "cname": "长宁县",
                "pid": "2395"
              },
              {
                "id": "2401",
                "cname": "高县",
                "pid": "2395"
              },
              {
                "id": "2402",
                "cname": "珙县",
                "pid": "2395"
              },
              {
                "id": "2399",
                "cname": "江安县",
                "pid": "2395"
              },
              {
                "id": "2398",
                "cname": "南溪县",
                "pid": "2395"
              },
              {
                "id": "2405",
                "cname": "屏山县",
                "pid": "2395"
              },
              {
                "id": "2404",
                "cname": "兴文县",
                "pid": "2395"
              },
              {
                "id": "2397",
                "cname": "宜宾县",
                "pid": "2395"
              },
              {
                "id": "2403",
                "cname": "筠连县",
                "pid": "2395"
              },
              {
                "id": "100344",
                "cname": "其他",
                "pid": "2395"
              }
            ]
          },
          {
            "id": "2420",
            "cname": "雅安",
            "pid": "2287",
            "childrens": [
              {
                "id": "2428",
                "cname": "宝兴县",
                "pid": "2420"
              },
              {
                "id": "2424",
                "cname": "汉源县",
                "pid": "2420"
              },
              {
                "id": "2427",
                "cname": "芦山县",
                "pid": "2420"
              },
              {
                "id": "2422",
                "cname": "名山县",
                "pid": "2420"
              },
              {
                "id": "2425",
                "cname": "石棉县",
                "pid": "2420"
              },
              {
                "id": "2426",
                "cname": "天全县",
                "pid": "2420"
              },
              {
                "id": "2423",
                "cname": "荥经县",
                "pid": "2420"
              },
              {
                "id": "2421",
                "cname": "雨城区",
                "pid": "2420"
              },
              {
                "id": "100196",
                "cname": "其他",
                "pid": "2420"
              }
            ]
          },
          {
            "id": "2308",
            "cname": "自贡",
            "pid": "2287",
            "childrens": [
              {
                "id": "2311",
                "cname": "大安区",
                "pid": "2308"
              },
              {
                "id": "2314",
                "cname": "富顺县",
                "pid": "2308"
              },
              {
                "id": "2310",
                "cname": "贡井区",
                "pid": "2308"
              },
              {
                "id": "2313",
                "cname": "荣县",
                "pid": "2308"
              },
              {
                "id": "2312",
                "cname": "沿滩区",
                "pid": "2308"
              },
              {
                "id": "2309",
                "cname": "自流井区",
                "pid": "2308"
              },
              {
                "id": "100412",
                "cname": "其他",
                "pid": "2308"
              }
            ]
          },
          {
            "id": "2434",
            "cname": "资阳",
            "pid": "2287",
            "childrens": [
              {
                "id": "2436",
                "cname": "安岳县",
                "pid": "2434"
              },
              {
                "id": "2438",
                "cname": "简阳市",
                "pid": "2434"
              },
              {
                "id": "2437",
                "cname": "乐至县",
                "pid": "2434"
              },
              {
                "id": "2435",
                "cname": "雁江区",
                "pid": "2434"
              },
              {
                "id": "100027",
                "cname": "其他",
                "pid": "2434"
              }
            ]
          }
        ]
      },
      {
        "id": "2815",
        "cname": "陕西",
        "pid": "1",
        "childrens": [
          {
            "id": "2914",
            "cname": "安康",
            "pid": "2815",
            "childrens": [
              {
                "id": "2924",
                "cname": "白河县",
                "pid": "2914"
              },
              {
                "id": "2915",
                "cname": "汉滨区",
                "pid": "2914"
              },
              {
                "id": "2916",
                "cname": "汉阴县",
                "pid": "2914"
              },
              {
                "id": "2920",
                "cname": "岚皋县",
                "pid": "2914"
              },
              {
                "id": "2918",
                "cname": "宁陕县",
                "pid": "2914"
              },
              {
                "id": "2921",
                "cname": "平利县",
                "pid": "2914"
              },
              {
                "id": "2917",
                "cname": "石泉县",
                "pid": "2914"
              },
              {
                "id": "2923",
                "cname": "旬阳县",
                "pid": "2914"
              },
              {
                "id": "2919",
                "cname": "紫阳县",
                "pid": "2914"
              },
              {
                "id": "2922",
                "cname": "镇坪县",
                "pid": "2914"
              },
              {
                "id": "100208",
                "cname": "其他",
                "pid": "2914"
              }
            ]
          },
          {
            "id": "2835",
            "cname": "宝鸡",
            "pid": "2815",
            "childrens": [
              {
                "id": "2838",
                "cname": "陈仓区",
                "pid": "2835"
              },
              {
                "id": "2839",
                "cname": "凤翔县",
                "pid": "2835"
              },
              {
                "id": "2841",
                "cname": "扶风县",
                "pid": "2835"
              },
              {
                "id": "2846",
                "cname": "凤县",
                "pid": "2835"
              },
              {
                "id": "2837",
                "cname": "金台区",
                "pid": "2835"
              },
              {
                "id": "2843",
                "cname": "陇县",
                "pid": "2835"
              },
              {
                "id": "2845",
                "cname": "麟游县",
                "pid": "2835"
              },
              {
                "id": "2842",
                "cname": "眉县",
                "pid": "2835"
              },
              {
                "id": "2840",
                "cname": "岐山县",
                "pid": "2835"
              },
              {
                "id": "2844",
                "cname": "千阳县",
                "pid": "2835"
              },
              {
                "id": "2847",
                "cname": "太白县",
                "pid": "2835"
              },
              {
                "id": "2836",
                "cname": "渭滨区",
                "pid": "2835"
              },
              {
                "id": "100355",
                "cname": "其他",
                "pid": "2835"
              }
            ]
          },
          {
            "id": "2889",
            "cname": "汉中",
            "pid": "2815",
            "childrens": [
              {
                "id": "2892",
                "cname": "城固县",
                "pid": "2889"
              },
              {
                "id": "2900",
                "cname": "佛坪县",
                "pid": "2889"
              },
              {
                "id": "2890",
                "cname": "汉台区",
                "pid": "2889"
              },
              {
                "id": "2897",
                "cname": "略阳县",
                "pid": "2889"
              },
              {
                "id": "2899",
                "cname": "留坝县",
                "pid": "2889"
              },
              {
                "id": "2895",
                "cname": "勉县",
                "pid": "2889"
              },
              {
                "id": "2891",
                "cname": "南郑县",
                "pid": "2889"
              },
              {
                "id": "2896",
                "cname": "宁强县",
                "pid": "2889"
              },
              {
                "id": "2894",
                "cname": "西乡县",
                "pid": "2889"
              },
              {
                "id": "2893",
                "cname": "洋县",
                "pid": "2889"
              },
              {
                "id": "2898",
                "cname": "镇巴县",
                "pid": "2889"
              },
              {
                "id": "100356",
                "cname": "其他",
                "pid": "2889"
              }
            ]
          },
          {
            "id": "2925",
            "cname": "商洛",
            "pid": "2815",
            "childrens": [
              {
                "id": "2928",
                "cname": "丹凤县",
                "pid": "2925"
              },
              {
                "id": "2927",
                "cname": "洛南县",
                "pid": "2925"
              },
              {
                "id": "2926",
                "cname": "商州区",
                "pid": "2925"
              },
              {
                "id": "2929",
                "cname": "商南县",
                "pid": "2925"
              },
              {
                "id": "2930",
                "cname": "山阳县",
                "pid": "2925"
              },
              {
                "id": "2931",
                "cname": "镇安县",
                "pid": "2925"
              },
              {
                "id": "2932",
                "cname": "柞水县",
                "pid": "2925"
              },
              {
                "id": "100421",
                "cname": "其他",
                "pid": "2925"
              }
            ]
          },
          {
            "id": "2830",
            "cname": "铜川",
            "pid": "2815",
            "childrens": [
              {
                "id": "2831",
                "cname": "王益区",
                "pid": "2830"
              },
              {
                "id": "2832",
                "cname": "印台区",
                "pid": "2830"
              },
              {
                "id": "2833",
                "cname": "耀州区",
                "pid": "2830"
              },
              {
                "id": "2834",
                "cname": "宜君县",
                "pid": "2830"
              },
              {
                "id": "100568",
                "cname": "其他",
                "pid": "2830"
              }
            ]
          },
          {
            "id": "2863",
            "cname": "渭南",
            "pid": "2815",
            "childrens": [
              {
                "id": "2871",
                "cname": "白水县",
                "pid": "2863"
              },
              {
                "id": "2869",
                "cname": "澄城县",
                "pid": "2863"
              },
              {
                "id": "2867",
                "cname": "大荔县",
                "pid": "2863"
              },
              {
                "id": "2872",
                "cname": "富平县",
                "pid": "2863"
              },
              {
                "id": "2865",
                "cname": "华县",
                "pid": "2863"
              },
              {
                "id": "2868",
                "cname": "合阳县",
                "pid": "2863"
              },
              {
                "id": "2873",
                "cname": "韩城市",
                "pid": "2863"
              },
              {
                "id": "2874",
                "cname": "华阴市",
                "pid": "2863"
              },
              {
                "id": "2864",
                "cname": "临渭区",
                "pid": "2863"
              },
              {
                "id": "2870",
                "cname": "蒲城县",
                "pid": "2863"
              },
              {
                "id": "2866",
                "cname": "潼关县",
                "pid": "2863"
              },
              {
                "id": "100207",
                "cname": "其他",
                "pid": "2863"
              }
            ]
          },
          {
            "id": "2816",
            "cname": "西安",
            "pid": "2815",
            "childrens": [
              {
                "id": "2818",
                "cname": "碑林区",
                "pid": "2816"
              },
              {
                "id": "2820",
                "cname": "灞桥区",
                "pid": "2816"
              },
              {
                "id": "2825",
                "cname": "长安区",
                "pid": "2816"
              },
              {
                "id": "2829",
                "cname": "高陵县",
                "pid": "2816"
              },
              {
                "id": "2828",
                "cname": "户县",
                "pid": "2816"
              },
              {
                "id": "2819",
                "cname": "莲湖区",
                "pid": "2816"
              },
              {
                "id": "2824",
                "cname": "临潼区",
                "pid": "2816"
              },
              {
                "id": "2826",
                "cname": "蓝田县",
                "pid": "2816"
              },
              {
                "id": "2821",
                "cname": "未央区",
                "pid": "2816"
              },
              {
                "id": "2817",
                "cname": "新城区",
                "pid": "2816"
              },
              {
                "id": "2822",
                "cname": "雁塔区",
                "pid": "2816"
              },
              {
                "id": "2823",
                "cname": "阎良区",
                "pid": "2816"
              },
              {
                "id": "2827",
                "cname": "周至县",
                "pid": "2816"
              },
              {
                "id": "100205",
                "cname": "其他",
                "pid": "2816"
              }
            ]
          },
          {
            "id": "2848",
            "cname": "咸阳",
            "pid": "2815",
            "childrens": [
              {
                "id": "2857",
                "cname": "彬县",
                "pid": "2848"
              },
              {
                "id": "2858",
                "cname": "长武县",
                "pid": "2848"
              },
              {
                "id": "2860",
                "cname": "淳化县",
                "pid": "2848"
              },
              {
                "id": "2853",
                "cname": "泾阳县",
                "pid": "2848"
              },
              {
                "id": "2855",
                "cname": "礼泉县",
                "pid": "2848"
              },
              {
                "id": "2849",
                "cname": "秦都区",
                "pid": "2848"
              },
              {
                "id": "2854",
                "cname": "乾县",
                "pid": "2848"
              },
              {
                "id": "2852",
                "cname": "三原县",
                "pid": "2848"
              },
              {
                "id": "2851",
                "cname": "渭城区",
                "pid": "2848"
              },
              {
                "id": "2861",
                "cname": "武功县",
                "pid": "2848"
              },
              {
                "id": "2859",
                "cname": "旬邑县",
                "pid": "2848"
              },
              {
                "id": "2862",
                "cname": "兴平市",
                "pid": "2848"
              },
              {
                "id": "2850",
                "cname": "杨凌区",
                "pid": "2848"
              },
              {
                "id": "2856",
                "cname": "永寿县",
                "pid": "2848"
              },
              {
                "id": "100206",
                "cname": "其他",
                "pid": "2848"
              }
            ]
          },
          {
            "id": "2875",
            "cname": "延安",
            "pid": "2815",
            "childrens": [
              {
                "id": "2880",
                "cname": "安塞县",
                "pid": "2875"
              },
              {
                "id": "2876",
                "cname": "宝塔区",
                "pid": "2875"
              },
              {
                "id": "2884",
                "cname": "富县",
                "pid": "2875"
              },
              {
                "id": "2883",
                "cname": "甘泉县",
                "pid": "2875"
              },
              {
                "id": "2887",
                "cname": "黄龙县",
                "pid": "2875"
              },
              {
                "id": "2888",
                "cname": "黄陵县",
                "pid": "2875"
              },
              {
                "id": "2885",
                "cname": "洛川县",
                "pid": "2875"
              },
              {
                "id": "2882",
                "cname": "吴起县",
                "pid": "2875"
              },
              {
                "id": "2877",
                "cname": "延长县",
                "pid": "2875"
              },
              {
                "id": "2878",
                "cname": "延川县",
                "pid": "2875"
              },
              {
                "id": "2886",
                "cname": "宜川县",
                "pid": "2875"
              },
              {
                "id": "2879",
                "cname": "子长县",
                "pid": "2875"
              },
              {
                "id": "2881",
                "cname": "志丹县",
                "pid": "2875"
              },
              {
                "id": "100032",
                "cname": "其他",
                "pid": "2875"
              }
            ]
          },
          {
            "id": "2901",
            "cname": "榆林",
            "pid": "2815",
            "childrens": [
              {
                "id": "2907",
                "cname": "定边县",
                "pid": "2901"
              },
              {
                "id": "2904",
                "cname": "府谷县",
                "pid": "2901"
              },
              {
                "id": "2905",
                "cname": "横山县",
                "pid": "2901"
              },
              {
                "id": "2906",
                "cname": "靖边县",
                "pid": "2901"
              },
              {
                "id": "2909",
                "cname": "米脂县",
                "pid": "2901"
              },
              {
                "id": "2912",
                "cname": "清涧县",
                "pid": "2901"
              },
              {
                "id": "2903",
                "cname": "神木县",
                "pid": "2901"
              },
              {
                "id": "2908",
                "cname": "绥德县",
                "pid": "2901"
              },
              {
                "id": "2911",
                "cname": "吴堡县",
                "pid": "2901"
              },
              {
                "id": "2902",
                "cname": "榆阳区",
                "pid": "2901"
              },
              {
                "id": "2913",
                "cname": "子洲县",
                "pid": "2901"
              },
              {
                "id": "100420",
                "cname": "其他",
                "pid": "2901"
              }
            ]
          }
        ]
      },
      {
        "id": "20",
        "cname": "天津",
        "pid": "1",
        "childrens": [
          {
            "id": "21",
            "cname": "天津",
            "pid": "20",
            "childrens": [
              {
                "id": "28",
                "cname": "滨海新区",
                "pid": "21"
              },
              {
                "id": "32",
                "cname": "北辰",
                "pid": "21"
              },
              {
                "id": "36",
                "cname": "宝坻",
                "pid": "21"
              },
              {
                "id": "29",
                "cname": "东丽",
                "pid": "21"
              },
              {
                "id": "22",
                "cname": "和平",
                "pid": "21"
              },
              {
                "id": "23",
                "cname": "河东",
                "pid": "21"
              },
              {
                "id": "24",
                "cname": "河西",
                "pid": "21"
              },
              {
                "id": "26",
                "cname": "河北",
                "pid": "21"
              },
              {
                "id": "27",
                "cname": "红桥",
                "pid": "21"
              },
              {
                "id": "31",
                "cname": "津南",
                "pid": "21"
              },
              {
                "id": "35",
                "cname": "静海",
                "pid": "21"
              },
              {
                "id": "37",
                "cname": "蓟县",
                "pid": "21"
              },
              {
                "id": "25",
                "cname": "南开",
                "pid": "21"
              },
              {
                "id": "33",
                "cname": "宁河",
                "pid": "21"
              },
              {
                "id": "34",
                "cname": "武清",
                "pid": "21"
              },
              {
                "id": "30",
                "cname": "西青",
                "pid": "21"
              },
              {
                "id": "100154",
                "cname": "其他",
                "pid": "21"
              }
            ]
          }
        ]
      },
      {
        "id": "3229",
        "cname": "台湾",
        "pid": "1",
        "childrens": [
          {
            "id": "3231",
            "cname": "高雄市",
            "pid": "3229"
          },
          {
            "id": "3248",
            "cname": "高雄县",
            "pid": "3229"
          },
          {
            "id": "3251",
            "cname": "花莲县",
            "pid": "3229"
          },
          {
            "id": "3232",
            "cname": "基隆市",
            "pid": "3229"
          },
          {
            "id": "3236",
            "cname": "嘉义市",
            "pid": "3229"
          },
          {
            "id": "3246",
            "cname": "嘉义县",
            "pid": "3229"
          },
          {
            "id": "3241",
            "cname": "苗栗县",
            "pid": "3229"
          },
          {
            "id": "3244",
            "cname": "南投县",
            "pid": "3229"
          },
          {
            "id": "3249",
            "cname": "屏东县",
            "pid": "3229"
          },
          {
            "id": "3252",
            "cname": "澎湖县",
            "pid": "3229"
          },
          {
            "id": "3230",
            "cname": "台北市",
            "pid": "3229"
          },
          {
            "id": "3233",
            "cname": "台中市",
            "pid": "3229"
          },
          {
            "id": "3234",
            "cname": "台南市",
            "pid": "3229"
          },
          {
            "id": "3237",
            "cname": "台北县",
            "pid": "3229"
          },
          {
            "id": "3239",
            "cname": "桃园县",
            "pid": "3229"
          },
          {
            "id": "3242",
            "cname": "台中县",
            "pid": "3229"
          },
          {
            "id": "3247",
            "cname": "台南县",
            "pid": "3229"
          },
          {
            "id": "3250",
            "cname": "台东县",
            "pid": "3229"
          },
          {
            "id": "3235",
            "cname": "新竹市",
            "pid": "3229"
          },
          {
            "id": "3240",
            "cname": "新竹县",
            "pid": "3229"
          },
          {
            "id": "3238",
            "cname": "宜兰县",
            "pid": "3229"
          },
          {
            "id": "3245",
            "cname": "云林县",
            "pid": "3229"
          },
          {
            "id": "3243",
            "cname": "彰化县",
            "pid": "3229"
          },
          {
            "id": "100486",
            "cname": "其他",
            "pid": "3229"
          }
        ]
      },
      {
        "id": "2734",
        "cname": "西藏",
        "pid": "1",
        "childrens": [
          {
            "id": "2799",
            "cname": "阿里",
            "pid": "2734",
            "childrens": [
              {
                "id": "2806",
                "cname": "措勤县",
                "pid": "2799"
              },
              {
                "id": "2802",
                "cname": "噶尔县",
                "pid": "2799"
              },
              {
                "id": "2804",
                "cname": "革吉县",
                "pid": "2799"
              },
              {
                "id": "2805",
                "cname": "改则县",
                "pid": "2799"
              },
              {
                "id": "2800",
                "cname": "普兰县",
                "pid": "2799"
              },
              {
                "id": "2803",
                "cname": "日土县",
                "pid": "2799"
              },
              {
                "id": "2801",
                "cname": "札达县",
                "pid": "2799"
              },
              {
                "id": "100354",
                "cname": "其他",
                "pid": "2799"
              }
            ]
          },
          {
            "id": "2744",
            "cname": "昌都",
            "pid": "2734",
            "childrens": [
              {
                "id": "2751",
                "cname": "八宿县",
                "pid": "2744"
              },
              {
                "id": "2755",
                "cname": "边坝县",
                "pid": "2744"
              },
              {
                "id": "2745",
                "cname": "昌都县",
                "pid": "2744"
              },
              {
                "id": "2750",
                "cname": "察雅县",
                "pid": "2744"
              },
              {
                "id": "2749",
                "cname": "丁青县",
                "pid": "2744"
              },
              {
                "id": "2747",
                "cname": "贡觉县",
                "pid": "2744"
              },
              {
                "id": "2746",
                "cname": "江达县",
                "pid": "2744"
              },
              {
                "id": "2748",
                "cname": "类乌齐县",
                "pid": "2744"
              },
              {
                "id": "2754",
                "cname": "洛隆县",
                "pid": "2744"
              },
              {
                "id": "2753",
                "cname": "芒康县",
                "pid": "2744"
              },
              {
                "id": "2752",
                "cname": "左贡县",
                "pid": "2744"
              },
              {
                "id": "100203",
                "cname": "其他",
                "pid": "2744"
              }
            ]
          },
          {
            "id": "2735",
            "cname": "拉萨",
            "pid": "2734",
            "childrens": [
              {
                "id": "2736",
                "cname": "城关区",
                "pid": "2735"
              },
              {
                "id": "2738",
                "cname": "当雄县",
                "pid": "2735"
              },
              {
                "id": "2741",
                "cname": "堆龙德庆县",
                "pid": "2735"
              },
              {
                "id": "2742",
                "cname": "达孜县",
                "pid": "2735"
              },
              {
                "id": "2737",
                "cname": "林周县",
                "pid": "2735"
              },
              {
                "id": "2743",
                "cname": "墨竹工卡县",
                "pid": "2735"
              },
              {
                "id": "2739",
                "cname": "尼木县",
                "pid": "2735"
              },
              {
                "id": "2740",
                "cname": "曲水县",
                "pid": "2735"
              },
              {
                "id": "100352",
                "cname": "其他",
                "pid": "2735"
              }
            ]
          },
          {
            "id": "2807",
            "cname": "林芝",
            "pid": "2734",
            "childrens": [
              {
                "id": "2812",
                "cname": "波密县",
                "pid": "2807"
              },
              {
                "id": "2813",
                "cname": "察隅县",
                "pid": "2807"
              },
              {
                "id": "2809",
                "cname": "工布江达县",
                "pid": "2807"
              },
              {
                "id": "2808",
                "cname": "林芝县",
                "pid": "2807"
              },
              {
                "id": "2814",
                "cname": "朗县",
                "pid": "2807"
              },
              {
                "id": "2810",
                "cname": "米林县",
                "pid": "2807"
              },
              {
                "id": "2811",
                "cname": "墨脱县",
                "pid": "2807"
              },
              {
                "id": "100204",
                "cname": "其他",
                "pid": "2807"
              }
            ]
          },
          {
            "id": "2788",
            "cname": "那曲",
            "pid": "2734",
            "childrens": [
              {
                "id": "2793",
                "cname": "安多县",
                "pid": "2788"
              },
              {
                "id": "2791",
                "cname": "比如县",
                "pid": "2788"
              },
              {
                "id": "2796",
                "cname": "班戈县",
                "pid": "2788"
              },
              {
                "id": "2797",
                "cname": "巴青县",
                "pid": "2788"
              },
              {
                "id": "2790",
                "cname": "嘉黎县",
                "pid": "2788"
              },
              {
                "id": "2789",
                "cname": "那曲县",
                "pid": "2788"
              },
              {
                "id": "2792",
                "cname": "聂荣县",
                "pid": "2788"
              },
              {
                "id": "2798",
                "cname": "尼玛县",
                "pid": "2788"
              },
              {
                "id": "2794",
                "cname": "申扎县",
                "pid": "2788"
              },
              {
                "id": "2795",
                "cname": "索县",
                "pid": "2788"
              },
              {
                "id": "100031",
                "cname": "其他",
                "pid": "2788"
              }
            ]
          },
          {
            "id": "2769",
            "cname": "日喀则",
            "pid": "2734",
            "childrens": [
              {
                "id": "2776",
                "cname": "昂仁县",
                "pid": "2769"
              },
              {
                "id": "2778",
                "cname": "白朗县",
                "pid": "2769"
              },
              {
                "id": "2773",
                "cname": "定日县",
                "pid": "2769"
              },
              {
                "id": "2781",
                "cname": "定结县",
                "pid": "2769"
              },
              {
                "id": "2787",
                "cname": "岗巴县",
                "pid": "2769"
              },
              {
                "id": "2772",
                "cname": "江孜县",
                "pid": "2769"
              },
              {
                "id": "2784",
                "cname": "吉隆县",
                "pid": "2769"
              },
              {
                "id": "2780",
                "cname": "康马县",
                "pid": "2769"
              },
              {
                "id": "2775",
                "cname": "拉孜县",
                "pid": "2769"
              },
              {
                "id": "2771",
                "cname": "南木林县",
                "pid": "2769"
              },
              {
                "id": "2785",
                "cname": "聂拉木县",
                "pid": "2769"
              },
              {
                "id": "2770",
                "cname": "日喀则市",
                "pid": "2769"
              },
              {
                "id": "2779",
                "cname": "仁布县",
                "pid": "2769"
              },
              {
                "id": "2774",
                "cname": "萨迦县",
                "pid": "2769"
              },
              {
                "id": "2786",
                "cname": "萨嘎县",
                "pid": "2769"
              },
              {
                "id": "2777",
                "cname": "谢通门县",
                "pid": "2769"
              },
              {
                "id": "2783",
                "cname": "亚东县",
                "pid": "2769"
              },
              {
                "id": "2782",
                "cname": "仲巴县",
                "pid": "2769"
              },
              {
                "id": "100127",
                "cname": "其他",
                "pid": "2769"
              }
            ]
          },
          {
            "id": "2756",
            "cname": "山南",
            "pid": "2734",
            "childrens": [
              {
                "id": "2763",
                "cname": "措美县",
                "pid": "2756"
              },
              {
                "id": "2767",
                "cname": "错那县",
                "pid": "2756"
              },
              {
                "id": "2759",
                "cname": "贡嘎县",
                "pid": "2756"
              },
              {
                "id": "2765",
                "cname": "加查县",
                "pid": "2756"
              },
              {
                "id": "2764",
                "cname": "洛扎县",
                "pid": "2756"
              },
              {
                "id": "2766",
                "cname": "隆子县",
                "pid": "2756"
              },
              {
                "id": "2768",
                "cname": "浪卡子县",
                "pid": "2756"
              },
              {
                "id": "2757",
                "cname": "乃东县",
                "pid": "2756"
              },
              {
                "id": "2761",
                "cname": "琼结县",
                "pid": "2756"
              },
              {
                "id": "2762",
                "cname": "曲松县",
                "pid": "2756"
              },
              {
                "id": "2760",
                "cname": "桑日县",
                "pid": "2756"
              },
              {
                "id": "2758",
                "cname": "扎囊县",
                "pid": "2756"
              },
              {
                "id": "100353",
                "cname": "其他",
                "pid": "2756"
              }
            ]
          }
        ]
      },
      {
        "id": "3115",
        "cname": "新疆",
        "pid": "1",
        "childrens": [
          {
            "id": "3160",
            "cname": "阿克苏",
            "pid": "3115",
            "childrens": [
              {
                "id": "3161",
                "cname": "阿克苏市",
                "pid": "3160"
              },
              {
                "id": "3168",
                "cname": "阿瓦提县",
                "pid": "3160"
              },
              {
                "id": "3166",
                "cname": "拜城县",
                "pid": "3160"
              },
              {
                "id": "3163",
                "cname": "库车县",
                "pid": "3160"
              },
              {
                "id": "3169",
                "cname": "柯坪县",
                "pid": "3160"
              },
              {
                "id": "3164",
                "cname": "沙雅县",
                "pid": "3160"
              },
              {
                "id": "3162",
                "cname": "温宿县",
                "pid": "3160"
              },
              {
                "id": "3167",
                "cname": "乌什县",
                "pid": "3160"
              },
              {
                "id": "3165",
                "cname": "新和县",
                "pid": "3160"
              },
              {
                "id": "100036",
                "cname": "其他",
                "pid": "3160"
              }
            ]
          },
          {
            "id": "3216",
            "cname": "阿勒泰",
            "pid": "3115",
            "childrens": [
              {
                "id": "3217",
                "cname": "阿勒泰市",
                "pid": "3216"
              },
              {
                "id": "3218",
                "cname": "布尔津县",
                "pid": "3216"
              },
              {
                "id": "3219",
                "cname": "富蕴县",
                "pid": "3216"
              },
              {
                "id": "3220",
                "cname": "福海县",
                "pid": "3216"
              },
              {
                "id": "3221",
                "cname": "哈巴河县",
                "pid": "3216"
              },
              {
                "id": "3223",
                "cname": "吉木乃县",
                "pid": "3216"
              },
              {
                "id": "3222",
                "cname": "青河县",
                "pid": "3216"
              },
              {
                "id": "100038",
                "cname": "其他",
                "pid": "3216"
              }
            ]
          },
          {
            "id": "3225",
            "cname": "阿拉尔",
            "pid": "3115"
          },
          {
            "id": "3146",
            "cname": "博尔塔拉",
            "pid": "3115",
            "childrens": [
              {
                "id": "3147",
                "cname": "博乐市",
                "pid": "3146"
              },
              {
                "id": "3148",
                "cname": "精河县",
                "pid": "3146"
              },
              {
                "id": "3149",
                "cname": "温泉县",
                "pid": "3146"
              },
              {
                "id": "100213",
                "cname": "其他",
                "pid": "3146"
              }
            ]
          },
          {
            "id": "3150",
            "cname": "巴音郭楞",
            "pid": "3115",
            "childrens": [
              {
                "id": "3159",
                "cname": "博湖县",
                "pid": "3150"
              },
              {
                "id": "3157",
                "cname": "和静县",
                "pid": "3150"
              },
              {
                "id": "3158",
                "cname": "和硕县",
                "pid": "3150"
              },
              {
                "id": "3151",
                "cname": "库尔勒市",
                "pid": "3150"
              },
              {
                "id": "3152",
                "cname": "轮台县",
                "pid": "3150"
              },
              {
                "id": "3155",
                "cname": "且末县",
                "pid": "3150"
              },
              {
                "id": "3154",
                "cname": "若羌县",
                "pid": "3150"
              },
              {
                "id": "3153",
                "cname": "尉犁县",
                "pid": "3150"
              },
              {
                "id": "3156",
                "cname": "焉耆回族自治县",
                "pid": "3150"
              },
              {
                "id": "100214",
                "cname": "其他",
                "pid": "3150"
              }
            ]
          },
          {
            "id": "3228",
            "cname": "北屯",
            "pid": "3115"
          },
          {
            "id": "3138",
            "cname": "昌吉",
            "pid": "3115",
            "childrens": [
              {
                "id": "3139",
                "cname": "昌吉市",
                "pid": "3138"
              },
              {
                "id": "3140",
                "cname": "阜康市",
                "pid": "3138"
              },
              {
                "id": "3141",
                "cname": "呼图壁县",
                "pid": "3138"
              },
              {
                "id": "3144",
                "cname": "吉木萨尔县",
                "pid": "3138"
              },
              {
                "id": "3142",
                "cname": "玛纳斯县",
                "pid": "3138"
              },
              {
                "id": "3145",
                "cname": "木垒哈萨克自治县",
                "pid": "3138"
              },
              {
                "id": "3143",
                "cname": "奇台县",
                "pid": "3138"
              },
              {
                "id": "100361",
                "cname": "其他",
                "pid": "3138"
              }
            ]
          },
          {
            "id": "3134",
            "cname": "哈密",
            "pid": "3115",
            "childrens": [
              {
                "id": "3136",
                "cname": "巴里坤哈萨克自治县",
                "pid": "3134"
              },
              {
                "id": "3135",
                "cname": "哈密市",
                "pid": "3134"
              },
              {
                "id": "3137",
                "cname": "伊吾县",
                "pid": "3134"
              },
              {
                "id": "100212",
                "cname": "其他",
                "pid": "3134"
              }
            ]
          },
          {
            "id": "3188",
            "cname": "和田",
            "pid": "3115",
            "childrens": [
              {
                "id": "3194",
                "cname": "策勒县",
                "pid": "3188"
              },
              {
                "id": "3189",
                "cname": "和田市",
                "pid": "3188"
              },
              {
                "id": "3190",
                "cname": "和田县",
                "pid": "3188"
              },
              {
                "id": "3193",
                "cname": "洛浦县",
                "pid": "3188"
              },
              {
                "id": "3191",
                "cname": "墨玉县",
                "pid": "3188"
              },
              {
                "id": "3196",
                "cname": "民丰县",
                "pid": "3188"
              },
              {
                "id": "3192",
                "cname": "皮山县",
                "pid": "3188"
              },
              {
                "id": "3195",
                "cname": "于田县",
                "pid": "3188"
              },
              {
                "id": "100362",
                "cname": "其他",
                "pid": "3188"
              }
            ]
          },
          {
            "id": "3125",
            "cname": "克拉玛依",
            "pid": "3115",
            "childrens": [
              {
                "id": "3128",
                "cname": "白碱滩区",
                "pid": "3125"
              },
              {
                "id": "3126",
                "cname": "独山子区",
                "pid": "3125"
              },
              {
                "id": "3127",
                "cname": "克拉玛依区",
                "pid": "3125"
              },
              {
                "id": "3129",
                "cname": "乌尔禾区",
                "pid": "3125"
              },
              {
                "id": "100211",
                "cname": "其他",
                "pid": "3125"
              }
            ]
          },
          {
            "id": "3170",
            "cname": "克孜勒苏",
            "pid": "3115",
            "childrens": [
              {
                "id": "3171",
                "cname": "阿图什市",
                "pid": "3170"
              },
              {
                "id": "3172",
                "cname": "阿克陶县",
                "pid": "3170"
              },
              {
                "id": "3173",
                "cname": "阿合奇县",
                "pid": "3170"
              },
              {
                "id": "3174",
                "cname": "乌恰县",
                "pid": "3170"
              },
              {
                "id": "100037",
                "cname": "其他",
                "pid": "3170"
              }
            ]
          },
          {
            "id": "3175",
            "cname": "喀什",
            "pid": "3115",
            "childrens": [
              {
                "id": "3186",
                "cname": "巴楚县",
                "pid": "3175"
              },
              {
                "id": "3176",
                "cname": "喀什市",
                "pid": "3175"
              },
              {
                "id": "3183",
                "cname": "麦盖提县",
                "pid": "3175"
              },
              {
                "id": "3185",
                "cname": "伽师县",
                "pid": "3175"
              },
              {
                "id": "3177",
                "cname": "疏附县",
                "pid": "3175"
              },
              {
                "id": "3178",
                "cname": "疏勒县",
                "pid": "3175"
              },
              {
                "id": "3181",
                "cname": "莎车县",
                "pid": "3175"
              },
              {
                "id": "3187",
                "cname": "塔什库尔干塔吉克自治县",
                "pid": "3175"
              },
              {
                "id": "3179",
                "cname": "英吉沙县",
                "pid": "3175"
              },
              {
                "id": "3182",
                "cname": "叶城县",
                "pid": "3175"
              },
              {
                "id": "3184",
                "cname": "岳普湖县",
                "pid": "3175"
              },
              {
                "id": "3180",
                "cname": "泽普县",
                "pid": "3175"
              },
              {
                "id": "100215",
                "cname": "其他",
                "pid": "3175"
              }
            ]
          },
          {
            "id": "3224",
            "cname": "石河子",
            "pid": "3115"
          },
          {
            "id": "3130",
            "cname": "吐鲁番",
            "pid": "3115",
            "childrens": [
              {
                "id": "3132",
                "cname": "鄯善县",
                "pid": "3130"
              },
              {
                "id": "3131",
                "cname": "吐鲁番市",
                "pid": "3130"
              },
              {
                "id": "3133",
                "cname": "托克逊县",
                "pid": "3130"
              },
              {
                "id": "100566",
                "cname": "其他",
                "pid": "3130"
              }
            ]
          },
          {
            "id": "3208",
            "cname": "塔城",
            "pid": "3115",
            "childrens": [
              {
                "id": "3211",
                "cname": "额敏县",
                "pid": "3208"
              },
              {
                "id": "3215",
                "cname": "和布克赛尔蒙古自治县",
                "pid": "3208"
              },
              {
                "id": "3212",
                "cname": "沙湾县",
                "pid": "3208"
              },
              {
                "id": "3209",
                "cname": "塔城市",
                "pid": "3208"
              },
              {
                "id": "3213",
                "cname": "托里县",
                "pid": "3208"
              },
              {
                "id": "3210",
                "cname": "乌苏市",
                "pid": "3208"
              },
              {
                "id": "3214",
                "cname": "裕民县",
                "pid": "3208"
              },
              {
                "id": "100441",
                "cname": "其他",
                "pid": "3208"
              }
            ]
          },
          {
            "id": "3226",
            "cname": "图木舒克",
            "pid": "3115"
          },
          {
            "id": "3116",
            "cname": "乌鲁木齐",
            "pid": "3115",
            "childrens": [
              {
                "id": "3122",
                "cname": "达坂城区",
                "pid": "3116"
              },
              {
                "id": "3123",
                "cname": "米东区",
                "pid": "3116"
              },
              {
                "id": "3118",
                "cname": "沙依巴克区",
                "pid": "3116"
              },
              {
                "id": "3120",
                "cname": "水磨沟区",
                "pid": "3116"
              },
              {
                "id": "3117",
                "cname": "天山区",
                "pid": "3116"
              },
              {
                "id": "3121",
                "cname": "头屯河区",
                "pid": "3116"
              },
              {
                "id": "3124",
                "cname": "乌鲁木齐县",
                "pid": "3116"
              },
              {
                "id": "3119",
                "cname": "新市区",
                "pid": "3116"
              },
              {
                "id": "100426",
                "cname": "其他",
                "pid": "3116"
              }
            ]
          },
          {
            "id": "3227",
            "cname": "五家渠",
            "pid": "3115"
          },
          {
            "id": "3197",
            "cname": "伊犁",
            "pid": "3115",
            "childrens": [
              {
                "id": "3201",
                "cname": "察布查尔锡伯自治县",
                "pid": "3197"
              },
              {
                "id": "3203",
                "cname": "巩留县",
                "pid": "3197"
              },
              {
                "id": "3202",
                "cname": "霍城县",
                "pid": "3197"
              },
              {
                "id": "3199",
                "cname": "奎屯市",
                "pid": "3197"
              },
              {
                "id": "3207",
                "cname": "尼勒克县",
                "pid": "3197"
              },
              {
                "id": "3206",
                "cname": "特克斯县",
                "pid": "3197"
              },
              {
                "id": "3204",
                "cname": "新源县",
                "pid": "3197"
              },
              {
                "id": "3198",
                "cname": "伊宁市",
                "pid": "3197"
              },
              {
                "id": "3200",
                "cname": "伊宁县",
                "pid": "3197"
              },
              {
                "id": "3205",
                "cname": "昭苏县",
                "pid": "3197"
              },
              {
                "id": "100363",
                "cname": "其他",
                "pid": "3197"
              }
            ]
          },
          {
            "id": "100039",
            "cname": "其他",
            "pid": "3115"
          }
        ]
      },
      {
        "id": "3253",
        "cname": "香港",
        "pid": "1",
        "childrens": [
          {
            "id": "3265",
            "cname": "北区",
            "pid": "3253"
          },
          {
            "id": "3255",
            "cname": "东区",
            "pid": "3253"
          },
          {
            "id": "3269",
            "cname": "大埔区",
            "pid": "3253"
          },
          {
            "id": "3257",
            "cname": "观塘区",
            "pid": "3253"
          },
          {
            "id": "3260",
            "cname": "黄大仙区",
            "pid": "3253"
          },
          {
            "id": "3256",
            "cname": "九龙城区",
            "pid": "3253"
          },
          {
            "id": "3264",
            "cname": "葵青区",
            "pid": "3253"
          },
          {
            "id": "3263",
            "cname": "离岛区",
            "pid": "3253"
          },
          {
            "id": "3258",
            "cname": "南区",
            "pid": "3253"
          },
          {
            "id": "3270",
            "cname": "荃湾区",
            "pid": "3253"
          },
          {
            "id": "3259",
            "cname": "深水埗区",
            "pid": "3253"
          },
          {
            "id": "3267",
            "cname": "沙田区",
            "pid": "3253"
          },
          {
            "id": "3268",
            "cname": "屯门区",
            "pid": "3253"
          },
          {
            "id": "3261",
            "cname": "湾仔区",
            "pid": "3253"
          },
          {
            "id": "3266",
            "cname": "西贡区",
            "pid": "3253"
          },
          {
            "id": "3262",
            "cname": "油尖旺区",
            "pid": "3253"
          },
          {
            "id": "3271",
            "cname": "元朗区",
            "pid": "3253"
          },
          {
            "id": "3254",
            "cname": "中西区",
            "pid": "3253"
          },
          {
            "id": "100216",
            "cname": "其他",
            "pid": "3253"
          }
        ]
      },
      {
        "id": "2588",
        "cname": "云南",
        "pid": "1",
        "childrens": [
          {
            "id": "2624",
            "cname": "保山",
            "pid": "2588",
            "childrens": [
              {
                "id": "2629",
                "cname": "昌宁县",
                "pid": "2624"
              },
              {
                "id": "2625",
                "cname": "隆阳区",
                "pid": "2624"
              },
              {
                "id": "2628",
                "cname": "龙陵县",
                "pid": "2624"
              },
              {
                "id": "2626",
                "cname": "施甸县",
                "pid": "2624"
              },
              {
                "id": "2627",
                "cname": "腾冲县",
                "pid": "2624"
              },
              {
                "id": "100349",
                "cname": "其他",
                "pid": "2624"
              }
            ]
          },
          {
            "id": "2668",
            "cname": "楚雄",
            "pid": "2588",
            "childrens": [
              {
                "id": "2669",
                "cname": "楚雄市",
                "pid": "2668"
              },
              {
                "id": "2674",
                "cname": "大姚县",
                "pid": "2668"
              },
              {
                "id": "2678",
                "cname": "禄丰县",
                "pid": "2668"
              },
              {
                "id": "2671",
                "cname": "牟定县",
                "pid": "2668"
              },
              {
                "id": "2672",
                "cname": "南华县",
                "pid": "2668"
              },
              {
                "id": "2670",
                "cname": "双柏县",
                "pid": "2668"
              },
              {
                "id": "2677",
                "cname": "武定县",
                "pid": "2668"
              },
              {
                "id": "2673",
                "cname": "姚安县",
                "pid": "2668"
              },
              {
                "id": "2675",
                "cname": "永仁县",
                "pid": "2668"
              },
              {
                "id": "2676",
                "cname": "元谋县",
                "pid": "2668"
              },
              {
                "id": "100351",
                "cname": "其他",
                "pid": "2668"
              }
            ]
          },
          {
            "id": "2706",
            "cname": "大理",
            "pid": "2588",
            "childrens": [
              {
                "id": "2710",
                "cname": "宾川县",
                "pid": "2706"
              },
              {
                "id": "2707",
                "cname": "大理市",
                "pid": "2706"
              },
              {
                "id": "2716",
                "cname": "洱源县",
                "pid": "2706"
              },
              {
                "id": "2718",
                "cname": "鹤庆县",
                "pid": "2706"
              },
              {
                "id": "2717",
                "cname": "剑川县",
                "pid": "2706"
              },
              {
                "id": "2711",
                "cname": "弥渡县",
                "pid": "2706"
              },
              {
                "id": "2712",
                "cname": "南涧彝族自治县",
                "pid": "2706"
              },
              {
                "id": "2713",
                "cname": "巍山彝族回族自治县",
                "pid": "2706"
              },
              {
                "id": "2709",
                "cname": "祥云县",
                "pid": "2706"
              },
              {
                "id": "2708",
                "cname": "漾濞彝族自治县",
                "pid": "2706"
              },
              {
                "id": "2714",
                "cname": "永平县",
                "pid": "2706"
              },
              {
                "id": "2715",
                "cname": "云龙县",
                "pid": "2706"
              },
              {
                "id": "100202",
                "cname": "其他",
                "pid": "2706"
              }
            ]
          },
          {
            "id": "2719",
            "cname": "德宏",
            "pid": "2588",
            "childrens": [
              {
                "id": "2721",
                "cname": "潞西市",
                "pid": "2719"
              },
              {
                "id": "2722",
                "cname": "梁河县",
                "pid": "2719"
              },
              {
                "id": "2724",
                "cname": "陇川县",
                "pid": "2719"
              },
              {
                "id": "2720",
                "cname": "瑞丽市",
                "pid": "2719"
              },
              {
                "id": "2723",
                "cname": "盈江县",
                "pid": "2719"
              },
              {
                "id": "100552",
                "cname": "其他",
                "pid": "2719"
              }
            ]
          },
          {
            "id": "2730",
            "cname": "迪庆",
            "pid": "2588",
            "childrens": [
              {
                "id": "2732",
                "cname": "德钦县",
                "pid": "2730"
              },
              {
                "id": "2733",
                "cname": "维西傈僳族自治县",
                "pid": "2730"
              },
              {
                "id": "2731",
                "cname": "香格里拉县",
                "pid": "2730"
              },
              {
                "id": "100419",
                "cname": "其他",
                "pid": "2730"
              }
            ]
          },
          {
            "id": "2679",
            "cname": "红河",
            "pid": "2588",
            "childrens": [
              {
                "id": "2680",
                "cname": "个旧市",
                "pid": "2679"
              },
              {
                "id": "2689",
                "cname": "红河县",
                "pid": "2679"
              },
              {
                "id": "2692",
                "cname": "河口瑶族自治县",
                "pid": "2679"
              },
              {
                "id": "2684",
                "cname": "建水县",
                "pid": "2679"
              },
              {
                "id": "2690",
                "cname": "金平苗族瑶族傣族自治县",
                "pid": "2679"
              },
              {
                "id": "2681",
                "cname": "开远市",
                "pid": "2679"
              },
              {
                "id": "2687",
                "cname": "泸西县",
                "pid": "2679"
              },
              {
                "id": "2691",
                "cname": "绿春县",
                "pid": "2679"
              },
              {
                "id": "2682",
                "cname": "蒙自县",
                "pid": "2679"
              },
              {
                "id": "2686",
                "cname": "弥勒县",
                "pid": "2679"
              },
              {
                "id": "2683",
                "cname": "屏边苗族自治县",
                "pid": "2679"
              },
              {
                "id": "2685",
                "cname": "石屏县",
                "pid": "2679"
              },
              {
                "id": "2688",
                "cname": "元阳县",
                "pid": "2679"
              },
              {
                "id": "100480",
                "cname": "其他",
                "pid": "2679"
              }
            ]
          },
          {
            "id": "2589",
            "cname": "昆明",
            "pid": "2588",
            "childrens": [
              {
                "id": "2603",
                "cname": "安宁市",
                "pid": "2589"
              },
              {
                "id": "2595",
                "cname": "呈贡县",
                "pid": "2589"
              },
              {
                "id": "2594",
                "cname": "东川区",
                "pid": "2589"
              },
              {
                "id": "2597",
                "cname": "富民县",
                "pid": "2589"
              },
              {
                "id": "2592",
                "cname": "官渡区",
                "pid": "2589"
              },
              {
                "id": "2596",
                "cname": "晋宁县",
                "pid": "2589"
              },
              {
                "id": "2601",
                "cname": "禄劝彝族苗族自治县",
                "pid": "2589"
              },
              {
                "id": "2591",
                "cname": "盘龙区",
                "pid": "2589"
              },
              {
                "id": "2599",
                "cname": "石林彝族自治县",
                "pid": "2589"
              },
              {
                "id": "2600",
                "cname": "嵩明县",
                "pid": "2589"
              },
              {
                "id": "2590",
                "cname": "五华区",
                "pid": "2589"
              },
              {
                "id": "2593",
                "cname": "西山区",
                "pid": "2589"
              },
              {
                "id": "2602",
                "cname": "寻甸回族彝族自治县",
                "pid": "2589"
              },
              {
                "id": "2598",
                "cname": "宜良县",
                "pid": "2589"
              },
              {
                "id": "100030",
                "cname": "其他",
                "pid": "2589"
              }
            ]
          },
          {
            "id": "2642",
            "cname": "丽江",
            "pid": "2588",
            "childrens": [
              {
                "id": "2643",
                "cname": "古城区",
                "pid": "2642"
              },
              {
                "id": "2646",
                "cname": "华坪县",
                "pid": "2642"
              },
              {
                "id": "2647",
                "cname": "宁蒗彝族自治县",
                "pid": "2642"
              },
              {
                "id": "2644",
                "cname": "玉龙纳西族自治县",
                "pid": "2642"
              },
              {
                "id": "2645",
                "cname": "永胜县",
                "pid": "2642"
              },
              {
                "id": "100479",
                "cname": "其他",
                "pid": "2642"
              }
            ]
          },
          {
            "id": "2659",
            "cname": "临沧",
            "pid": "2588",
            "childrens": [
              {
                "id": "2667",
                "cname": "沧源佤族自治县",
                "pid": "2659"
              },
              {
                "id": "2661",
                "cname": "凤庆县",
                "pid": "2659"
              },
              {
                "id": "2666",
                "cname": "耿马傣族佤族自治县",
                "pid": "2659"
              },
              {
                "id": "2660",
                "cname": "临翔区",
                "pid": "2659"
              },
              {
                "id": "2665",
                "cname": "双江拉祜族佤族布朗族傣族自治县",
                "pid": "2659"
              },
              {
                "id": "2662",
                "cname": "云县",
                "pid": "2659"
              },
              {
                "id": "2663",
                "cname": "永德县",
                "pid": "2659"
              },
              {
                "id": "2664",
                "cname": "镇康县",
                "pid": "2659"
              },
              {
                "id": "100350",
                "cname": "其他",
                "pid": "2659"
              }
            ]
          },
          {
            "id": "2725",
            "cname": "怒江",
            "pid": "2588",
            "childrens": [
              {
                "id": "2727",
                "cname": "福贡县",
                "pid": "2725"
              },
              {
                "id": "2728",
                "cname": "贡山独龙族怒族自治县",
                "pid": "2725"
              },
              {
                "id": "2726",
                "cname": "泸水县",
                "pid": "2725"
              },
              {
                "id": "2729",
                "cname": "兰坪白族普米族自治县",
                "pid": "2725"
              },
              {
                "id": "100456",
                "cname": "其他",
                "pid": "2725"
              }
            ]
          },
          {
            "id": "2648",
            "cname": "普洱",
            "pid": "2588",
            "childrens": [
              {
                "id": "2652",
                "cname": "景东彝族自治县",
                "pid": "2648"
              },
              {
                "id": "2653",
                "cname": "景谷傣族彝族自治县",
                "pid": "2648"
              },
              {
                "id": "2655",
                "cname": "江城哈尼族彝族自治县",
                "pid": "2648"
              },
              {
                "id": "2657",
                "cname": "澜沧拉祜族自治县",
                "pid": "2648"
              },
              {
                "id": "2651",
                "cname": "墨江哈尼族自治县",
                "pid": "2648"
              },
              {
                "id": "2656",
                "cname": "孟连傣族拉祜族佤族自治县",
                "pid": "2648"
              },
              {
                "id": "2650",
                "cname": "宁洱哈尼族彝族自治县",
                "pid": "2648"
              },
              {
                "id": "2649",
                "cname": "思茅区",
                "pid": "2648"
              },
              {
                "id": "2658",
                "cname": "西盟佤族自治县",
                "pid": "2648"
              },
              {
                "id": "2654",
                "cname": "镇沅彝族哈尼族拉祜族自治县",
                "pid": "2648"
              },
              {
                "id": "100531",
                "cname": "其他",
                "pid": "2648"
              }
            ]
          },
          {
            "id": "2604",
            "cname": "曲靖",
            "pid": "2588",
            "childrens": [
              {
                "id": "2610",
                "cname": "富源县",
                "pid": "2604"
              },
              {
                "id": "2611",
                "cname": "会泽县",
                "pid": "2604"
              },
              {
                "id": "2607",
                "cname": "陆良县",
                "pid": "2604"
              },
              {
                "id": "2609",
                "cname": "罗平县",
                "pid": "2604"
              },
              {
                "id": "2606",
                "cname": "马龙县",
                "pid": "2604"
              },
              {
                "id": "2605",
                "cname": "麒麟区",
                "pid": "2604"
              },
              {
                "id": "2608",
                "cname": "师宗县",
                "pid": "2604"
              },
              {
                "id": "2613",
                "cname": "宣威市",
                "pid": "2604"
              },
              {
                "id": "2612",
                "cname": "沾益县",
                "pid": "2604"
              },
              {
                "id": "100454",
                "cname": "其他",
                "pid": "2604"
              }
            ]
          },
          {
            "id": "2693",
            "cname": "文山",
            "pid": "2588",
            "childrens": [
              {
                "id": "2701",
                "cname": "富宁县",
                "pid": "2693"
              },
              {
                "id": "2700",
                "cname": "广南县",
                "pid": "2693"
              },
              {
                "id": "2697",
                "cname": "麻栗坡县",
                "pid": "2693"
              },
              {
                "id": "2698",
                "cname": "马关县",
                "pid": "2693"
              },
              {
                "id": "2699",
                "cname": "丘北县",
                "pid": "2693"
              },
              {
                "id": "2694",
                "cname": "文山县",
                "pid": "2693"
              },
              {
                "id": "2696",
                "cname": "西畴县",
                "pid": "2693"
              },
              {
                "id": "2695",
                "cname": "砚山县",
                "pid": "2693"
              },
              {
                "id": "100455",
                "cname": "其他",
                "pid": "2693"
              }
            ]
          },
          {
            "id": "2702",
            "cname": "西双版纳",
            "pid": "2588",
            "childrens": [
              {
                "id": "2703",
                "cname": "景洪市",
                "pid": "2702"
              },
              {
                "id": "2704",
                "cname": "勐海县",
                "pid": "2702"
              },
              {
                "id": "2705",
                "cname": "勐腊县",
                "pid": "2702"
              },
              {
                "id": "100532",
                "cname": "其他",
                "pid": "2702"
              }
            ]
          },
          {
            "id": "2614",
            "cname": "玉溪",
            "pid": "2588",
            "childrens": [
              {
                "id": "2617",
                "cname": "澄江县",
                "pid": "2614"
              },
              {
                "id": "2621",
                "cname": "峨山彝族自治县",
                "pid": "2614"
              },
              {
                "id": "2615",
                "cname": "红塔区",
                "pid": "2614"
              },
              {
                "id": "2619",
                "cname": "华宁县",
                "pid": "2614"
              },
              {
                "id": "2616",
                "cname": "江川县",
                "pid": "2614"
              },
              {
                "id": "2618",
                "cname": "通海县",
                "pid": "2614"
              },
              {
                "id": "2622",
                "cname": "新平彝族傣族自治县",
                "pid": "2614"
              },
              {
                "id": "2620",
                "cname": "易门县",
                "pid": "2614"
              },
              {
                "id": "2623",
                "cname": "元江哈尼族彝族傣族自治县",
                "pid": "2614"
              },
              {
                "id": "100348",
                "cname": "其他",
                "pid": "2614"
              }
            ]
          },
          {
            "id": "2630",
            "cname": "昭通",
            "pid": "2588",
            "childrens": [
              {
                "id": "2635",
                "cname": "大关县",
                "pid": "2630"
              },
              {
                "id": "2632",
                "cname": "鲁甸县",
                "pid": "2630"
              },
              {
                "id": "2633",
                "cname": "巧家县",
                "pid": "2630"
              },
              {
                "id": "2637",
                "cname": "绥江县",
                "pid": "2630"
              },
              {
                "id": "2641",
                "cname": "水富县",
                "pid": "2630"
              },
              {
                "id": "2640",
                "cname": "威信县",
                "pid": "2630"
              },
              {
                "id": "2634",
                "cname": "盐津县",
                "pid": "2630"
              },
              {
                "id": "2636",
                "cname": "永善县",
                "pid": "2630"
              },
              {
                "id": "2639",
                "cname": "彝良县",
                "pid": "2630"
              },
              {
                "id": "2631",
                "cname": "昭阳区",
                "pid": "2630"
              },
              {
                "id": "2638",
                "cname": "镇雄县",
                "pid": "2630"
              },
              {
                "id": "100418",
                "cname": "其他",
                "pid": "2630"
              }
            ]
          }
        ]
      },
      {
        "id": "932",
        "cname": "浙江",
        "pid": "1",
        "childrens": [
          {
            "id": "933",
            "cname": "杭州",
            "pid": "932",
            "childrens": [
              {
                "id": "939",
                "cname": "滨江区",
                "pid": "933"
              },
              {
                "id": "943",
                "cname": "淳安县",
                "pid": "933"
              },
              {
                "id": "945",
                "cname": "富阳市",
                "pid": "933"
              },
              {
                "id": "937",
                "cname": "拱墅区",
                "pid": "933"
              },
              {
                "id": "936",
                "cname": "江干区",
                "pid": "933"
              },
              {
                "id": "944",
                "cname": "建德市",
                "pid": "933"
              },
              {
                "id": "946",
                "cname": "临安市",
                "pid": "933"
              },
              {
                "id": "934",
                "cname": "上城区",
                "pid": "933"
              },
              {
                "id": "942",
                "cname": "桐庐县",
                "pid": "933"
              },
              {
                "id": "935",
                "cname": "下城区",
                "pid": "933"
              },
              {
                "id": "938",
                "cname": "西湖区",
                "pid": "933"
              },
              {
                "id": "940",
                "cname": "萧山区",
                "pid": "933"
              },
              {
                "id": "941",
                "cname": "余杭区",
                "pid": "933"
              },
              {
                "id": "100173",
                "cname": "其他",
                "pid": "933"
              }
            ]
          },
          {
            "id": "979",
            "cname": "湖州",
            "pid": "932",
            "childrens": [
              {
                "id": "984",
                "cname": "安吉县",
                "pid": "979"
              },
              {
                "id": "983",
                "cname": "长兴县",
                "pid": "979"
              },
              {
                "id": "982",
                "cname": "德清县",
                "pid": "979"
              },
              {
                "id": "981",
                "cname": "南浔区",
                "pid": "979"
              },
              {
                "id": "980",
                "cname": "吴兴区",
                "pid": "979"
              },
              {
                "id": "100013",
                "cname": "其他",
                "pid": "979"
              }
            ]
          },
          {
            "id": "971",
            "cname": "嘉兴",
            "pid": "932",
            "childrens": [
              {
                "id": "975",
                "cname": "海盐县",
                "pid": "971"
              },
              {
                "id": "976",
                "cname": "海宁市",
                "pid": "971"
              },
              {
                "id": "974",
                "cname": "嘉善县",
                "pid": "971"
              },
              {
                "id": "972",
                "cname": "南湖区",
                "pid": "971"
              },
              {
                "id": "977",
                "cname": "平湖市",
                "pid": "971"
              },
              {
                "id": "978",
                "cname": "桐乡市",
                "pid": "971"
              },
              {
                "id": "973",
                "cname": "秀洲区",
                "pid": "971"
              },
              {
                "id": "100500",
                "cname": "其他",
                "pid": "971"
              }
            ]
          },
          {
            "id": "992",
            "cname": "金华",
            "pid": "932",
            "childrens": [
              {
                "id": "1000",
                "cname": "东阳市",
                "pid": "992"
              },
              {
                "id": "994",
                "cname": "金东区",
                "pid": "992"
              },
              {
                "id": "998",
                "cname": "兰溪市",
                "pid": "992"
              },
              {
                "id": "996",
                "cname": "浦江县",
                "pid": "992"
              },
              {
                "id": "997",
                "cname": "磐安县",
                "pid": "992"
              },
              {
                "id": "993",
                "cname": "婺城区",
                "pid": "992"
              },
              {
                "id": "995",
                "cname": "武义县",
                "pid": "992"
              },
              {
                "id": "999",
                "cname": "义乌市",
                "pid": "992"
              },
              {
                "id": "1001",
                "cname": "永康市",
                "pid": "992"
              },
              {
                "id": "100383",
                "cname": "其他",
                "pid": "992"
              }
            ]
          },
          {
            "id": "1024",
            "cname": "丽水",
            "pid": "932",
            "childrens": [
              {
                "id": "1027",
                "cname": "缙云县",
                "pid": "1024"
              },
              {
                "id": "1032",
                "cname": "景宁畲族自治县",
                "pid": "1024"
              },
              {
                "id": "1025",
                "cname": "莲都区",
                "pid": "1024"
              },
              {
                "id": "1033",
                "cname": "龙泉市",
                "pid": "1024"
              },
              {
                "id": "1026",
                "cname": "青田县",
                "pid": "1024"
              },
              {
                "id": "1031",
                "cname": "庆元县",
                "pid": "1024"
              },
              {
                "id": "1028",
                "cname": "遂昌县",
                "pid": "1024"
              },
              {
                "id": "1029",
                "cname": "松阳县",
                "pid": "1024"
              },
              {
                "id": "1030",
                "cname": "云和县",
                "pid": "1024"
              },
              {
                "id": "100526",
                "cname": "其他",
                "pid": "1024"
              }
            ]
          },
          {
            "id": "947",
            "cname": "宁波",
            "pid": "932",
            "childrens": [
              {
                "id": "951",
                "cname": "北仑区",
                "pid": "947"
              },
              {
                "id": "957",
                "cname": "慈溪市",
                "pid": "947"
              },
              {
                "id": "958",
                "cname": "奉化市",
                "pid": "947"
              },
              {
                "id": "948",
                "cname": "海曙区",
                "pid": "947"
              },
              {
                "id": "949",
                "cname": "江东区",
                "pid": "947"
              },
              {
                "id": "950",
                "cname": "江北区",
                "pid": "947"
              },
              {
                "id": "955",
                "cname": "宁海县",
                "pid": "947"
              },
              {
                "id": "954",
                "cname": "象山县",
                "pid": "947"
              },
              {
                "id": "953",
                "cname": "鄞州区",
                "pid": "947"
              },
              {
                "id": "956",
                "cname": "余姚市",
                "pid": "947"
              },
              {
                "id": "952",
                "cname": "镇海区",
                "pid": "947"
              },
              {
                "id": "100174",
                "cname": "其他",
                "pid": "947"
              }
            ]
          },
          {
            "id": "1002",
            "cname": "衢州",
            "pid": "932",
            "childrens": [
              {
                "id": "1005",
                "cname": "常山县",
                "pid": "1002"
              },
              {
                "id": "1008",
                "cname": "江山市",
                "pid": "1002"
              },
              {
                "id": "1003",
                "cname": "柯城区",
                "pid": "1002"
              },
              {
                "id": "1006",
                "cname": "开化县",
                "pid": "1002"
              },
              {
                "id": "1007",
                "cname": "龙游县",
                "pid": "1002"
              },
              {
                "id": "1004",
                "cname": "衢江区",
                "pid": "1002"
              },
              {
                "id": "100309",
                "cname": "其他",
                "pid": "1002"
              }
            ]
          },
          {
            "id": "985",
            "cname": "绍兴",
            "pid": "932",
            "childrens": [
              {
                "id": "987",
                "cname": "绍兴县",
                "pid": "985"
              },
              {
                "id": "990",
                "cname": "上虞市",
                "pid": "985"
              },
              {
                "id": "991",
                "cname": "嵊州市",
                "pid": "985"
              },
              {
                "id": "988",
                "cname": "新昌县",
                "pid": "985"
              },
              {
                "id": "986",
                "cname": "越城区",
                "pid": "985"
              },
              {
                "id": "989",
                "cname": "诸暨市",
                "pid": "985"
              },
              {
                "id": "100563",
                "cname": "其他",
                "pid": "985"
              }
            ]
          },
          {
            "id": "1014",
            "cname": "台州",
            "pid": "932",
            "childrens": [
              {
                "id": "1016",
                "cname": "黄岩区",
                "pid": "1014"
              },
              {
                "id": "1015",
                "cname": "椒江区",
                "pid": "1014"
              },
              {
                "id": "1017",
                "cname": "路桥区",
                "pid": "1014"
              },
              {
                "id": "1023",
                "cname": "临海市",
                "pid": "1014"
              },
              {
                "id": "1019",
                "cname": "三门县",
                "pid": "1014"
              },
              {
                "id": "1020",
                "cname": "天台县",
                "pid": "1014"
              },
              {
                "id": "1022",
                "cname": "温岭市",
                "pid": "1014"
              },
              {
                "id": "1021",
                "cname": "仙居县",
                "pid": "1014"
              },
              {
                "id": "1018",
                "cname": "玉环县",
                "pid": "1014"
              },
              {
                "id": "100501",
                "cname": "其他",
                "pid": "1014"
              }
            ]
          },
          {
            "id": "959",
            "cname": "温州",
            "pid": "932",
            "childrens": [
              {
                "id": "966",
                "cname": "苍南县",
                "pid": "959"
              },
              {
                "id": "963",
                "cname": "洞头县",
                "pid": "959"
              },
              {
                "id": "960",
                "cname": "鹿城区",
                "pid": "959"
              },
              {
                "id": "961",
                "cname": "龙湾区",
                "pid": "959"
              },
              {
                "id": "970",
                "cname": "乐清市",
                "pid": "959"
              },
              {
                "id": "962",
                "cname": "瓯海区",
                "pid": "959"
              },
              {
                "id": "965",
                "cname": "平阳县",
                "pid": "959"
              },
              {
                "id": "969",
                "cname": "瑞安市",
                "pid": "959"
              },
              {
                "id": "968",
                "cname": "泰顺县",
                "pid": "959"
              },
              {
                "id": "967",
                "cname": "文成县",
                "pid": "959"
              },
              {
                "id": "964",
                "cname": "永嘉县",
                "pid": "959"
              },
              {
                "id": "100308",
                "cname": "其他",
                "pid": "959"
              }
            ]
          },
          {
            "id": "1009",
            "cname": "舟山",
            "pid": "932",
            "childrens": [
              {
                "id": "1010",
                "cname": "定海区",
                "pid": "1009"
              },
              {
                "id": "1012",
                "cname": "岱山县",
                "pid": "1009"
              },
              {
                "id": "1011",
                "cname": "普陀区",
                "pid": "1009"
              },
              {
                "id": "1013",
                "cname": "嵊泗县",
                "pid": "1009"
              },
              {
                "id": "100384",
                "cname": "其他",
                "pid": "1009"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "3280",
    "cname": "阿尔巴尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "3281",
        "cname": "爱尔巴桑",
        "pid": "3280"
      },
      {
        "id": "3282",
        "cname": "迪勃拉",
        "pid": "3280"
      },
      {
        "id": "3283",
        "cname": "地拉那",
        "pid": "3280"
      },
      {
        "id": "3284",
        "cname": "都拉斯",
        "pid": "3280"
      },
      {
        "id": "3285",
        "cname": "发罗拉",
        "pid": "3280"
      },
      {
        "id": "3286",
        "cname": "费里",
        "pid": "3280"
      },
      {
        "id": "3287",
        "cname": "吉诺卡斯特",
        "pid": "3280"
      },
      {
        "id": "3288",
        "cname": "科尔察",
        "pid": "3280"
      },
      {
        "id": "3289",
        "cname": "库克斯",
        "pid": "3280"
      },
      {
        "id": "3290",
        "cname": "莱什",
        "pid": "3280"
      },
      {
        "id": "3291",
        "cname": "培拉特",
        "pid": "3280"
      },
      {
        "id": "3292",
        "cname": "斯库台",
        "pid": "3280"
      },
      {
        "id": "100131",
        "cname": "其他",
        "pid": "3280"
      }
    ]
  },
  {
    "id": "3293",
    "cname": "阿尔及利亚",
    "pid": "",
    "childrens": [
      {
        "id": "3294",
        "cname": "阿德拉尔",
        "pid": "3293"
      },
      {
        "id": "3295",
        "cname": "阿尔及尔",
        "pid": "3293"
      },
      {
        "id": "3298",
        "cname": "安纳巴",
        "pid": "3293"
      },
      {
        "id": "3296",
        "cname": "艾因·德夫拉",
        "pid": "3293"
      },
      {
        "id": "3297",
        "cname": "艾因·蒂姆尚特",
        "pid": "3293"
      },
      {
        "id": "3299",
        "cname": "奥兰",
        "pid": "3293"
      },
      {
        "id": "3300",
        "cname": "巴特纳",
        "pid": "3293"
      },
      {
        "id": "3301",
        "cname": "贝贾亚",
        "pid": "3293"
      },
      {
        "id": "3302",
        "cname": "贝沙尔",
        "pid": "3293"
      },
      {
        "id": "3303",
        "cname": "贝伊德",
        "pid": "3293"
      },
      {
        "id": "3304",
        "cname": "比斯克拉",
        "pid": "3293"
      },
      {
        "id": "3305",
        "cname": "布尔吉·布阿雷里吉",
        "pid": "3293"
      },
      {
        "id": "3306",
        "cname": "布利达",
        "pid": "3293"
      },
      {
        "id": "3307",
        "cname": "布迈德斯",
        "pid": "3293"
      },
      {
        "id": "3308",
        "cname": "布依拉",
        "pid": "3293"
      },
      {
        "id": "3309",
        "cname": "蒂巴扎",
        "pid": "3293"
      },
      {
        "id": "3310",
        "cname": "蒂斯姆西勒特",
        "pid": "3293"
      },
      {
        "id": "3311",
        "cname": "盖尔达耶",
        "pid": "3293"
      },
      {
        "id": "3312",
        "cname": "盖尔马",
        "pid": "3293"
      },
      {
        "id": "3313",
        "cname": "罕西拉",
        "pid": "3293"
      },
      {
        "id": "3314",
        "cname": "赫利赞",
        "pid": "3293"
      },
      {
        "id": "3315",
        "cname": "吉杰尔",
        "pid": "3293"
      },
      {
        "id": "3316",
        "cname": "杰勒法",
        "pid": "3293"
      },
      {
        "id": "3317",
        "cname": "君士坦丁",
        "pid": "3293"
      },
      {
        "id": "3318",
        "cname": "拉格瓦特",
        "pid": "3293"
      },
      {
        "id": "3319",
        "cname": "马斯卡拉",
        "pid": "3293"
      },
      {
        "id": "3320",
        "cname": "麦迪亚",
        "pid": "3293"
      },
      {
        "id": "3321",
        "cname": "密拉",
        "pid": "3293"
      },
      {
        "id": "3322",
        "cname": "莫斯塔加纳姆",
        "pid": "3293"
      },
      {
        "id": "3323",
        "cname": "姆西拉",
        "pid": "3293"
      },
      {
        "id": "3324",
        "cname": "纳阿马",
        "pid": "3293"
      },
      {
        "id": "3325",
        "cname": "塞蒂夫",
        "pid": "3293"
      },
      {
        "id": "3326",
        "cname": "赛伊达",
        "pid": "3293"
      },
      {
        "id": "3327",
        "cname": "斯基克达",
        "pid": "3293"
      },
      {
        "id": "3328",
        "cname": "苏克·阿赫拉斯",
        "pid": "3293"
      },
      {
        "id": "3329",
        "cname": "塔里夫",
        "pid": "3293"
      },
      {
        "id": "3330",
        "cname": "塔曼拉塞特",
        "pid": "3293"
      },
      {
        "id": "3331",
        "cname": "特贝萨",
        "pid": "3293"
      },
      {
        "id": "3332",
        "cname": "特莱姆森",
        "pid": "3293"
      },
      {
        "id": "3333",
        "cname": "提济乌祖",
        "pid": "3293"
      },
      {
        "id": "3334",
        "cname": "提亚雷特",
        "pid": "3293"
      },
      {
        "id": "3335",
        "cname": "廷杜夫",
        "pid": "3293"
      },
      {
        "id": "3336",
        "cname": "瓦德",
        "pid": "3293"
      },
      {
        "id": "3337",
        "cname": "瓦尔格拉",
        "pid": "3293"
      },
      {
        "id": "3338",
        "cname": "乌姆布阿基",
        "pid": "3293"
      },
      {
        "id": "3339",
        "cname": "西迪贝勒阿贝斯",
        "pid": "3293"
      },
      {
        "id": "3340",
        "cname": "谢里夫",
        "pid": "3293"
      },
      {
        "id": "3341",
        "cname": "伊利齐",
        "pid": "3293"
      },
      {
        "id": "100040",
        "cname": "其他",
        "pid": "3293"
      }
    ]
  },
  {
    "id": "3342",
    "cname": "阿富汗",
    "pid": "",
    "childrens": [
      {
        "id": "3343",
        "cname": "赫拉特",
        "pid": "3342"
      },
      {
        "id": "3344",
        "cname": "喀布尔",
        "pid": "3342"
      },
      {
        "id": "3345",
        "cname": "坎大哈",
        "pid": "3342"
      },
      {
        "id": "3346",
        "cname": "马扎里沙里夫",
        "pid": "3342"
      },
      {
        "id": "100520",
        "cname": "其他",
        "pid": "3342"
      }
    ]
  },
  {
    "id": "3347",
    "cname": "阿根廷",
    "pid": "",
    "childrens": [
      {
        "id": "3348",
        "cname": "巴拉那",
        "pid": "3347"
      },
      {
        "id": "3349",
        "cname": "别德马",
        "pid": "3347"
      },
      {
        "id": "3350",
        "cname": "波萨达斯",
        "pid": "3347"
      },
      {
        "id": "3351",
        "cname": "布兰卡港",
        "pid": "3347"
      },
      {
        "id": "3352",
        "cname": "布宜诺斯艾利斯",
        "pid": "3347"
      },
      {
        "id": "3353",
        "cname": "福莫萨",
        "pid": "3347"
      },
      {
        "id": "3354",
        "cname": "胡胡伊",
        "pid": "3347"
      },
      {
        "id": "3355",
        "cname": "卡塔马卡",
        "pid": "3347"
      },
      {
        "id": "3356",
        "cname": "科尔多瓦",
        "pid": "3347"
      },
      {
        "id": "3357",
        "cname": "科连特斯",
        "pid": "3347"
      },
      {
        "id": "3358",
        "cname": "克劳斯城",
        "pid": "3347"
      },
      {
        "id": "3359",
        "cname": "肯考迪娅",
        "pid": "3347"
      },
      {
        "id": "3360",
        "cname": "拉里奥哈",
        "pid": "3347"
      },
      {
        "id": "3361",
        "cname": "拉普拉塔",
        "pid": "3347"
      },
      {
        "id": "3362",
        "cname": "雷西斯滕匹亚",
        "pid": "3347"
      },
      {
        "id": "3363",
        "cname": "里奥加耶戈斯",
        "pid": "3347"
      },
      {
        "id": "3364",
        "cname": "里奥夸尔托",
        "pid": "3347"
      },
      {
        "id": "3365",
        "cname": "里瓦达维亚海军准将城",
        "pid": "3347"
      },
      {
        "id": "3366",
        "cname": "罗萨里奥",
        "pid": "3347"
      },
      {
        "id": "3367",
        "cname": "罗森",
        "pid": "3347"
      },
      {
        "id": "3368",
        "cname": "马德普拉塔",
        "pid": "3347"
      },
      {
        "id": "3369",
        "cname": "门多萨",
        "pid": "3347"
      },
      {
        "id": "3370",
        "cname": "内乌肯",
        "pid": "3347"
      },
      {
        "id": "3371",
        "cname": "萨尔塔",
        "pid": "3347"
      },
      {
        "id": "3372",
        "cname": "圣地亚哥-德尔埃斯特罗",
        "pid": "3347"
      },
      {
        "id": "3373",
        "cname": "圣菲",
        "pid": "3347"
      },
      {
        "id": "3374",
        "cname": "圣胡安",
        "pid": "3347"
      },
      {
        "id": "3375",
        "cname": "圣拉斐尔",
        "pid": "3347"
      },
      {
        "id": "3376",
        "cname": "圣路易斯",
        "pid": "3347"
      },
      {
        "id": "3377",
        "cname": "圣罗莎",
        "pid": "3347"
      },
      {
        "id": "3378",
        "cname": "圣米格尔-德图库曼",
        "pid": "3347"
      },
      {
        "id": "3379",
        "cname": "圣尼古拉斯",
        "pid": "3347"
      },
      {
        "id": "3380",
        "cname": "特雷利乌",
        "pid": "3347"
      },
      {
        "id": "3381",
        "cname": "乌斯怀亚",
        "pid": "3347"
      },
      {
        "id": "100217",
        "cname": "其他",
        "pid": "3347"
      }
    ]
  },
  {
    "id": "3382",
    "cname": "阿拉伯联合酋长国",
    "pid": "",
    "childrens": [
      {
        "id": "3383",
        "cname": "阿布扎比",
        "pid": "3382"
      },
      {
        "id": "3384",
        "cname": "艾因",
        "pid": "3382"
      },
      {
        "id": "3385",
        "cname": "迪拜",
        "pid": "3382"
      },
      {
        "id": "3386",
        "cname": "沙迦",
        "pid": "3382"
      },
      {
        "id": "100041",
        "cname": "其他",
        "pid": "3382"
      }
    ]
  },
  {
    "id": "3387",
    "cname": "阿鲁巴",
    "pid": ""
  },
  {
    "id": "3388",
    "cname": "阿曼",
    "pid": "",
    "childrens": [
      {
        "id": "3389",
        "cname": "巴提奈地区",
        "pid": "3388"
      },
      {
        "id": "3390",
        "cname": "达希莱地区",
        "pid": "3388"
      },
      {
        "id": "3391",
        "cname": "东部地区",
        "pid": "3388"
      },
      {
        "id": "3392",
        "cname": "马斯喀特省",
        "pid": "3388"
      },
      {
        "id": "3393",
        "cname": "穆桑达姆省",
        "pid": "3388"
      },
      {
        "id": "3394",
        "cname": "内地地区",
        "pid": "3388"
      },
      {
        "id": "3395",
        "cname": "中部地区",
        "pid": "3388"
      },
      {
        "id": "3396",
        "cname": "佐法尔省",
        "pid": "3388"
      },
      {
        "id": "100218",
        "cname": "其他",
        "pid": "3388"
      }
    ]
  },
  {
    "id": "3397",
    "cname": "阿塞拜疆",
    "pid": "",
    "childrens": [
      {
        "id": "3398",
        "cname": "阿布歇隆",
        "pid": "3397"
      },
      {
        "id": "3399",
        "cname": "哈奇马斯",
        "pid": "3397"
      },
      {
        "id": "3400",
        "cname": "卡尔巴卡尔",
        "pid": "3397"
      },
      {
        "id": "3401",
        "cname": "卡扎赫",
        "pid": "3397"
      },
      {
        "id": "3402",
        "cname": "连科兰",
        "pid": "3397"
      },
      {
        "id": "3403",
        "cname": "密尔-卡拉巴赫",
        "pid": "3397"
      },
      {
        "id": "3404",
        "cname": "穆甘-萨连",
        "pid": "3397"
      },
      {
        "id": "3405",
        "cname": "纳戈尔诺－卡拉巴赫",
        "pid": "3397"
      },
      {
        "id": "3406",
        "cname": "纳希切万",
        "pid": "3397"
      },
      {
        "id": "3407",
        "cname": "普利亚拉克斯",
        "pid": "3397"
      },
      {
        "id": "3408",
        "cname": "舍基",
        "pid": "3397"
      },
      {
        "id": "3409",
        "cname": "苏姆盖特",
        "pid": "3397"
      },
      {
        "id": "3410",
        "cname": "锡尔万",
        "pid": "3397"
      },
      {
        "id": "3411",
        "cname": "占贾",
        "pid": "3397"
      },
      {
        "id": "100042",
        "cname": "其他",
        "pid": "3397"
      }
    ]
  },
  {
    "id": "3412",
    "cname": "阿森松岛",
    "pid": ""
  },
  {
    "id": "3413",
    "cname": "埃及",
    "pid": "",
    "childrens": [
      {
        "id": "3414",
        "cname": "阿斯旺",
        "pid": "3413"
      },
      {
        "id": "3415",
        "cname": "古尔代盖",
        "pid": "3413"
      },
      {
        "id": "3416",
        "cname": "开罗",
        "pid": "3413"
      },
      {
        "id": "3417",
        "cname": "苏布拉开马",
        "pid": "3413"
      },
      {
        "id": "3418",
        "cname": "亚历山大",
        "pid": "3413"
      },
      {
        "id": "100043",
        "cname": "其他",
        "pid": "3413"
      }
    ]
  },
  {
    "id": "3419",
    "cname": "埃塞俄比亚",
    "pid": "",
    "childrens": [
      {
        "id": "3420",
        "cname": "阿法尔",
        "pid": "3419"
      },
      {
        "id": "3421",
        "cname": "阿姆哈拉",
        "pid": "3419"
      },
      {
        "id": "3422",
        "cname": "奥罗米亚",
        "pid": "3419"
      },
      {
        "id": "3423",
        "cname": "宾香古尔",
        "pid": "3419"
      },
      {
        "id": "3424",
        "cname": "德雷达瓦",
        "pid": "3419"
      },
      {
        "id": "3425",
        "cname": "甘贝拉各族",
        "pid": "3419"
      },
      {
        "id": "3426",
        "cname": "哈勒里民族",
        "pid": "3419"
      },
      {
        "id": "3427",
        "cname": "南方各族",
        "pid": "3419"
      },
      {
        "id": "3428",
        "cname": "索马里",
        "pid": "3419"
      },
      {
        "id": "3429",
        "cname": "提格雷",
        "pid": "3419"
      },
      {
        "id": "3430",
        "cname": "亚的斯亚贝巴",
        "pid": "3419"
      },
      {
        "id": "100044",
        "cname": "其他",
        "pid": "3419"
      }
    ]
  },
  {
    "id": "3474",
    "cname": "安道尔",
    "pid": "",
    "childrens": [
      {
        "id": "3475",
        "cname": "安道尔城",
        "pid": "3474"
      },
      {
        "id": "3476",
        "cname": "奥尔迪诺",
        "pid": "3474"
      },
      {
        "id": "3477",
        "cname": "恩坎普",
        "pid": "3474"
      },
      {
        "id": "3478",
        "cname": "卡尼略",
        "pid": "3474"
      },
      {
        "id": "3479",
        "cname": "莱塞斯卡尔德－恩戈尔达",
        "pid": "3474"
      },
      {
        "id": "3480",
        "cname": "马萨纳",
        "pid": "3474"
      },
      {
        "id": "3481",
        "cname": "圣胡利娅－德洛里亚",
        "pid": "3474"
      },
      {
        "id": "100045",
        "cname": "其他",
        "pid": "3474"
      }
    ]
  },
  {
    "id": "3482",
    "cname": "安哥拉",
    "pid": "",
    "childrens": [
      {
        "id": "3483",
        "cname": "北宽扎",
        "pid": "3482"
      },
      {
        "id": "3484",
        "cname": "北隆达",
        "pid": "3482"
      },
      {
        "id": "3485",
        "cname": "本戈",
        "pid": "3482"
      },
      {
        "id": "3486",
        "cname": "本格拉",
        "pid": "3482"
      },
      {
        "id": "3487",
        "cname": "比耶",
        "pid": "3482"
      },
      {
        "id": "3488",
        "cname": "卡宾达",
        "pid": "3482"
      },
      {
        "id": "3489",
        "cname": "库内内",
        "pid": "3482"
      },
      {
        "id": "3490",
        "cname": "宽多库邦戈",
        "pid": "3482"
      },
      {
        "id": "3491",
        "cname": "罗安达",
        "pid": "3482"
      },
      {
        "id": "3492",
        "cname": "马兰热",
        "pid": "3482"
      },
      {
        "id": "3493",
        "cname": "莫希科",
        "pid": "3482"
      },
      {
        "id": "3494",
        "cname": "纳米贝",
        "pid": "3482"
      },
      {
        "id": "3495",
        "cname": "南宽扎",
        "pid": "3482"
      },
      {
        "id": "3496",
        "cname": "南隆达",
        "pid": "3482"
      },
      {
        "id": "3497",
        "cname": "万博",
        "pid": "3482"
      },
      {
        "id": "3498",
        "cname": "威拉",
        "pid": "3482"
      },
      {
        "id": "3499",
        "cname": "威热",
        "pid": "3482"
      },
      {
        "id": "3500",
        "cname": "扎伊尔",
        "pid": "3482"
      },
      {
        "id": "100220",
        "cname": "其他",
        "pid": "3482"
      }
    ]
  },
  {
    "id": "3501",
    "cname": "安圭拉",
    "pid": ""
  },
  {
    "id": "3502",
    "cname": "安提瓜岛和巴布达",
    "pid": ""
  },
  {
    "id": "3431",
    "cname": "爱尔兰",
    "pid": "",
    "childrens": [
      {
        "id": "3432",
        "cname": "奥法利",
        "pid": "3431"
      },
      {
        "id": "3433",
        "cname": "蒂珀雷里",
        "pid": "3431"
      },
      {
        "id": "3434",
        "cname": "都柏林",
        "pid": "3431"
      },
      {
        "id": "3435",
        "cname": "多内加尔",
        "pid": "3431"
      },
      {
        "id": "3436",
        "cname": "戈尔韦",
        "pid": "3431"
      },
      {
        "id": "3437",
        "cname": "基尔代尔",
        "pid": "3431"
      },
      {
        "id": "3438",
        "cname": "基尔肯尼",
        "pid": "3431"
      },
      {
        "id": "3439",
        "cname": "卡范",
        "pid": "3431"
      },
      {
        "id": "3440",
        "cname": "卡洛",
        "pid": "3431"
      },
      {
        "id": "3441",
        "cname": "凯里",
        "pid": "3431"
      },
      {
        "id": "3442",
        "cname": "科克",
        "pid": "3431"
      },
      {
        "id": "3443",
        "cname": "克莱尔",
        "pid": "3431"
      },
      {
        "id": "3444",
        "cname": "朗福德",
        "pid": "3431"
      },
      {
        "id": "3445",
        "cname": "劳斯",
        "pid": "3431"
      },
      {
        "id": "3446",
        "cname": "崂斯",
        "pid": "3431"
      },
      {
        "id": "3447",
        "cname": "利默里克",
        "pid": "3431"
      },
      {
        "id": "3448",
        "cname": "利特里姆",
        "pid": "3431"
      },
      {
        "id": "3449",
        "cname": "罗斯康芒",
        "pid": "3431"
      },
      {
        "id": "3450",
        "cname": "梅奥",
        "pid": "3431"
      },
      {
        "id": "3451",
        "cname": "米斯",
        "pid": "3431"
      },
      {
        "id": "3452",
        "cname": "莫内根",
        "pid": "3431"
      },
      {
        "id": "3453",
        "cname": "斯莱戈",
        "pid": "3431"
      },
      {
        "id": "3454",
        "cname": "威克洛",
        "pid": "3431"
      },
      {
        "id": "3455",
        "cname": "韦克斯福德",
        "pid": "3431"
      },
      {
        "id": "3456",
        "cname": "沃特福德",
        "pid": "3431"
      },
      {
        "id": "3457",
        "cname": "西米斯",
        "pid": "3431"
      },
      {
        "id": "100132",
        "cname": "其他",
        "pid": "3431"
      }
    ]
  },
  {
    "id": "3458",
    "cname": "爱沙尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "3459",
        "cname": "贝尔瓦",
        "pid": "3458"
      },
      {
        "id": "3460",
        "cname": "哈留",
        "pid": "3458"
      },
      {
        "id": "3461",
        "cname": "拉普拉",
        "pid": "3458"
      },
      {
        "id": "3462",
        "cname": "里亚内",
        "pid": "3458"
      },
      {
        "id": "3463",
        "cname": "帕尔努",
        "pid": "3458"
      },
      {
        "id": "3464",
        "cname": "萨雷",
        "pid": "3458"
      },
      {
        "id": "3465",
        "cname": "塔尔图",
        "pid": "3458"
      },
      {
        "id": "3466",
        "cname": "瓦尔加",
        "pid": "3458"
      },
      {
        "id": "3467",
        "cname": "维良地",
        "pid": "3458"
      },
      {
        "id": "3468",
        "cname": "维鲁",
        "pid": "3458"
      },
      {
        "id": "3469",
        "cname": "沃鲁",
        "pid": "3458"
      },
      {
        "id": "3470",
        "cname": "希尤",
        "pid": "3458"
      },
      {
        "id": "3471",
        "cname": "耶尔韦",
        "pid": "3458"
      },
      {
        "id": "3472",
        "cname": "耶盖瓦",
        "pid": "3458"
      },
      {
        "id": "3473",
        "cname": "依达－维鲁",
        "pid": "3458"
      },
      {
        "id": "100219",
        "cname": "其他",
        "pid": "3458"
      }
    ]
  },
  {
    "id": "3503",
    "cname": "澳大利亚",
    "pid": "",
    "childrens": [
      {
        "id": "3504",
        "cname": "北部地区",
        "pid": "3503",
        "childrens": [
          {
            "id": "3505",
            "cname": "北帕默斯顿",
            "pid": "3504"
          },
          {
            "id": "3506",
            "cname": "达尔文",
            "pid": "3504"
          },
          {
            "id": "100221",
            "cname": "其他",
            "pid": "3504"
          }
        ]
      },
      {
        "id": "3507",
        "cname": "堪培拉",
        "pid": "3503",
        "childrens": [
          {
            "id": "3508",
            "cname": "堪培拉",
            "pid": "3507"
          },
          {
            "id": "100541",
            "cname": "其他",
            "pid": "3507"
          }
        ]
      },
      {
        "id": "3509",
        "cname": "昆士兰",
        "pid": "3503",
        "childrens": [
          {
            "id": "3510",
            "cname": "布里斯班",
            "pid": "3509"
          },
          {
            "id": "3511",
            "cname": "黄金海岸",
            "pid": "3509"
          },
          {
            "id": "3512",
            "cname": "凯恩斯",
            "pid": "3509"
          },
          {
            "id": "3513",
            "cname": "日光海岸",
            "pid": "3509"
          },
          {
            "id": "3514",
            "cname": "汤斯维尔",
            "pid": "3509"
          },
          {
            "id": "3515",
            "cname": "图文巴",
            "pid": "3509"
          },
          {
            "id": "100222",
            "cname": "其他",
            "pid": "3509"
          }
        ]
      },
      {
        "id": "3516",
        "cname": "南澳大利亚",
        "pid": "3503",
        "childrens": [
          {
            "id": "3517",
            "cname": "阿德莱德",
            "pid": "3516"
          },
          {
            "id": "3518",
            "cname": "奥古斯塔港",
            "pid": "3516"
          },
          {
            "id": "3519",
            "cname": "甘比亚山",
            "pid": "3516"
          },
          {
            "id": "3520",
            "cname": "怀阿拉",
            "pid": "3516"
          },
          {
            "id": "3521",
            "cname": "林肯港",
            "pid": "3516"
          },
          {
            "id": "3522",
            "cname": "默里布里奇",
            "pid": "3516"
          },
          {
            "id": "3523",
            "cname": "皮里港",
            "pid": "3516"
          },
          {
            "id": "3524",
            "cname": "维克托港",
            "pid": "3516"
          },
          {
            "id": "100046",
            "cname": "其他",
            "pid": "3516"
          }
        ]
      },
      {
        "id": "3525",
        "cname": "塔斯马尼亚",
        "pid": "3503",
        "childrens": [
          {
            "id": "3526",
            "cname": "伯尼港",
            "pid": "3525"
          },
          {
            "id": "3527",
            "cname": "德文波特",
            "pid": "3525"
          },
          {
            "id": "3528",
            "cname": "霍巴特",
            "pid": "3525"
          },
          {
            "id": "3529",
            "cname": "朗塞斯顿",
            "pid": "3525"
          },
          {
            "id": "100223",
            "cname": "其他",
            "pid": "3525"
          }
        ]
      },
      {
        "id": "3530",
        "cname": "维多利亚",
        "pid": "3503",
        "childrens": [
          {
            "id": "3531",
            "cname": "吉朗",
            "pid": "3530"
          },
          {
            "id": "3532",
            "cname": "墨尔本",
            "pid": "3530"
          },
          {
            "id": "100536",
            "cname": "其他",
            "pid": "3530"
          }
        ]
      },
      {
        "id": "3533",
        "cname": "西澳大利亚",
        "pid": "3503",
        "childrens": [
          {
            "id": "3534",
            "cname": "奥尔巴尼",
            "pid": "3533"
          },
          {
            "id": "3535",
            "cname": "班伯里",
            "pid": "3533"
          },
          {
            "id": "3536",
            "cname": "弗里曼特尔港",
            "pid": "3533"
          },
          {
            "id": "3537",
            "cname": "杰拉尔顿",
            "pid": "3533"
          },
          {
            "id": "3538",
            "cname": "卡尔古利",
            "pid": "3533"
          },
          {
            "id": "3539",
            "cname": "曼哲拉",
            "pid": "3533"
          },
          {
            "id": "3540",
            "cname": "珀斯",
            "pid": "3533"
          },
          {
            "id": "100133",
            "cname": "其他",
            "pid": "3533"
          }
        ]
      },
      {
        "id": "3541",
        "cname": "新南威尔士",
        "pid": "3503",
        "childrens": [
          {
            "id": "3542",
            "cname": "纽卡斯尔",
            "pid": "3541"
          },
          {
            "id": "3543",
            "cname": "伍伦贡",
            "pid": "3541"
          },
          {
            "id": "3544",
            "cname": "悉尼",
            "pid": "3541"
          },
          {
            "id": "100558",
            "cname": "其他",
            "pid": "3541"
          }
        ]
      }
    ]
  },
  {
    "id": "3545",
    "cname": "奥地利",
    "pid": "",
    "childrens": [
      {
        "id": "3546",
        "cname": "布尔根兰",
        "pid": "3545"
      },
      {
        "id": "3547",
        "cname": "蒂罗尔",
        "pid": "3545"
      },
      {
        "id": "3548",
        "cname": "福拉尔贝格",
        "pid": "3545"
      },
      {
        "id": "3549",
        "cname": "克恩顿",
        "pid": "3545"
      },
      {
        "id": "3550",
        "cname": "萨尔茨堡",
        "pid": "3545"
      },
      {
        "id": "3551",
        "cname": "上奥地利",
        "pid": "3545"
      },
      {
        "id": "3552",
        "cname": "施蒂利亚",
        "pid": "3545"
      },
      {
        "id": "3553",
        "cname": "维也纳",
        "pid": "3545"
      },
      {
        "id": "3554",
        "cname": "下奥地利",
        "pid": "3545"
      },
      {
        "id": "100224",
        "cname": "其他",
        "pid": "3545"
      }
    ]
  },
  {
    "id": "3555",
    "cname": "奥兰群岛",
    "pid": ""
  },
  {
    "id": "3556",
    "cname": "巴巴多斯岛",
    "pid": ""
  },
  {
    "id": "3557",
    "cname": "巴布亚新几内亚",
    "pid": "",
    "childrens": [
      {
        "id": "3558",
        "cname": "北部",
        "pid": "3557"
      },
      {
        "id": "3559",
        "cname": "布干维尔",
        "pid": "3557"
      },
      {
        "id": "3560",
        "cname": "东部高地",
        "pid": "3557"
      },
      {
        "id": "3561",
        "cname": "东塞皮克",
        "pid": "3557"
      },
      {
        "id": "3562",
        "cname": "东新不列颠",
        "pid": "3557"
      },
      {
        "id": "3563",
        "cname": "恩加",
        "pid": "3557"
      },
      {
        "id": "3564",
        "cname": "海湾",
        "pid": "3557"
      },
      {
        "id": "3565",
        "cname": "马当",
        "pid": "3557"
      },
      {
        "id": "3566",
        "cname": "马努斯",
        "pid": "3557"
      },
      {
        "id": "3567",
        "cname": "米尔恩湾",
        "pid": "3557"
      },
      {
        "id": "3568",
        "cname": "莫尔兹比港",
        "pid": "3557"
      },
      {
        "id": "3569",
        "cname": "莫罗贝",
        "pid": "3557"
      },
      {
        "id": "3570",
        "cname": "南部高地",
        "pid": "3557"
      },
      {
        "id": "3571",
        "cname": "钦布",
        "pid": "3557"
      },
      {
        "id": "3572",
        "cname": "桑道恩",
        "pid": "3557"
      },
      {
        "id": "3573",
        "cname": "西部",
        "pid": "3557"
      },
      {
        "id": "3574",
        "cname": "西部高地",
        "pid": "3557"
      },
      {
        "id": "3575",
        "cname": "西新不列颠",
        "pid": "3557"
      },
      {
        "id": "3576",
        "cname": "新爱尔兰",
        "pid": "3557"
      },
      {
        "id": "100225",
        "cname": "其他",
        "pid": "3557"
      }
    ]
  },
  {
    "id": "3577",
    "cname": "巴哈马",
    "pid": ""
  },
  {
    "id": "3578",
    "cname": "巴基斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "3579",
        "cname": "白沙瓦",
        "pid": "3578"
      },
      {
        "id": "3580",
        "cname": "费萨拉巴德",
        "pid": "3578"
      },
      {
        "id": "3581",
        "cname": "故吉软瓦拉",
        "pid": "3578"
      },
      {
        "id": "3582",
        "cname": "海德拉巴",
        "pid": "3578"
      },
      {
        "id": "3583",
        "cname": "卡拉奇",
        "pid": "3578"
      },
      {
        "id": "3584",
        "cname": "拉合尔",
        "pid": "3578"
      },
      {
        "id": "3585",
        "cname": "拉瓦尔品第",
        "pid": "3578"
      },
      {
        "id": "3586",
        "cname": "木尔坦",
        "pid": "3578"
      },
      {
        "id": "3587",
        "cname": "伊斯兰堡",
        "pid": "3578"
      },
      {
        "id": "100226",
        "cname": "其他",
        "pid": "3578"
      }
    ]
  },
  {
    "id": "3588",
    "cname": "巴拉圭",
    "pid": "",
    "childrens": [
      {
        "id": "3589",
        "cname": "阿曼拜",
        "pid": "3588"
      },
      {
        "id": "3590",
        "cname": "阿耶斯总统省",
        "pid": "3588"
      },
      {
        "id": "3591",
        "cname": "巴拉瓜里",
        "pid": "3588"
      },
      {
        "id": "3592",
        "cname": "博克龙",
        "pid": "3588"
      },
      {
        "id": "3593",
        "cname": "瓜伊拉",
        "pid": "3588"
      },
      {
        "id": "3594",
        "cname": "卡瓜苏",
        "pid": "3588"
      },
      {
        "id": "3595",
        "cname": "卡嫩迪尤",
        "pid": "3588"
      },
      {
        "id": "3596",
        "cname": "卡萨帕",
        "pid": "3588"
      },
      {
        "id": "3597",
        "cname": "康塞普西翁",
        "pid": "3588"
      },
      {
        "id": "3598",
        "cname": "科迪勒拉",
        "pid": "3588"
      },
      {
        "id": "3599",
        "cname": "米西奥内斯",
        "pid": "3588"
      },
      {
        "id": "3600",
        "cname": "涅恩布库",
        "pid": "3588"
      },
      {
        "id": "3601",
        "cname": "上巴拉圭",
        "pid": "3588"
      },
      {
        "id": "3602",
        "cname": "上巴拉那",
        "pid": "3588"
      },
      {
        "id": "3603",
        "cname": "圣佩德罗",
        "pid": "3588"
      },
      {
        "id": "3604",
        "cname": "亚松森特别区",
        "pid": "3588"
      },
      {
        "id": "3605",
        "cname": "伊塔普亚",
        "pid": "3588"
      },
      {
        "id": "3606",
        "cname": "中央",
        "pid": "3588"
      },
      {
        "id": "100047",
        "cname": "其他",
        "pid": "3588"
      }
    ]
  },
  {
    "id": "3607",
    "cname": "巴勒斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "3608",
        "cname": "加沙地带",
        "pid": "3607"
      },
      {
        "id": "3609",
        "cname": "西岸",
        "pid": "3607"
      },
      {
        "id": "100537",
        "cname": "其他",
        "pid": "3607"
      }
    ]
  },
  {
    "id": "3610",
    "cname": "巴林",
    "pid": "",
    "childrens": [
      {
        "id": "3611",
        "cname": "北部",
        "pid": "3610"
      },
      {
        "id": "3612",
        "cname": "哈德",
        "pid": "3610"
      },
      {
        "id": "3613",
        "cname": "哈马德",
        "pid": "3610"
      },
      {
        "id": "3614",
        "cname": "里法",
        "pid": "3610"
      },
      {
        "id": "3615",
        "cname": "麦纳麦",
        "pid": "3610"
      },
      {
        "id": "3616",
        "cname": "穆哈拉格",
        "pid": "3610"
      },
      {
        "id": "3617",
        "cname": "西部",
        "pid": "3610"
      },
      {
        "id": "3618",
        "cname": "伊萨城",
        "pid": "3610"
      },
      {
        "id": "3619",
        "cname": "中部",
        "pid": "3610"
      },
      {
        "id": "100227",
        "cname": "其他",
        "pid": "3610"
      }
    ]
  },
  {
    "id": "3620",
    "cname": "巴拿马",
    "pid": ""
  },
  {
    "id": "3621",
    "cname": "巴西",
    "pid": "",
    "childrens": [
      {
        "id": "3622",
        "cname": "阿克里",
        "pid": "3621"
      },
      {
        "id": "3623",
        "cname": "阿拉戈斯",
        "pid": "3621"
      },
      {
        "id": "3624",
        "cname": "阿马帕",
        "pid": "3621"
      },
      {
        "id": "3625",
        "cname": "巴拉那",
        "pid": "3621"
      },
      {
        "id": "3626",
        "cname": "巴西利亚",
        "pid": "3621"
      },
      {
        "id": "3627",
        "cname": "巴伊亚",
        "pid": "3621"
      },
      {
        "id": "3628",
        "cname": "北里奥格兰德",
        "pid": "3621"
      },
      {
        "id": "3629",
        "cname": "伯南布哥",
        "pid": "3621"
      },
      {
        "id": "3630",
        "cname": "戈亚斯",
        "pid": "3621"
      },
      {
        "id": "3631",
        "cname": "朗多尼亚",
        "pid": "3621"
      },
      {
        "id": "3632",
        "cname": "里约热内卢",
        "pid": "3621"
      },
      {
        "id": "3633",
        "cname": "罗赖马",
        "pid": "3621"
      },
      {
        "id": "3634",
        "cname": "马拉尼昂",
        "pid": "3621"
      },
      {
        "id": "3635",
        "cname": "马托格罗索",
        "pid": "3621"
      },
      {
        "id": "3636",
        "cname": "米纳斯吉拉斯",
        "pid": "3621"
      },
      {
        "id": "3637",
        "cname": "南里奥格兰德",
        "pid": "3621"
      },
      {
        "id": "3638",
        "cname": "南马托格罗索",
        "pid": "3621"
      },
      {
        "id": "3639",
        "cname": "帕拉",
        "pid": "3621"
      },
      {
        "id": "3640",
        "cname": "帕拉伊巴",
        "pid": "3621"
      },
      {
        "id": "3641",
        "cname": "皮奥伊",
        "pid": "3621"
      },
      {
        "id": "3642",
        "cname": "塞阿拉",
        "pid": "3621"
      },
      {
        "id": "3643",
        "cname": "塞尔希培",
        "pid": "3621"
      },
      {
        "id": "3644",
        "cname": "圣埃斯皮里图",
        "pid": "3621"
      },
      {
        "id": "3645",
        "cname": "圣保罗",
        "pid": "3621"
      },
      {
        "id": "3646",
        "cname": "圣卡塔琳娜",
        "pid": "3621"
      },
      {
        "id": "3647",
        "cname": "托坎廷斯",
        "pid": "3621"
      },
      {
        "id": "3648",
        "cname": "亚马孙",
        "pid": "3621"
      },
      {
        "id": "100048",
        "cname": "其他",
        "pid": "3621"
      }
    ]
  },
  {
    "id": "3649",
    "cname": "白俄罗斯",
    "pid": "",
    "childrens": [
      {
        "id": "3650",
        "cname": "布列斯特",
        "pid": "3649"
      },
      {
        "id": "3651",
        "cname": "戈梅利",
        "pid": "3649"
      },
      {
        "id": "3652",
        "cname": "格罗德诺",
        "pid": "3649"
      },
      {
        "id": "3653",
        "cname": "明斯克市",
        "pid": "3649"
      },
      {
        "id": "3654",
        "cname": "莫吉廖夫",
        "pid": "3649"
      },
      {
        "id": "3655",
        "cname": "维捷布斯克",
        "pid": "3649"
      },
      {
        "id": "100228",
        "cname": "其他",
        "pid": "3649"
      }
    ]
  },
  {
    "id": "3656",
    "cname": "百慕大",
    "pid": ""
  },
  {
    "id": "3657",
    "cname": "保加利亚",
    "pid": "",
    "childrens": [
      {
        "id": "3658",
        "cname": "布尔加斯",
        "pid": "3657"
      },
      {
        "id": "3659",
        "cname": "卡斯科伏",
        "pid": "3657"
      },
      {
        "id": "3660",
        "cname": "鲁塞",
        "pid": "3657"
      },
      {
        "id": "3661",
        "cname": "洛维奇",
        "pid": "3657"
      },
      {
        "id": "3662",
        "cname": "蒙塔纳",
        "pid": "3657"
      },
      {
        "id": "3663",
        "cname": "普罗夫迪夫",
        "pid": "3657"
      },
      {
        "id": "3664",
        "cname": "索非亚",
        "pid": "3657"
      },
      {
        "id": "3665",
        "cname": "索非亚市",
        "pid": "3657"
      },
      {
        "id": "3666",
        "cname": "瓦尔纳",
        "pid": "3657"
      },
      {
        "id": "100229",
        "cname": "其他",
        "pid": "3657"
      }
    ]
  },
  {
    "id": "3667",
    "cname": "北马里亚纳群岛",
    "pid": ""
  },
  {
    "id": "3668",
    "cname": "贝宁",
    "pid": "",
    "childrens": [
      {
        "id": "3669",
        "cname": "阿黎博里",
        "pid": "3668"
      },
      {
        "id": "3670",
        "cname": "阿塔科拉",
        "pid": "3668"
      },
      {
        "id": "3671",
        "cname": "滨海",
        "pid": "3668"
      },
      {
        "id": "3672",
        "cname": "波希康市",
        "pid": "3668"
      },
      {
        "id": "3673",
        "cname": "博尔古",
        "pid": "3668"
      },
      {
        "id": "3674",
        "cname": "大西洋",
        "pid": "3668"
      },
      {
        "id": "3675",
        "cname": "高原",
        "pid": "3668"
      },
      {
        "id": "3676",
        "cname": "库福",
        "pid": "3668"
      },
      {
        "id": "3677",
        "cname": "莫诺",
        "pid": "3668"
      },
      {
        "id": "3678",
        "cname": "丘陵",
        "pid": "3668"
      },
      {
        "id": "3679",
        "cname": "韦梅",
        "pid": "3668"
      },
      {
        "id": "3680",
        "cname": "峡谷",
        "pid": "3668"
      },
      {
        "id": "3681",
        "cname": "祖",
        "pid": "3668"
      },
      {
        "id": "100049",
        "cname": "其他",
        "pid": "3668"
      }
    ]
  },
  {
    "id": "3682",
    "cname": "比利时",
    "pid": "",
    "childrens": [
      {
        "id": "3683",
        "cname": "埃诺",
        "pid": "3682"
      },
      {
        "id": "3684",
        "cname": "安特卫普",
        "pid": "3682"
      },
      {
        "id": "3685",
        "cname": "布拉班特-瓦隆",
        "pid": "3682"
      },
      {
        "id": "3686",
        "cname": "布鲁塞尔",
        "pid": "3682"
      },
      {
        "id": "3687",
        "cname": "东佛兰德",
        "pid": "3682"
      },
      {
        "id": "3688",
        "cname": "佛兰芒-布拉班特",
        "pid": "3682"
      },
      {
        "id": "3689",
        "cname": "列日",
        "pid": "3682"
      },
      {
        "id": "3690",
        "cname": "林堡",
        "pid": "3682"
      },
      {
        "id": "3691",
        "cname": "卢森堡",
        "pid": "3682"
      },
      {
        "id": "3692",
        "cname": "那慕尔",
        "pid": "3682"
      },
      {
        "id": "3693",
        "cname": "西佛兰德",
        "pid": "3682"
      },
      {
        "id": "100050",
        "cname": "其他",
        "pid": "3682"
      }
    ]
  },
  {
    "id": "3694",
    "cname": "冰岛",
    "pid": ""
  },
  {
    "id": "3695",
    "cname": "波多黎各",
    "pid": ""
  },
  {
    "id": "3696",
    "cname": "波兰",
    "pid": "",
    "childrens": [
      {
        "id": "3697",
        "cname": "埃尔布隆格",
        "pid": "3696"
      },
      {
        "id": "3698",
        "cname": "奥尔什丁",
        "pid": "3696"
      },
      {
        "id": "3699",
        "cname": "奥斯特罗文卡",
        "pid": "3696"
      },
      {
        "id": "3700",
        "cname": "比得哥什",
        "pid": "3696"
      },
      {
        "id": "3701",
        "cname": "彼得库夫",
        "pid": "3696"
      },
      {
        "id": "3702",
        "cname": "比托姆",
        "pid": "3696"
      },
      {
        "id": "3703",
        "cname": "比亚瓦波德拉斯卡",
        "pid": "3696"
      },
      {
        "id": "3704",
        "cname": "比亚维斯托克",
        "pid": "3696"
      },
      {
        "id": "3705",
        "cname": "波莱",
        "pid": "3696"
      },
      {
        "id": "3706",
        "cname": "波兹南",
        "pid": "3696"
      },
      {
        "id": "3707",
        "cname": "达布罗瓦戈尼察",
        "pid": "3696"
      },
      {
        "id": "3708",
        "cname": "大波兰地区戈茹夫",
        "pid": "3696"
      },
      {
        "id": "3709",
        "cname": "弗罗茨瓦夫",
        "pid": "3696"
      },
      {
        "id": "3710",
        "cname": "弗沃茨瓦韦克",
        "pid": "3696"
      },
      {
        "id": "3711",
        "cname": "格但斯克",
        "pid": "3696"
      },
      {
        "id": "3712",
        "cname": "格丁尼亚",
        "pid": "3696"
      },
      {
        "id": "3713",
        "cname": "格利维采",
        "pid": "3696"
      },
      {
        "id": "3714",
        "cname": "格鲁琼兹",
        "pid": "3696"
      },
      {
        "id": "3715",
        "cname": "海乌姆",
        "pid": "3696"
      },
      {
        "id": "3716",
        "cname": "华沙",
        "pid": "3696"
      },
      {
        "id": "3717",
        "cname": "霍茹夫",
        "pid": "3696"
      },
      {
        "id": "3718",
        "cname": "卡利什",
        "pid": "3696"
      },
      {
        "id": "3719",
        "cname": "卡托维兹",
        "pid": "3696"
      },
      {
        "id": "3720",
        "cname": "凯尔采",
        "pid": "3696"
      },
      {
        "id": "3721",
        "cname": "科宁",
        "pid": "3696"
      },
      {
        "id": "3722",
        "cname": "科沙林",
        "pid": "3696"
      },
      {
        "id": "3723",
        "cname": "克拉科夫",
        "pid": "3696"
      },
      {
        "id": "3724",
        "cname": "克罗斯诺",
        "pid": "3696"
      },
      {
        "id": "3725",
        "cname": "拉多姆",
        "pid": "3696"
      },
      {
        "id": "3726",
        "cname": "莱格尼察",
        "pid": "3696"
      },
      {
        "id": "3727",
        "cname": "莱什诺",
        "pid": "3696"
      },
      {
        "id": "3728",
        "cname": "卢布林",
        "pid": "3696"
      },
      {
        "id": "3729",
        "cname": "鲁达",
        "pid": "3696"
      },
      {
        "id": "3730",
        "cname": "罗兹",
        "pid": "3696"
      },
      {
        "id": "3731",
        "cname": "绿山城",
        "pid": "3696"
      },
      {
        "id": "3732",
        "cname": "米什洛维采",
        "pid": "3696"
      },
      {
        "id": "3733",
        "cname": "皮瓦",
        "pid": "3696"
      },
      {
        "id": "3734",
        "cname": "普热梅希尔",
        "pid": "3696"
      },
      {
        "id": "3735",
        "cname": "普沃茨克",
        "pid": "3696"
      },
      {
        "id": "3736",
        "cname": "切哈努夫",
        "pid": "3696"
      },
      {
        "id": "3737",
        "cname": "热舒夫",
        "pid": "3696"
      },
      {
        "id": "3738",
        "cname": "什切青",
        "pid": "3696"
      },
      {
        "id": "3739",
        "cname": "斯凯尔涅维采",
        "pid": "3696"
      },
      {
        "id": "3740",
        "cname": "斯武普斯克",
        "pid": "3696"
      },
      {
        "id": "3741",
        "cname": "苏瓦乌基",
        "pid": "3696"
      },
      {
        "id": "3742",
        "cname": "索波特",
        "pid": "3696"
      },
      {
        "id": "3743",
        "cname": "索斯诺维茨",
        "pid": "3696"
      },
      {
        "id": "3744",
        "cname": "塔尔努夫",
        "pid": "3696"
      },
      {
        "id": "3745",
        "cname": "塔尔诺布热格",
        "pid": "3696"
      },
      {
        "id": "3746",
        "cname": "特切",
        "pid": "3696"
      },
      {
        "id": "3747",
        "cname": "托伦",
        "pid": "3696"
      },
      {
        "id": "3748",
        "cname": "瓦乌布日赫",
        "pid": "3696"
      },
      {
        "id": "3749",
        "cname": "沃姆扎",
        "pid": "3696"
      },
      {
        "id": "3750",
        "cname": "希米亚诺维采",
        "pid": "3696"
      },
      {
        "id": "3751",
        "cname": "希维诺乌伊希切",
        "pid": "3696"
      },
      {
        "id": "3752",
        "cname": "希维托赫洛维采",
        "pid": "3696"
      },
      {
        "id": "3753",
        "cname": "谢德尔采",
        "pid": "3696"
      },
      {
        "id": "3754",
        "cname": "谢拉兹",
        "pid": "3696"
      },
      {
        "id": "3755",
        "cname": "新松奇",
        "pid": "3696"
      },
      {
        "id": "3756",
        "cname": "雅沃兹诺",
        "pid": "3696"
      },
      {
        "id": "3757",
        "cname": "耶莱尼亚古拉",
        "pid": "3696"
      },
      {
        "id": "3758",
        "cname": "扎布热",
        "pid": "3696"
      },
      {
        "id": "3759",
        "cname": "扎莫希奇",
        "pid": "3696"
      },
      {
        "id": "100051",
        "cname": "其他",
        "pid": "3696"
      }
    ]
  },
  {
    "id": "3760",
    "cname": "玻利维亚",
    "pid": "",
    "childrens": [
      {
        "id": "3761",
        "cname": "奥尔托",
        "pid": "3760"
      },
      {
        "id": "3762",
        "cname": "奥鲁罗",
        "pid": "3760"
      },
      {
        "id": "3763",
        "cname": "贝尼",
        "pid": "3760"
      },
      {
        "id": "3764",
        "cname": "波多西",
        "pid": "3760"
      },
      {
        "id": "3765",
        "cname": "基拉科洛",
        "pid": "3760"
      },
      {
        "id": "3766",
        "cname": "科恰班巴",
        "pid": "3760"
      },
      {
        "id": "3767",
        "cname": "拉巴斯",
        "pid": "3760"
      },
      {
        "id": "3768",
        "cname": "潘多",
        "pid": "3760"
      },
      {
        "id": "3769",
        "cname": "丘基萨卡",
        "pid": "3760"
      },
      {
        "id": "3770",
        "cname": "萨卡巴",
        "pid": "3760"
      },
      {
        "id": "3771",
        "cname": "圣克鲁斯",
        "pid": "3760"
      },
      {
        "id": "3772",
        "cname": "塔里哈",
        "pid": "3760"
      },
      {
        "id": "100134",
        "cname": "其他",
        "pid": "3760"
      }
    ]
  },
  {
    "id": "3773",
    "cname": "波斯尼亚和黑塞哥维那",
    "pid": "",
    "childrens": [
      {
        "id": "3774",
        "cname": "波萨维纳",
        "pid": "3773"
      },
      {
        "id": "3775",
        "cname": "波斯尼亚－波德里涅",
        "pid": "3773"
      },
      {
        "id": "3776",
        "cname": "多米斯拉夫格勒",
        "pid": "3773"
      },
      {
        "id": "3777",
        "cname": "黑塞哥维那－涅雷特瓦",
        "pid": "3773"
      },
      {
        "id": "3778",
        "cname": "萨拉热窝",
        "pid": "3773"
      },
      {
        "id": "3779",
        "cname": "图兹拉－波德里涅",
        "pid": "3773"
      },
      {
        "id": "3780",
        "cname": "乌纳－萨纳",
        "pid": "3773"
      },
      {
        "id": "3781",
        "cname": "西波斯尼亚",
        "pid": "3773"
      },
      {
        "id": "3782",
        "cname": "西黑塞哥维那",
        "pid": "3773"
      },
      {
        "id": "3783",
        "cname": "泽尼察－多博伊",
        "pid": "3773"
      },
      {
        "id": "3784",
        "cname": "中波斯尼亚",
        "pid": "3773"
      },
      {
        "id": "100230",
        "cname": "其他",
        "pid": "3773"
      }
    ]
  },
  {
    "id": "3785",
    "cname": "博茨瓦纳",
    "pid": ""
  },
  {
    "id": "3786",
    "cname": "伯利兹",
    "pid": "",
    "childrens": [
      {
        "id": "3787",
        "cname": "伯利兹",
        "pid": "3786"
      },
      {
        "id": "3788",
        "cname": "橘园",
        "pid": "3786"
      },
      {
        "id": "3789",
        "cname": "卡约",
        "pid": "3786"
      },
      {
        "id": "3790",
        "cname": "科罗萨尔",
        "pid": "3786"
      },
      {
        "id": "3791",
        "cname": "斯坦港",
        "pid": "3786"
      },
      {
        "id": "3792",
        "cname": "托莱多",
        "pid": "3786"
      },
      {
        "id": "100231",
        "cname": "其他",
        "pid": "3786"
      }
    ]
  },
  {
    "id": "3793",
    "cname": "不丹",
    "pid": ""
  },
  {
    "id": "3794",
    "cname": "布基纳法索",
    "pid": "",
    "childrens": [
      {
        "id": "3795",
        "cname": "巴雷",
        "pid": "3794"
      },
      {
        "id": "3796",
        "cname": "巴姆",
        "pid": "3794"
      },
      {
        "id": "3797",
        "cname": "巴瓦",
        "pid": "3794"
      },
      {
        "id": "3798",
        "cname": "巴泽加",
        "pid": "3794"
      },
      {
        "id": "3799",
        "cname": "波尼",
        "pid": "3794"
      },
      {
        "id": "3800",
        "cname": "布尔古",
        "pid": "3794"
      },
      {
        "id": "3801",
        "cname": "布尔基恩德",
        "pid": "3794"
      },
      {
        "id": "3802",
        "cname": "布古里巴",
        "pid": "3794"
      },
      {
        "id": "3803",
        "cname": "冈祖尔古",
        "pid": "3794"
      },
      {
        "id": "3804",
        "cname": "古尔马",
        "pid": "3794"
      },
      {
        "id": "3805",
        "cname": "济罗",
        "pid": "3794"
      },
      {
        "id": "3806",
        "cname": "卡焦戈",
        "pid": "3794"
      },
      {
        "id": "3807",
        "cname": "凯内杜古",
        "pid": "3794"
      },
      {
        "id": "3808",
        "cname": "科蒙加里",
        "pid": "3794"
      },
      {
        "id": "3809",
        "cname": "科莫埃",
        "pid": "3794"
      },
      {
        "id": "3810",
        "cname": "孔皮恩加",
        "pid": "3794"
      },
      {
        "id": "3811",
        "cname": "孔西",
        "pid": "3794"
      },
      {
        "id": "3812",
        "cname": "库尔佩罗戈",
        "pid": "3794"
      },
      {
        "id": "3813",
        "cname": "库尔维奥戈",
        "pid": "3794"
      },
      {
        "id": "3814",
        "cname": "库里滕加",
        "pid": "3794"
      },
      {
        "id": "3815",
        "cname": "雷拉巴",
        "pid": "3794"
      },
      {
        "id": "3816",
        "cname": "罗卢姆",
        "pid": "3794"
      },
      {
        "id": "3817",
        "cname": "穆翁",
        "pid": "3794"
      },
      {
        "id": "3818",
        "cname": "纳门滕加",
        "pid": "3794"
      },
      {
        "id": "3819",
        "cname": "纳乌里",
        "pid": "3794"
      },
      {
        "id": "3820",
        "cname": "纳亚拉",
        "pid": "3794"
      },
      {
        "id": "3821",
        "cname": "尼亚尼亚",
        "pid": "3794"
      },
      {
        "id": "3822",
        "cname": "努姆比埃尔",
        "pid": "3794"
      },
      {
        "id": "3823",
        "cname": "帕索雷",
        "pid": "3794"
      },
      {
        "id": "3824",
        "cname": "塞诺",
        "pid": "3794"
      },
      {
        "id": "3825",
        "cname": "桑吉",
        "pid": "3794"
      },
      {
        "id": "3826",
        "cname": "桑马滕加",
        "pid": "3794"
      },
      {
        "id": "3827",
        "cname": "苏鲁",
        "pid": "3794"
      },
      {
        "id": "3828",
        "cname": "苏姆",
        "pid": "3794"
      },
      {
        "id": "3829",
        "cname": "塔波阿",
        "pid": "3794"
      },
      {
        "id": "3830",
        "cname": "图伊",
        "pid": "3794"
      },
      {
        "id": "3831",
        "cname": "乌埃",
        "pid": "3794"
      },
      {
        "id": "3832",
        "cname": "乌布里滕加",
        "pid": "3794"
      },
      {
        "id": "3833",
        "cname": "乌达兰",
        "pid": "3794"
      },
      {
        "id": "3834",
        "cname": "锡西里",
        "pid": "3794"
      },
      {
        "id": "3835",
        "cname": "亚加",
        "pid": "3794"
      },
      {
        "id": "3836",
        "cname": "亚滕加",
        "pid": "3794"
      },
      {
        "id": "3837",
        "cname": "伊奥巴",
        "pid": "3794"
      },
      {
        "id": "3838",
        "cname": "宗德韦奥戈",
        "pid": "3794"
      },
      {
        "id": "3839",
        "cname": "宗多马",
        "pid": "3794"
      },
      {
        "id": "100232",
        "cname": "其他",
        "pid": "3794"
      }
    ]
  },
  {
    "id": "3840",
    "cname": "布隆迪",
    "pid": "",
    "childrens": [
      {
        "id": "3841",
        "cname": "布班扎",
        "pid": "3840"
      },
      {
        "id": "3842",
        "cname": "布鲁里",
        "pid": "3840"
      },
      {
        "id": "3843",
        "cname": "布琼布拉城市",
        "pid": "3840"
      },
      {
        "id": "3844",
        "cname": "布琼布拉乡村",
        "pid": "3840"
      },
      {
        "id": "3845",
        "cname": "恩戈齐",
        "pid": "3840"
      },
      {
        "id": "3846",
        "cname": "基龙多",
        "pid": "3840"
      },
      {
        "id": "3847",
        "cname": "基特加",
        "pid": "3840"
      },
      {
        "id": "3848",
        "cname": "卡鲁济",
        "pid": "3840"
      },
      {
        "id": "3849",
        "cname": "卡扬扎",
        "pid": "3840"
      },
      {
        "id": "3850",
        "cname": "坎库佐",
        "pid": "3840"
      },
      {
        "id": "3851",
        "cname": "鲁塔纳",
        "pid": "3840"
      },
      {
        "id": "3852",
        "cname": "鲁伊吉",
        "pid": "3840"
      },
      {
        "id": "3853",
        "cname": "马坎巴",
        "pid": "3840"
      },
      {
        "id": "3854",
        "cname": "穆拉姆维亚",
        "pid": "3840"
      },
      {
        "id": "3855",
        "cname": "穆瓦洛",
        "pid": "3840"
      },
      {
        "id": "3856",
        "cname": "穆因加",
        "pid": "3840"
      },
      {
        "id": "3857",
        "cname": "锡比托凯",
        "pid": "3840"
      },
      {
        "id": "100233",
        "cname": "其他",
        "pid": "3840"
      }
    ]
  },
  {
    "id": "3858",
    "cname": "布韦岛",
    "pid": ""
  },
  {
    "id": "3872",
    "cname": "丹麦",
    "pid": "",
    "childrens": [
      {
        "id": "3873",
        "cname": "奥胡斯",
        "pid": "3872"
      },
      {
        "id": "3874",
        "cname": "北日德兰",
        "pid": "3872"
      },
      {
        "id": "3875",
        "cname": "博恩霍尔姆",
        "pid": "3872"
      },
      {
        "id": "3876",
        "cname": "菲特烈堡",
        "pid": "3872"
      },
      {
        "id": "3877",
        "cname": "菲茵",
        "pid": "3872"
      },
      {
        "id": "3878",
        "cname": "哥本哈根",
        "pid": "3872"
      },
      {
        "id": "3879",
        "cname": "里伯",
        "pid": "3872"
      },
      {
        "id": "3880",
        "cname": "灵克宾",
        "pid": "3872"
      },
      {
        "id": "3881",
        "cname": "罗斯基勒",
        "pid": "3872"
      },
      {
        "id": "3882",
        "cname": "南日德兰",
        "pid": "3872"
      },
      {
        "id": "3883",
        "cname": "斯多斯特姆",
        "pid": "3872"
      },
      {
        "id": "3884",
        "cname": "维堡",
        "pid": "3872"
      },
      {
        "id": "3885",
        "cname": "维厄勒",
        "pid": "3872"
      },
      {
        "id": "3886",
        "cname": "西希兰",
        "pid": "3872"
      },
      {
        "id": "100135",
        "cname": "其他",
        "pid": "3872"
      }
    ]
  },
  {
    "id": "3887",
    "cname": "德国",
    "pid": "",
    "childrens": [
      {
        "id": "3888",
        "cname": "阿恩斯贝格",
        "pid": "3887"
      },
      {
        "id": "3890",
        "cname": "安斯巴格",
        "pid": "3887"
      },
      {
        "id": "3889",
        "cname": "爱尔福特",
        "pid": "3887"
      },
      {
        "id": "3891",
        "cname": "奥格斯堡",
        "pid": "3887"
      },
      {
        "id": "3892",
        "cname": "柏林",
        "pid": "3887"
      },
      {
        "id": "3893",
        "cname": "拜伊罗特",
        "pid": "3887"
      },
      {
        "id": "3894",
        "cname": "比勒费尔德",
        "pid": "3887"
      },
      {
        "id": "3895",
        "cname": "波茨坦",
        "pid": "3887"
      },
      {
        "id": "3896",
        "cname": "波鸿",
        "pid": "3887"
      },
      {
        "id": "3897",
        "cname": "不来梅",
        "pid": "3887"
      },
      {
        "id": "3898",
        "cname": "不伦瑞克",
        "pid": "3887"
      },
      {
        "id": "3899",
        "cname": "达姆施塔特",
        "pid": "3887"
      },
      {
        "id": "3900",
        "cname": "代特莫尔特",
        "pid": "3887"
      },
      {
        "id": "3901",
        "cname": "德累斯顿",
        "pid": "3887"
      },
      {
        "id": "3902",
        "cname": "德绍",
        "pid": "3887"
      },
      {
        "id": "3903",
        "cname": "杜塞尔多夫",
        "pid": "3887"
      },
      {
        "id": "3904",
        "cname": "法兰克福",
        "pid": "3887"
      },
      {
        "id": "3905",
        "cname": "弗赖堡",
        "pid": "3887"
      },
      {
        "id": "3906",
        "cname": "哈雷",
        "pid": "3887"
      },
      {
        "id": "3907",
        "cname": "汉堡",
        "pid": "3887"
      },
      {
        "id": "3908",
        "cname": "汉诺威",
        "pid": "3887"
      },
      {
        "id": "3909",
        "cname": "基尔",
        "pid": "3887"
      },
      {
        "id": "3910",
        "cname": "吉森",
        "pid": "3887"
      },
      {
        "id": "3911",
        "cname": "卡尔斯鲁厄",
        "pid": "3887"
      },
      {
        "id": "3912",
        "cname": "卡塞尔",
        "pid": "3887"
      },
      {
        "id": "3913",
        "cname": "开姆尼斯",
        "pid": "3887"
      },
      {
        "id": "3914",
        "cname": "科布伦次",
        "pid": "3887"
      },
      {
        "id": "3915",
        "cname": "科隆",
        "pid": "3887"
      },
      {
        "id": "3916",
        "cname": "莱比锡",
        "pid": "3887"
      },
      {
        "id": "3917",
        "cname": "兰茨胡特",
        "pid": "3887"
      },
      {
        "id": "3918",
        "cname": "吕讷堡",
        "pid": "3887"
      },
      {
        "id": "3919",
        "cname": "马格德堡",
        "pid": "3887"
      },
      {
        "id": "3920",
        "cname": "曼海姆",
        "pid": "3887"
      },
      {
        "id": "3921",
        "cname": "美因兹",
        "pid": "3887"
      },
      {
        "id": "3922",
        "cname": "明斯特",
        "pid": "3887"
      },
      {
        "id": "3923",
        "cname": "慕尼黑",
        "pid": "3887"
      },
      {
        "id": "3924",
        "cname": "纽伦堡",
        "pid": "3887"
      },
      {
        "id": "3925",
        "cname": "什未林",
        "pid": "3887"
      },
      {
        "id": "3926",
        "cname": "斯图加特",
        "pid": "3887"
      },
      {
        "id": "3927",
        "cname": "特里尔",
        "pid": "3887"
      },
      {
        "id": "3928",
        "cname": "威斯巴登",
        "pid": "3887"
      },
      {
        "id": "3929",
        "cname": "维尔茨堡",
        "pid": "3887"
      },
      {
        "id": "100052",
        "cname": "其他",
        "pid": "3887"
      }
    ]
  },
  {
    "id": "3930",
    "cname": "东帝汶",
    "pid": "",
    "childrens": [
      {
        "id": "3931",
        "cname": "阿伊莱乌",
        "pid": "3930"
      },
      {
        "id": "3932",
        "cname": "阿伊纳罗",
        "pid": "3930"
      },
      {
        "id": "3933",
        "cname": "埃尔梅拉",
        "pid": "3930"
      },
      {
        "id": "3934",
        "cname": "安贝诺",
        "pid": "3930"
      },
      {
        "id": "3935",
        "cname": "包考",
        "pid": "3930"
      },
      {
        "id": "3936",
        "cname": "博博纳罗",
        "pid": "3930"
      },
      {
        "id": "3937",
        "cname": "帝力",
        "pid": "3930"
      },
      {
        "id": "3938",
        "cname": "科瓦利马",
        "pid": "3930"
      },
      {
        "id": "3939",
        "cname": "劳滕",
        "pid": "3930"
      },
      {
        "id": "3940",
        "cname": "利基卡",
        "pid": "3930"
      },
      {
        "id": "3941",
        "cname": "马纳图托",
        "pid": "3930"
      },
      {
        "id": "3942",
        "cname": "马努法伊",
        "pid": "3930"
      },
      {
        "id": "3943",
        "cname": "维克克",
        "pid": "3930"
      },
      {
        "id": "100053",
        "cname": "其他",
        "pid": "3930"
      }
    ]
  },
  {
    "id": "3944",
    "cname": "多哥",
    "pid": "",
    "childrens": [
      {
        "id": "3945",
        "cname": "滨海区",
        "pid": "3944"
      },
      {
        "id": "3946",
        "cname": "草原区",
        "pid": "3944"
      },
      {
        "id": "3947",
        "cname": "高原区",
        "pid": "3944"
      },
      {
        "id": "3948",
        "cname": "卡拉区",
        "pid": "3944"
      },
      {
        "id": "3949",
        "cname": "中部区",
        "pid": "3944"
      },
      {
        "id": "100234",
        "cname": "其他",
        "pid": "3944"
      }
    ]
  },
  {
    "id": "3950",
    "cname": "多米尼加",
    "pid": ""
  },
  {
    "id": "3951",
    "cname": "多米尼加共和国",
    "pid": ""
  },
  {
    "id": "3952",
    "cname": "俄罗斯",
    "pid": "",
    "childrens": [
      {
        "id": "3953",
        "cname": "阿巴坎",
        "pid": "3952"
      },
      {
        "id": "3954",
        "cname": "阿尔汉格尔斯克",
        "pid": "3952"
      },
      {
        "id": "3955",
        "cname": "阿金斯科耶",
        "pid": "3952"
      },
      {
        "id": "3956",
        "cname": "阿纳德尔",
        "pid": "3952"
      },
      {
        "id": "3957",
        "cname": "阿斯特拉罕",
        "pid": "3952"
      },
      {
        "id": "3958",
        "cname": "埃利斯塔",
        "pid": "3952"
      },
      {
        "id": "3959",
        "cname": "奥廖尔",
        "pid": "3952"
      },
      {
        "id": "3960",
        "cname": "奥伦堡",
        "pid": "3952"
      },
      {
        "id": "3961",
        "cname": "巴尔瑙尔",
        "pid": "3952"
      },
      {
        "id": "3962",
        "cname": "奔萨",
        "pid": "3952"
      },
      {
        "id": "3963",
        "cname": "彼得罗巴甫洛夫斯克",
        "pid": "3952"
      },
      {
        "id": "3964",
        "cname": "彼得罗扎沃茨克",
        "pid": "3952"
      },
      {
        "id": "3965",
        "cname": "彼尔姆",
        "pid": "3952"
      },
      {
        "id": "3966",
        "cname": "比罗比詹",
        "pid": "3952"
      },
      {
        "id": "3967",
        "cname": "别尔哥罗德",
        "pid": "3952"
      },
      {
        "id": "3968",
        "cname": "伯力",
        "pid": "3952"
      },
      {
        "id": "3969",
        "cname": "布拉戈维申斯克",
        "pid": "3952"
      },
      {
        "id": "3970",
        "cname": "布良斯克",
        "pid": "3952"
      },
      {
        "id": "3971",
        "cname": "车里雅宾斯克",
        "pid": "3952"
      },
      {
        "id": "3972",
        "cname": "赤塔",
        "pid": "3952"
      },
      {
        "id": "3973",
        "cname": "顿河畔罗斯托夫",
        "pid": "3952"
      },
      {
        "id": "3974",
        "cname": "鄂木斯克",
        "pid": "3952"
      },
      {
        "id": "3975",
        "cname": "伏尔加格勒",
        "pid": "3952"
      },
      {
        "id": "3976",
        "cname": "弗拉基米尔",
        "pid": "3952"
      },
      {
        "id": "3977",
        "cname": "弗拉季高加索",
        "pid": "3952"
      },
      {
        "id": "3978",
        "cname": "戈尔诺－阿尔泰斯克",
        "pid": "3952"
      },
      {
        "id": "3979",
        "cname": "格罗兹尼",
        "pid": "3952"
      },
      {
        "id": "3980",
        "cname": "海参崴",
        "pid": "3952"
      },
      {
        "id": "3981",
        "cname": "汉特－曼西斯克",
        "pid": "3952"
      },
      {
        "id": "3982",
        "cname": "基洛夫",
        "pid": "3952"
      },
      {
        "id": "3983",
        "cname": "加里宁格勒",
        "pid": "3952"
      },
      {
        "id": "3984",
        "cname": "喀山",
        "pid": "3952"
      },
      {
        "id": "3985",
        "cname": "卡卢加",
        "pid": "3952"
      },
      {
        "id": "3986",
        "cname": "科斯特罗马",
        "pid": "3952"
      },
      {
        "id": "3987",
        "cname": "克拉斯诺达尔",
        "pid": "3952"
      },
      {
        "id": "3988",
        "cname": "克拉斯诺亚尔斯克",
        "pid": "3952"
      },
      {
        "id": "3989",
        "cname": "克麦罗沃",
        "pid": "3952"
      },
      {
        "id": "3990",
        "cname": "克孜勒",
        "pid": "3952"
      },
      {
        "id": "3991",
        "cname": "库德姆卡尔",
        "pid": "3952"
      },
      {
        "id": "3992",
        "cname": "库尔干",
        "pid": "3952"
      },
      {
        "id": "3993",
        "cname": "库尔斯克",
        "pid": "3952"
      },
      {
        "id": "3994",
        "cname": "利佩茨克",
        "pid": "3952"
      },
      {
        "id": "3995",
        "cname": "梁赞",
        "pid": "3952"
      },
      {
        "id": "3996",
        "cname": "马哈奇卡拉",
        "pid": "3952"
      },
      {
        "id": "3997",
        "cname": "马加丹",
        "pid": "3952"
      },
      {
        "id": "3998",
        "cname": "马加斯",
        "pid": "3952"
      },
      {
        "id": "3999",
        "cname": "迈科普",
        "pid": "3952"
      },
      {
        "id": "4000",
        "cname": "摩尔曼斯克",
        "pid": "3952"
      },
      {
        "id": "4001",
        "cname": "莫斯科",
        "pid": "3952"
      },
      {
        "id": "4002",
        "cname": "纳尔奇克",
        "pid": "3952"
      },
      {
        "id": "4003",
        "cname": "纳里扬马尔",
        "pid": "3952"
      },
      {
        "id": "4004",
        "cname": "南萨哈林斯克",
        "pid": "3952"
      },
      {
        "id": "4005",
        "cname": "诺夫哥罗德",
        "pid": "3952"
      },
      {
        "id": "4006",
        "cname": "帕拉纳",
        "pid": "3952"
      },
      {
        "id": "4007",
        "cname": "普斯科夫",
        "pid": "3952"
      },
      {
        "id": "4008",
        "cname": "切博克萨雷",
        "pid": "3952"
      },
      {
        "id": "4009",
        "cname": "切尔克斯克",
        "pid": "3952"
      },
      {
        "id": "4010",
        "cname": "秋明",
        "pid": "3952"
      },
      {
        "id": "4011",
        "cname": "萨拉托夫",
        "pid": "3952"
      },
      {
        "id": "4012",
        "cname": "萨兰斯克",
        "pid": "3952"
      },
      {
        "id": "4013",
        "cname": "萨列哈尔德",
        "pid": "3952"
      },
      {
        "id": "4014",
        "cname": "萨马拉",
        "pid": "3952"
      },
      {
        "id": "4015",
        "cname": "瑟克特夫卡尔",
        "pid": "3952"
      },
      {
        "id": "4016",
        "cname": "圣彼得堡",
        "pid": "3952"
      },
      {
        "id": "4017",
        "cname": "斯摩棱斯克",
        "pid": "3952"
      },
      {
        "id": "4018",
        "cname": "斯塔夫罗波尔",
        "pid": "3952"
      },
      {
        "id": "4019",
        "cname": "坦波夫",
        "pid": "3952"
      },
      {
        "id": "4020",
        "cname": "特维尔",
        "pid": "3952"
      },
      {
        "id": "4021",
        "cname": "图拉",
        "pid": "3952"
      },
      {
        "id": "4022",
        "cname": "托木斯克",
        "pid": "3952"
      },
      {
        "id": "4023",
        "cname": "沃罗涅什",
        "pid": "3952"
      },
      {
        "id": "4024",
        "cname": "沃洛格达",
        "pid": "3952"
      },
      {
        "id": "4025",
        "cname": "乌法",
        "pid": "3952"
      },
      {
        "id": "4026",
        "cname": "乌兰乌德",
        "pid": "3952"
      },
      {
        "id": "4027",
        "cname": "乌里扬诺夫斯克",
        "pid": "3952"
      },
      {
        "id": "4028",
        "cname": "乌斯季奥尔登斯基",
        "pid": "3952"
      },
      {
        "id": "4029",
        "cname": "下诺夫哥罗德",
        "pid": "3952"
      },
      {
        "id": "4030",
        "cname": "新西伯利亚",
        "pid": "3952"
      },
      {
        "id": "4031",
        "cname": "雅库茨克",
        "pid": "3952"
      },
      {
        "id": "4032",
        "cname": "雅罗斯拉夫尔",
        "pid": "3952"
      },
      {
        "id": "4033",
        "cname": "叶卡捷林堡",
        "pid": "3952"
      },
      {
        "id": "4034",
        "cname": "伊尔库茨克",
        "pid": "3952"
      },
      {
        "id": "4035",
        "cname": "伊热夫斯克",
        "pid": "3952"
      },
      {
        "id": "4036",
        "cname": "伊万诺沃",
        "pid": "3952"
      },
      {
        "id": "4037",
        "cname": "约什卡尔奥拉",
        "pid": "3952"
      },
      {
        "id": "100054",
        "cname": "其他",
        "pid": "3952"
      }
    ]
  },
  {
    "id": "4038",
    "cname": "厄瓜多尔",
    "pid": "",
    "childrens": [
      {
        "id": "4039",
        "cname": "阿苏艾",
        "pid": "4038"
      },
      {
        "id": "4040",
        "cname": "埃尔奥罗",
        "pid": "4038"
      },
      {
        "id": "4041",
        "cname": "埃斯梅拉尔达斯",
        "pid": "4038"
      },
      {
        "id": "4042",
        "cname": "玻利瓦尔",
        "pid": "4038"
      },
      {
        "id": "4043",
        "cname": "瓜亚斯",
        "pid": "4038"
      },
      {
        "id": "4044",
        "cname": "加拉帕戈斯",
        "pid": "4038"
      },
      {
        "id": "4045",
        "cname": "卡尔奇",
        "pid": "4038"
      },
      {
        "id": "4046",
        "cname": "卡尼亚尔",
        "pid": "4038"
      },
      {
        "id": "4047",
        "cname": "科托帕希",
        "pid": "4038"
      },
      {
        "id": "4048",
        "cname": "洛哈",
        "pid": "4038"
      },
      {
        "id": "4049",
        "cname": "洛斯里奥斯",
        "pid": "4038"
      },
      {
        "id": "4050",
        "cname": "马纳比",
        "pid": "4038"
      },
      {
        "id": "4051",
        "cname": "莫罗纳－圣地亚哥",
        "pid": "4038"
      },
      {
        "id": "4052",
        "cname": "纳波，奥雷利亚纳",
        "pid": "4038"
      },
      {
        "id": "4053",
        "cname": "帕斯塔萨",
        "pid": "4038"
      },
      {
        "id": "4054",
        "cname": "皮钦查",
        "pid": "4038"
      },
      {
        "id": "4055",
        "cname": "钦博拉索",
        "pid": "4038"
      },
      {
        "id": "4056",
        "cname": "萨莫拉－钦奇佩",
        "pid": "4038"
      },
      {
        "id": "4057",
        "cname": "苏昆毕奥斯",
        "pid": "4038"
      },
      {
        "id": "4058",
        "cname": "通古拉瓦",
        "pid": "4038"
      },
      {
        "id": "4059",
        "cname": "因巴布拉",
        "pid": "4038"
      },
      {
        "id": "100055",
        "cname": "其他",
        "pid": "4038"
      }
    ]
  },
  {
    "id": "4060",
    "cname": "厄立特里亚",
    "pid": "",
    "childrens": [
      {
        "id": "4061",
        "cname": "安塞巴",
        "pid": "4060"
      },
      {
        "id": "4062",
        "cname": "北红海",
        "pid": "4060"
      },
      {
        "id": "4063",
        "cname": "加什·巴尔卡",
        "pid": "4060"
      },
      {
        "id": "4064",
        "cname": "南部",
        "pid": "4060"
      },
      {
        "id": "4065",
        "cname": "南红海",
        "pid": "4060"
      },
      {
        "id": "4066",
        "cname": "中部",
        "pid": "4060"
      },
      {
        "id": "100056",
        "cname": "其他",
        "pid": "4060"
      }
    ]
  },
  {
    "id": "4067",
    "cname": "法国",
    "pid": "",
    "childrens": [
      {
        "id": "4068",
        "cname": "阿尔勒",
        "pid": "4067"
      },
      {
        "id": "4069",
        "cname": "阿雅克修",
        "pid": "4067"
      },
      {
        "id": "4070",
        "cname": "艾克斯",
        "pid": "4067"
      },
      {
        "id": "4071",
        "cname": "奥尔良",
        "pid": "4067"
      },
      {
        "id": "4072",
        "cname": "巴黎",
        "pid": "4067"
      },
      {
        "id": "4073",
        "cname": "贝桑松",
        "pid": "4067"
      },
      {
        "id": "4074",
        "cname": "第戎",
        "pid": "4067"
      },
      {
        "id": "4075",
        "cname": "弗雷瑞斯",
        "pid": "4067"
      },
      {
        "id": "4076",
        "cname": "卡昂",
        "pid": "4067"
      },
      {
        "id": "4077",
        "cname": "雷恩",
        "pid": "4067"
      },
      {
        "id": "4078",
        "cname": "里昂",
        "pid": "4067"
      },
      {
        "id": "4079",
        "cname": "里尔",
        "pid": "4067"
      },
      {
        "id": "4080",
        "cname": "利摩日",
        "pid": "4067"
      },
      {
        "id": "4081",
        "cname": "鲁昂",
        "pid": "4067"
      },
      {
        "id": "4082",
        "cname": "马赛",
        "pid": "4067"
      },
      {
        "id": "4083",
        "cname": "梅斯",
        "pid": "4067"
      },
      {
        "id": "4084",
        "cname": "蒙彼利埃",
        "pid": "4067"
      },
      {
        "id": "4085",
        "cname": "南特",
        "pid": "4067"
      },
      {
        "id": "4086",
        "cname": "尼斯",
        "pid": "4067"
      },
      {
        "id": "4087",
        "cname": "沙隆",
        "pid": "4067"
      },
      {
        "id": "4088",
        "cname": "图卢兹",
        "pid": "4067"
      },
      {
        "id": "4089",
        "cname": "瓦朗斯",
        "pid": "4067"
      },
      {
        "id": "4090",
        "cname": "亚眠",
        "pid": "4067"
      },
      {
        "id": "100057",
        "cname": "其他",
        "pid": "4067"
      }
    ]
  },
  {
    "id": "4091",
    "cname": "法罗群岛",
    "pid": ""
  },
  {
    "id": "4092",
    "cname": "法属波利尼西亚",
    "pid": ""
  },
  {
    "id": "4093",
    "cname": "法属圭亚那",
    "pid": ""
  },
  {
    "id": "4094",
    "cname": "法属南部领地",
    "pid": ""
  },
  {
    "id": "4095",
    "cname": "梵蒂冈",
    "pid": ""
  },
  {
    "id": "4096",
    "cname": "菲律宾",
    "pid": "",
    "childrens": [
      {
        "id": "4097",
        "cname": "达沃",
        "pid": "4096"
      },
      {
        "id": "4098",
        "cname": "卡卢坎",
        "pid": "4096"
      },
      {
        "id": "4099",
        "cname": "马尼拉",
        "pid": "4096"
      },
      {
        "id": "4100",
        "cname": "宿务",
        "pid": "4096"
      },
      {
        "id": "100428",
        "cname": "其他",
        "pid": "4096"
      }
    ]
  },
  {
    "id": "4101",
    "cname": "斐济",
    "pid": ""
  },
  {
    "id": "4102",
    "cname": "芬兰",
    "pid": "",
    "childrens": [
      {
        "id": "4103",
        "cname": "埃斯波",
        "pid": "4102"
      },
      {
        "id": "4104",
        "cname": "奥卢",
        "pid": "4102"
      },
      {
        "id": "4105",
        "cname": "波里",
        "pid": "4102"
      },
      {
        "id": "4106",
        "cname": "博尔沃",
        "pid": "4102"
      },
      {
        "id": "4107",
        "cname": "海门林纳",
        "pid": "4102"
      },
      {
        "id": "4108",
        "cname": "赫尔辛基",
        "pid": "4102"
      },
      {
        "id": "4109",
        "cname": "卡亚尼",
        "pid": "4102"
      },
      {
        "id": "4110",
        "cname": "科科拉",
        "pid": "4102"
      },
      {
        "id": "4111",
        "cname": "科特卡",
        "pid": "4102"
      },
      {
        "id": "4112",
        "cname": "库奥皮奥",
        "pid": "4102"
      },
      {
        "id": "4113",
        "cname": "拉赫蒂",
        "pid": "4102"
      },
      {
        "id": "4114",
        "cname": "拉彭兰塔",
        "pid": "4102"
      },
      {
        "id": "4115",
        "cname": "罗瓦涅米",
        "pid": "4102"
      },
      {
        "id": "4116",
        "cname": "玛丽港",
        "pid": "4102"
      },
      {
        "id": "4117",
        "cname": "米凯利",
        "pid": "4102"
      },
      {
        "id": "4118",
        "cname": "坦佩雷",
        "pid": "4102"
      },
      {
        "id": "4119",
        "cname": "图尔库",
        "pid": "4102"
      },
      {
        "id": "4120",
        "cname": "瓦萨",
        "pid": "4102"
      },
      {
        "id": "4121",
        "cname": "万塔",
        "pid": "4102"
      },
      {
        "id": "4122",
        "cname": "约恩苏",
        "pid": "4102"
      },
      {
        "id": "100058",
        "cname": "其他",
        "pid": "4102"
      }
    ]
  },
  {
    "id": "4123",
    "cname": "佛得角",
    "pid": "",
    "childrens": [
      {
        "id": "4124",
        "cname": "保尔",
        "pid": "4123"
      },
      {
        "id": "4125",
        "cname": "波多诺伏",
        "pid": "4123"
      },
      {
        "id": "4126",
        "cname": "博阿维斯塔岛",
        "pid": "4123"
      },
      {
        "id": "4127",
        "cname": "布拉瓦岛",
        "pid": "4123"
      },
      {
        "id": "4128",
        "cname": "大里贝拉",
        "pid": "4123"
      },
      {
        "id": "4129",
        "cname": "福古岛",
        "pid": "4123"
      },
      {
        "id": "4130",
        "cname": "马尤岛",
        "pid": "4123"
      },
      {
        "id": "4131",
        "cname": "莫斯特罗",
        "pid": "4123"
      },
      {
        "id": "4132",
        "cname": "普拉亚",
        "pid": "4123"
      },
      {
        "id": "4133",
        "cname": "萨尔岛",
        "pid": "4123"
      },
      {
        "id": "4134",
        "cname": "圣安唐岛",
        "pid": "4123"
      },
      {
        "id": "4135",
        "cname": "圣地亚哥岛",
        "pid": "4123"
      },
      {
        "id": "4136",
        "cname": "圣多明戈",
        "pid": "4123"
      },
      {
        "id": "4137",
        "cname": "圣菲利普",
        "pid": "4123"
      },
      {
        "id": "4138",
        "cname": "圣卡塔琳娜",
        "pid": "4123"
      },
      {
        "id": "4139",
        "cname": "圣克鲁斯",
        "pid": "4123"
      },
      {
        "id": "4140",
        "cname": "圣米戈尔",
        "pid": "4123"
      },
      {
        "id": "4141",
        "cname": "圣尼古拉岛",
        "pid": "4123"
      },
      {
        "id": "4142",
        "cname": "圣维森特岛",
        "pid": "4123"
      },
      {
        "id": "4143",
        "cname": "塔拉法尔",
        "pid": "4123"
      },
      {
        "id": "100235",
        "cname": "其他",
        "pid": "4123"
      }
    ]
  },
  {
    "id": "4144",
    "cname": "弗兰克群岛",
    "pid": ""
  },
  {
    "id": "4145",
    "cname": "冈比亚",
    "pid": ""
  },
  {
    "id": "4146",
    "cname": "刚果",
    "pid": ""
  },
  {
    "id": "4147",
    "cname": "刚果民主共和国",
    "pid": ""
  },
  {
    "id": "4148",
    "cname": "哥伦比亚",
    "pid": "",
    "childrens": [
      {
        "id": "4149",
        "cname": "阿劳卡",
        "pid": "4148"
      },
      {
        "id": "4150",
        "cname": "安提奥基亚",
        "pid": "4148"
      },
      {
        "id": "4151",
        "cname": "北桑坦德",
        "pid": "4148"
      },
      {
        "id": "4152",
        "cname": "波哥大首都区",
        "pid": "4148"
      },
      {
        "id": "4153",
        "cname": "博利瓦尔",
        "pid": "4148"
      },
      {
        "id": "4154",
        "cname": "博亚卡",
        "pid": "4148"
      },
      {
        "id": "4155",
        "cname": "大西洋",
        "pid": "4148"
      },
      {
        "id": "4156",
        "cname": "瓜维亚雷",
        "pid": "4148"
      },
      {
        "id": "4157",
        "cname": "瓜希拉",
        "pid": "4148"
      },
      {
        "id": "4158",
        "cname": "瓜伊尼亚",
        "pid": "4148"
      },
      {
        "id": "4159",
        "cname": "金迪奥",
        "pid": "4148"
      },
      {
        "id": "4160",
        "cname": "卡尔达斯",
        "pid": "4148"
      },
      {
        "id": "4161",
        "cname": "卡克塔",
        "pid": "4148"
      },
      {
        "id": "4162",
        "cname": "卡萨纳雷",
        "pid": "4148"
      },
      {
        "id": "4163",
        "cname": "考卡",
        "pid": "4148"
      },
      {
        "id": "4164",
        "cname": "考卡山谷",
        "pid": "4148"
      },
      {
        "id": "4165",
        "cname": "科尔多巴",
        "pid": "4148"
      },
      {
        "id": "4166",
        "cname": "昆迪纳马卡",
        "pid": "4148"
      },
      {
        "id": "4167",
        "cname": "利萨拉尔达",
        "pid": "4148"
      },
      {
        "id": "4168",
        "cname": "马格达雷那",
        "pid": "4148"
      },
      {
        "id": "4169",
        "cname": "梅塔",
        "pid": "4148"
      },
      {
        "id": "4170",
        "cname": "纳里尼奥",
        "pid": "4148"
      },
      {
        "id": "4171",
        "cname": "普图马约",
        "pid": "4148"
      },
      {
        "id": "4172",
        "cname": "乔科",
        "pid": "4148"
      },
      {
        "id": "4173",
        "cname": "塞萨尔",
        "pid": "4148"
      },
      {
        "id": "4174",
        "cname": "桑坦德",
        "pid": "4148"
      },
      {
        "id": "4175",
        "cname": "圣安德烈斯-普罗维登西亚",
        "pid": "4148"
      },
      {
        "id": "4176",
        "cname": "苏克雷",
        "pid": "4148"
      },
      {
        "id": "4177",
        "cname": "托利马",
        "pid": "4148"
      },
      {
        "id": "4178",
        "cname": "维查达",
        "pid": "4148"
      },
      {
        "id": "4179",
        "cname": "沃佩斯",
        "pid": "4148"
      },
      {
        "id": "4180",
        "cname": "乌伊拉",
        "pid": "4148"
      },
      {
        "id": "4181",
        "cname": "亚马孙",
        "pid": "4148"
      },
      {
        "id": "100059",
        "cname": "其他",
        "pid": "4148"
      }
    ]
  },
  {
    "id": "4182",
    "cname": "哥斯达黎加",
    "pid": "",
    "childrens": [
      {
        "id": "4183",
        "cname": "阿拉胡埃拉",
        "pid": "4182"
      },
      {
        "id": "4184",
        "cname": "埃雷迪亚",
        "pid": "4182"
      },
      {
        "id": "4185",
        "cname": "瓜纳卡斯特",
        "pid": "4182"
      },
      {
        "id": "4186",
        "cname": "卡塔戈",
        "pid": "4182"
      },
      {
        "id": "4187",
        "cname": "利蒙",
        "pid": "4182"
      },
      {
        "id": "4188",
        "cname": "蓬塔雷纳斯",
        "pid": "4182"
      },
      {
        "id": "4189",
        "cname": "圣何塞",
        "pid": "4182"
      },
      {
        "id": "100060",
        "cname": "其他",
        "pid": "4182"
      }
    ]
  },
  {
    "id": "4190",
    "cname": "格恩西岛",
    "pid": ""
  },
  {
    "id": "4191",
    "cname": "格林纳达",
    "pid": ""
  },
  {
    "id": "4192",
    "cname": "格陵兰",
    "pid": ""
  },
  {
    "id": "4193",
    "cname": "古巴",
    "pid": "",
    "childrens": [
      {
        "id": "4194",
        "cname": "奥尔金",
        "pid": "4193"
      },
      {
        "id": "4195",
        "cname": "比那尔德里奥",
        "pid": "4193"
      },
      {
        "id": "4196",
        "cname": "比亚克拉拉",
        "pid": "4193"
      },
      {
        "id": "4197",
        "cname": "格拉玛",
        "pid": "4193"
      },
      {
        "id": "4198",
        "cname": "关塔那摩",
        "pid": "4193"
      },
      {
        "id": "4199",
        "cname": "哈瓦那",
        "pid": "4193"
      },
      {
        "id": "4200",
        "cname": "哈瓦那城",
        "pid": "4193"
      },
      {
        "id": "4201",
        "cname": "卡马圭",
        "pid": "4193"
      },
      {
        "id": "4202",
        "cname": "拉斯图纳斯",
        "pid": "4193"
      },
      {
        "id": "4203",
        "cname": "马坦萨斯",
        "pid": "4193"
      },
      {
        "id": "4204",
        "cname": "马亚里",
        "pid": "4193"
      },
      {
        "id": "4205",
        "cname": "曼萨尼罗",
        "pid": "4193"
      },
      {
        "id": "4206",
        "cname": "青年岛特区",
        "pid": "4193"
      },
      {
        "id": "4207",
        "cname": "圣地亚哥",
        "pid": "4193"
      },
      {
        "id": "4208",
        "cname": "圣斯皮里图斯",
        "pid": "4193"
      },
      {
        "id": "4209",
        "cname": "西恩富戈斯",
        "pid": "4193"
      },
      {
        "id": "4210",
        "cname": "谢戈德阿维拉",
        "pid": "4193"
      },
      {
        "id": "100136",
        "cname": "其他",
        "pid": "4193"
      }
    ]
  },
  {
    "id": "4211",
    "cname": "瓜德罗普",
    "pid": ""
  },
  {
    "id": "4212",
    "cname": "关岛",
    "pid": ""
  },
  {
    "id": "4213",
    "cname": "圭亚那",
    "pid": "",
    "childrens": [
      {
        "id": "4214",
        "cname": "埃塞奎博群岛-西德梅拉拉",
        "pid": "4213"
      },
      {
        "id": "4215",
        "cname": "巴里马-瓦伊尼",
        "pid": "4213"
      },
      {
        "id": "4216",
        "cname": "波默伦-苏佩纳姆",
        "pid": "4213"
      },
      {
        "id": "4217",
        "cname": "波塔罗-锡帕鲁尼",
        "pid": "4213"
      },
      {
        "id": "4218",
        "cname": "德梅拉拉-马海卡",
        "pid": "4213"
      },
      {
        "id": "4219",
        "cname": "东伯比斯-科兰太因",
        "pid": "4213"
      },
      {
        "id": "4220",
        "cname": "库尤尼-马扎鲁尼",
        "pid": "4213"
      },
      {
        "id": "4221",
        "cname": "马海卡-伯比斯",
        "pid": "4213"
      },
      {
        "id": "4222",
        "cname": "上德梅拉拉-伯比斯",
        "pid": "4213"
      },
      {
        "id": "4223",
        "cname": "上塔库图-上埃塞奎博",
        "pid": "4213"
      },
      {
        "id": "100061",
        "cname": "其他",
        "pid": "4213"
      }
    ]
  },
  {
    "id": "4224",
    "cname": "哈萨克斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "4225",
        "cname": "阿尔卡累克",
        "pid": "4224"
      },
      {
        "id": "4226",
        "cname": "阿克莫拉",
        "pid": "4224"
      },
      {
        "id": "4227",
        "cname": "阿克苏",
        "pid": "4224"
      },
      {
        "id": "4228",
        "cname": "阿克托别",
        "pid": "4224"
      },
      {
        "id": "4229",
        "cname": "阿拉木图",
        "pid": "4224"
      },
      {
        "id": "4230",
        "cname": "阿雷斯",
        "pid": "4224"
      },
      {
        "id": "4231",
        "cname": "阿斯塔纳市",
        "pid": "4224"
      },
      {
        "id": "4232",
        "cname": "阿特劳",
        "pid": "4224"
      },
      {
        "id": "4233",
        "cname": "埃基巴斯图兹",
        "pid": "4224"
      },
      {
        "id": "4234",
        "cname": "巴尔喀什",
        "pid": "4224"
      },
      {
        "id": "4235",
        "cname": "巴甫洛达尔",
        "pid": "4224"
      },
      {
        "id": "4236",
        "cname": "北哈萨克斯坦",
        "pid": "4224"
      },
      {
        "id": "4237",
        "cname": "东哈萨克斯坦",
        "pid": "4224"
      },
      {
        "id": "4238",
        "cname": "济良诺夫斯克",
        "pid": "4224"
      },
      {
        "id": "4239",
        "cname": "江布尔",
        "pid": "4224"
      },
      {
        "id": "4240",
        "cname": "杰兹卡兹甘",
        "pid": "4224"
      },
      {
        "id": "4241",
        "cname": "卡拉干达",
        "pid": "4224"
      },
      {
        "id": "4242",
        "cname": "卡拉扎尔",
        "pid": "4224"
      },
      {
        "id": "4243",
        "cname": "卡普恰盖",
        "pid": "4224"
      },
      {
        "id": "4244",
        "cname": "科斯塔奈",
        "pid": "4224"
      },
      {
        "id": "4245",
        "cname": "克孜勒奥尔达",
        "pid": "4224"
      },
      {
        "id": "4246",
        "cname": "肯套",
        "pid": "4224"
      },
      {
        "id": "4247",
        "cname": "库尔恰托夫",
        "pid": "4224"
      },
      {
        "id": "4248",
        "cname": "利萨科夫斯克",
        "pid": "4224"
      },
      {
        "id": "4249",
        "cname": "列宁诺戈尔斯克",
        "pid": "4224"
      },
      {
        "id": "4250",
        "cname": "鲁德内",
        "pid": "4224"
      },
      {
        "id": "4251",
        "cname": "曼格斯套",
        "pid": "4224"
      },
      {
        "id": "4252",
        "cname": "南哈萨克斯坦",
        "pid": "4224"
      },
      {
        "id": "4253",
        "cname": "萨兰",
        "pid": "4224"
      },
      {
        "id": "4254",
        "cname": "塞梅伊",
        "pid": "4224"
      },
      {
        "id": "4255",
        "cname": "沙赫京斯克",
        "pid": "4224"
      },
      {
        "id": "4256",
        "cname": "斯捷普诺戈尔斯克",
        "pid": "4224"
      },
      {
        "id": "4257",
        "cname": "铁克利",
        "pid": "4224"
      },
      {
        "id": "4258",
        "cname": "铁米尔套",
        "pid": "4224"
      },
      {
        "id": "4259",
        "cname": "突厥斯坦",
        "pid": "4224"
      },
      {
        "id": "4260",
        "cname": "西哈萨克斯坦",
        "pid": "4224"
      },
      {
        "id": "4261",
        "cname": "扎纳奥津",
        "pid": "4224"
      },
      {
        "id": "100062",
        "cname": "其他",
        "pid": "4224"
      }
    ]
  },
  {
    "id": "4262",
    "cname": "海地",
    "pid": ""
  },
  {
    "id": "4263",
    "cname": "韩国",
    "pid": "",
    "childrens": [
      {
        "id": "4264",
        "cname": "大邱",
        "pid": "4263",
        "childrens": [
          {
            "id": "4265",
            "cname": "达城郡",
            "pid": "4264"
          },
          {
            "id": "4266",
            "cname": "大邱",
            "pid": "4264"
          },
          {
            "id": "4267",
            "cname": "寿城区",
            "pid": "4264"
          },
          {
            "id": "100429",
            "cname": "其他",
            "pid": "4264"
          }
        ]
      },
      {
        "id": "4268",
        "cname": "大田",
        "pid": "4263"
      },
      {
        "id": "4269",
        "cname": "釜山",
        "pid": "4263"
      },
      {
        "id": "4270",
        "cname": "光州",
        "pid": "4263"
      },
      {
        "id": "4271",
        "cname": "济州特别自治道",
        "pid": "4263"
      },
      {
        "id": "4272",
        "cname": "江原道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4273",
            "cname": "春川市",
            "pid": "4272"
          },
          {
            "id": "4274",
            "cname": "东海市",
            "pid": "4272"
          },
          {
            "id": "4275",
            "cname": "高城郡",
            "pid": "4272"
          },
          {
            "id": "4276",
            "cname": "横城郡",
            "pid": "4272"
          },
          {
            "id": "4277",
            "cname": "洪川郡",
            "pid": "4272"
          },
          {
            "id": "4278",
            "cname": "华川郡",
            "pid": "4272"
          },
          {
            "id": "4279",
            "cname": "江陵市",
            "pid": "4272"
          },
          {
            "id": "4280",
            "cname": "旌善郡",
            "pid": "4272"
          },
          {
            "id": "4281",
            "cname": "麟蹄郡",
            "pid": "4272"
          },
          {
            "id": "4282",
            "cname": "宁越郡",
            "pid": "4272"
          },
          {
            "id": "4283",
            "cname": "平昌郡",
            "pid": "4272"
          },
          {
            "id": "4284",
            "cname": "三陟市",
            "pid": "4272"
          },
          {
            "id": "4285",
            "cname": "束草市",
            "pid": "4272"
          },
          {
            "id": "4286",
            "cname": "太白市",
            "pid": "4272"
          },
          {
            "id": "4287",
            "cname": "铁原郡",
            "pid": "4272"
          },
          {
            "id": "4288",
            "cname": "襄阳郡",
            "pid": "4272"
          },
          {
            "id": "4289",
            "cname": "杨口郡",
            "pid": "4272"
          },
          {
            "id": "4290",
            "cname": "原州市",
            "pid": "4272"
          },
          {
            "id": "100364",
            "cname": "其他",
            "pid": "4272"
          }
        ]
      },
      {
        "id": "4291",
        "cname": "京畿道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4292",
            "cname": "安城市",
            "pid": "4291"
          },
          {
            "id": "4293",
            "cname": "安山市",
            "pid": "4291"
          },
          {
            "id": "4294",
            "cname": "安养市",
            "pid": "4291"
          },
          {
            "id": "4295",
            "cname": "抱川市",
            "pid": "4291"
          },
          {
            "id": "4296",
            "cname": "城南市",
            "pid": "4291"
          },
          {
            "id": "4297",
            "cname": "东豆川市",
            "pid": "4291"
          },
          {
            "id": "4298",
            "cname": "富川市",
            "pid": "4291"
          },
          {
            "id": "4299",
            "cname": "高阳市",
            "pid": "4291"
          },
          {
            "id": "4300",
            "cname": "光明市",
            "pid": "4291"
          },
          {
            "id": "4301",
            "cname": "广州市",
            "pid": "4291"
          },
          {
            "id": "4302",
            "cname": "果川市",
            "pid": "4291"
          },
          {
            "id": "4303",
            "cname": "河南市",
            "pid": "4291"
          },
          {
            "id": "4304",
            "cname": "华城市",
            "pid": "4291"
          },
          {
            "id": "4305",
            "cname": "加平郡",
            "pid": "4291"
          },
          {
            "id": "4306",
            "cname": "金浦市",
            "pid": "4291"
          },
          {
            "id": "4307",
            "cname": "九里市",
            "pid": "4291"
          },
          {
            "id": "4308",
            "cname": "军浦市",
            "pid": "4291"
          },
          {
            "id": "4309",
            "cname": "骊州郡",
            "pid": "4291"
          },
          {
            "id": "4310",
            "cname": "利川市",
            "pid": "4291"
          },
          {
            "id": "4311",
            "cname": "涟川郡",
            "pid": "4291"
          },
          {
            "id": "4312",
            "cname": "龙仁市",
            "pid": "4291"
          },
          {
            "id": "4313",
            "cname": "南杨州市",
            "pid": "4291"
          },
          {
            "id": "4314",
            "cname": "平泽市",
            "pid": "4291"
          },
          {
            "id": "4315",
            "cname": "坡州市",
            "pid": "4291"
          },
          {
            "id": "4316",
            "cname": "始兴市",
            "pid": "4291"
          },
          {
            "id": "4318",
            "cname": "乌山市",
            "pid": "4291"
          },
          {
            "id": "4319",
            "cname": "扬平郡",
            "pid": "4291"
          },
          {
            "id": "4320",
            "cname": "杨州市",
            "pid": "4291"
          },
          {
            "id": "4321",
            "cname": "仪旺市",
            "pid": "4291"
          },
          {
            "id": "4322",
            "cname": "议政府市",
            "pid": "4291"
          },
          {
            "id": "100063",
            "cname": "其他",
            "pid": "4291"
          }
        ]
      },
      {
        "id": "4323",
        "cname": "庆尚北道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4324",
            "cname": "安东市",
            "pid": "4323"
          },
          {
            "id": "4325",
            "cname": "奉化郡",
            "pid": "4323"
          },
          {
            "id": "4326",
            "cname": "高灵郡",
            "pid": "4323"
          },
          {
            "id": "4327",
            "cname": "龟尾市",
            "pid": "4323"
          },
          {
            "id": "4328",
            "cname": "金泉市",
            "pid": "4323"
          },
          {
            "id": "4329",
            "cname": "军威郡",
            "pid": "4323"
          },
          {
            "id": "4330",
            "cname": "醴泉郡",
            "pid": "4323"
          },
          {
            "id": "4331",
            "cname": "浦项市",
            "pid": "4323"
          },
          {
            "id": "4332",
            "cname": "漆谷郡",
            "pid": "4323"
          },
          {
            "id": "4333",
            "cname": "淸道郡",
            "pid": "4323"
          },
          {
            "id": "4334",
            "cname": "靑松郡",
            "pid": "4323"
          },
          {
            "id": "4335",
            "cname": "庆山市",
            "pid": "4323"
          },
          {
            "id": "4336",
            "cname": "庆州市",
            "pid": "4323"
          },
          {
            "id": "4337",
            "cname": "荣州市",
            "pid": "4323"
          },
          {
            "id": "4338",
            "cname": "尙州市",
            "pid": "4323"
          },
          {
            "id": "4339",
            "cname": "蔚珍郡",
            "pid": "4323"
          },
          {
            "id": "4340",
            "cname": "闻庆市",
            "pid": "4323"
          },
          {
            "id": "4341",
            "cname": "星州郡",
            "pid": "4323"
          },
          {
            "id": "4342",
            "cname": "义城郡",
            "pid": "4323"
          },
          {
            "id": "4343",
            "cname": "英阳郡",
            "pid": "4323"
          },
          {
            "id": "4344",
            "cname": "盈德郡",
            "pid": "4323"
          },
          {
            "id": "4345",
            "cname": "永川市",
            "pid": "4323"
          },
          {
            "id": "4346",
            "cname": "郁陵郡",
            "pid": "4323"
          },
          {
            "id": "100064",
            "cname": "其他",
            "pid": "4323"
          }
        ]
      },
      {
        "id": "4347",
        "cname": "庆尚南道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4348",
            "cname": "昌宁郡",
            "pid": "4347"
          },
          {
            "id": "4349",
            "cname": "昌原市",
            "pid": "4347"
          },
          {
            "id": "4350",
            "cname": "固城郡",
            "pid": "4347"
          },
          {
            "id": "4351",
            "cname": "河东郡",
            "pid": "4347"
          },
          {
            "id": "4352",
            "cname": "金海市",
            "pid": "4347"
          },
          {
            "id": "4353",
            "cname": "晋州市",
            "pid": "4347"
          },
          {
            "id": "4354",
            "cname": "居昌郡",
            "pid": "4347"
          },
          {
            "id": "4355",
            "cname": "巨济市",
            "pid": "4347"
          },
          {
            "id": "4356",
            "cname": "梁山市",
            "pid": "4347"
          },
          {
            "id": "4357",
            "cname": "马山市",
            "pid": "4347"
          },
          {
            "id": "4358",
            "cname": "密阳市",
            "pid": "4347"
          },
          {
            "id": "4359",
            "cname": "南海郡",
            "pid": "4347"
          },
          {
            "id": "4360",
            "cname": "山淸郡",
            "pid": "4347"
          },
          {
            "id": "4361",
            "cname": "泗川市",
            "pid": "4347"
          },
          {
            "id": "4362",
            "cname": "统营市",
            "pid": "4347"
          },
          {
            "id": "4363",
            "cname": "陜川郡",
            "pid": "4347"
          },
          {
            "id": "4364",
            "cname": "咸安郡",
            "pid": "4347"
          },
          {
            "id": "4365",
            "cname": "咸阳郡",
            "pid": "4347"
          },
          {
            "id": "4366",
            "cname": "宜宁郡",
            "pid": "4347"
          },
          {
            "id": "4367",
            "cname": "鎭海市",
            "pid": "4347"
          },
          {
            "id": "100365",
            "cname": "其他",
            "pid": "4347"
          }
        ]
      },
      {
        "id": "4368",
        "cname": "全罗北道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4369",
            "cname": "淳昌郡",
            "pid": "4368"
          },
          {
            "id": "4381",
            "cname": "长水郡",
            "pid": "4368"
          },
          {
            "id": "4370",
            "cname": "扶安郡",
            "pid": "4368"
          },
          {
            "id": "4371",
            "cname": "高敞郡",
            "pid": "4368"
          },
          {
            "id": "4372",
            "cname": "金堤市",
            "pid": "4368"
          },
          {
            "id": "4373",
            "cname": "井邑市",
            "pid": "4368"
          },
          {
            "id": "4374",
            "cname": "茂朱郡",
            "pid": "4368"
          },
          {
            "id": "4375",
            "cname": "南原市",
            "pid": "4368"
          },
          {
            "id": "4376",
            "cname": "全州市",
            "pid": "4368"
          },
          {
            "id": "4377",
            "cname": "群山市",
            "pid": "4368"
          },
          {
            "id": "4378",
            "cname": "任实郡",
            "pid": "4368"
          },
          {
            "id": "4379",
            "cname": "完州郡",
            "pid": "4368"
          },
          {
            "id": "4380",
            "cname": "益山市",
            "pid": "4368"
          },
          {
            "id": "4382",
            "cname": "鎭安郡",
            "pid": "4368"
          },
          {
            "id": "100366",
            "cname": "其他",
            "pid": "4368"
          }
        ]
      },
      {
        "id": "4383",
        "cname": "全罗南道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4384",
            "cname": "宝城郡",
            "pid": "4383"
          },
          {
            "id": "4403",
            "cname": "长城郡",
            "pid": "4383"
          },
          {
            "id": "4404",
            "cname": "长兴郡",
            "pid": "4383"
          },
          {
            "id": "4385",
            "cname": "高兴郡",
            "pid": "4383"
          },
          {
            "id": "4386",
            "cname": "谷城郡",
            "pid": "4383"
          },
          {
            "id": "4387",
            "cname": "莞岛郡",
            "pid": "4383"
          },
          {
            "id": "4388",
            "cname": "光阳市",
            "pid": "4383"
          },
          {
            "id": "4389",
            "cname": "海南郡",
            "pid": "4383"
          },
          {
            "id": "4390",
            "cname": "和顺郡",
            "pid": "4383"
          },
          {
            "id": "4391",
            "cname": "康津郡",
            "pid": "4383"
          },
          {
            "id": "4392",
            "cname": "丽水市",
            "pid": "4383"
          },
          {
            "id": "4393",
            "cname": "灵光郡",
            "pid": "4383"
          },
          {
            "id": "4394",
            "cname": "灵岩郡",
            "pid": "4383"
          },
          {
            "id": "4395",
            "cname": "罗州市",
            "pid": "4383"
          },
          {
            "id": "4396",
            "cname": "木浦市",
            "pid": "4383"
          },
          {
            "id": "4397",
            "cname": "求礼郡",
            "pid": "4383"
          },
          {
            "id": "4398",
            "cname": "顺天市",
            "pid": "4383"
          },
          {
            "id": "4399",
            "cname": "潭阳郡",
            "pid": "4383"
          },
          {
            "id": "4400",
            "cname": "务安郡",
            "pid": "4383"
          },
          {
            "id": "4401",
            "cname": "咸平郡",
            "pid": "4383"
          },
          {
            "id": "4402",
            "cname": "新安郡",
            "pid": "4383"
          },
          {
            "id": "4405",
            "cname": "珍岛郡",
            "pid": "4383"
          },
          {
            "id": "100236",
            "cname": "其他",
            "pid": "4383"
          }
        ]
      },
      {
        "id": "4406",
        "cname": "仁川",
        "pid": "4263"
      },
      {
        "id": "4407",
        "cname": "首尔",
        "pid": "4263"
      },
      {
        "id": "4408",
        "cname": "蔚山",
        "pid": "4263"
      },
      {
        "id": "4409",
        "cname": "忠清北道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4410",
            "cname": "报恩郡",
            "pid": "4409"
          },
          {
            "id": "4412",
            "cname": "丹阳郡",
            "pid": "4409"
          },
          {
            "id": "4413",
            "cname": "堤川市",
            "pid": "4409"
          },
          {
            "id": "4414",
            "cname": "槐山郡",
            "pid": "4409"
          },
          {
            "id": "4415",
            "cname": "淸原郡",
            "pid": "4409"
          },
          {
            "id": "4416",
            "cname": "淸州市",
            "pid": "4409"
          },
          {
            "id": "4417",
            "cname": "沃川郡",
            "pid": "4409"
          },
          {
            "id": "4418",
            "cname": "阴城郡",
            "pid": "4409"
          },
          {
            "id": "4419",
            "cname": "永同郡",
            "pid": "4409"
          },
          {
            "id": "4411",
            "cname": "曾坪郡",
            "pid": "4409"
          },
          {
            "id": "4420",
            "cname": "鎭川郡",
            "pid": "4409"
          },
          {
            "id": "4421",
            "cname": "忠州市",
            "pid": "4409"
          },
          {
            "id": "100237",
            "cname": "其他",
            "pid": "4409"
          }
        ]
      },
      {
        "id": "4422",
        "cname": "忠清南道",
        "pid": "4263",
        "childrens": [
          {
            "id": "4423",
            "cname": "保宁市",
            "pid": "4422"
          },
          {
            "id": "4424",
            "cname": "扶余郡",
            "pid": "4422"
          },
          {
            "id": "4425",
            "cname": "公州市",
            "pid": "4422"
          },
          {
            "id": "4426",
            "cname": "洪城郡",
            "pid": "4422"
          },
          {
            "id": "4427",
            "cname": "鸡龙市",
            "pid": "4422"
          },
          {
            "id": "4428",
            "cname": "锦山郡",
            "pid": "4422"
          },
          {
            "id": "4429",
            "cname": "礼山郡",
            "pid": "4422"
          },
          {
            "id": "4430",
            "cname": "论山市",
            "pid": "4422"
          },
          {
            "id": "4431",
            "cname": "青阳郡",
            "pid": "4422"
          },
          {
            "id": "4432",
            "cname": "瑞山市",
            "pid": "4422"
          },
          {
            "id": "4433",
            "cname": "舒川郡",
            "pid": "4422"
          },
          {
            "id": "4434",
            "cname": "泰安郡",
            "pid": "4422"
          },
          {
            "id": "4435",
            "cname": "唐津郡",
            "pid": "4422"
          },
          {
            "id": "4436",
            "cname": "天安市",
            "pid": "4422"
          },
          {
            "id": "4437",
            "cname": "牙山市",
            "pid": "4422"
          },
          {
            "id": "4438",
            "cname": "燕岐郡",
            "pid": "4422"
          },
          {
            "id": "100238",
            "cname": "其他",
            "pid": "4422"
          }
        ]
      },
      {
        "id": "100430",
        "cname": "其他",
        "pid": "4263"
      }
    ]
  },
  {
    "id": "4439",
    "cname": "荷兰",
    "pid": "",
    "childrens": [
      {
        "id": "4440",
        "cname": "阿尔梅勒",
        "pid": "4439"
      },
      {
        "id": "4441",
        "cname": "阿默斯福特",
        "pid": "4439"
      },
      {
        "id": "4442",
        "cname": "阿姆斯特丹",
        "pid": "4439"
      },
      {
        "id": "4443",
        "cname": "阿纳姆",
        "pid": "4439"
      },
      {
        "id": "4444",
        "cname": "阿珀尔多伦",
        "pid": "4439"
      },
      {
        "id": "4445",
        "cname": "阿森",
        "pid": "4439"
      },
      {
        "id": "4446",
        "cname": "埃德",
        "pid": "4439"
      },
      {
        "id": "4447",
        "cname": "埃门",
        "pid": "4439"
      },
      {
        "id": "4448",
        "cname": "埃因霍芬",
        "pid": "4439"
      },
      {
        "id": "4449",
        "cname": "布雷达",
        "pid": "4439"
      },
      {
        "id": "4450",
        "cname": "蒂尔堡",
        "pid": "4439"
      },
      {
        "id": "4451",
        "cname": "多德雷赫特",
        "pid": "4439"
      },
      {
        "id": "4452",
        "cname": "恩斯赫德",
        "pid": "4439"
      },
      {
        "id": "4453",
        "cname": "格罗宁根",
        "pid": "4439"
      },
      {
        "id": "4454",
        "cname": "哈勒姆",
        "pid": "4439"
      },
      {
        "id": "4455",
        "cname": "海牙",
        "pid": "4439"
      },
      {
        "id": "4456",
        "cname": "霍夫多尔普",
        "pid": "4439"
      },
      {
        "id": "4457",
        "cname": "莱顿",
        "pid": "4439"
      },
      {
        "id": "4458",
        "cname": "莱利斯塔德",
        "pid": "4439"
      },
      {
        "id": "4459",
        "cname": "鹿特丹",
        "pid": "4439"
      },
      {
        "id": "4460",
        "cname": "吕伐登",
        "pid": "4439"
      },
      {
        "id": "4461",
        "cname": "马斯特里赫特",
        "pid": "4439"
      },
      {
        "id": "4462",
        "cname": "米德尔堡",
        "pid": "4439"
      },
      {
        "id": "4463",
        "cname": "奈梅亨",
        "pid": "4439"
      },
      {
        "id": "4464",
        "cname": "斯海尔托亨博思",
        "pid": "4439"
      },
      {
        "id": "4465",
        "cname": "乌得勒支",
        "pid": "4439"
      },
      {
        "id": "4466",
        "cname": "兹沃勒",
        "pid": "4439"
      },
      {
        "id": "4467",
        "cname": "佐特尔梅",
        "pid": "4439"
      },
      {
        "id": "100065",
        "cname": "其他",
        "pid": "4439"
      }
    ]
  },
  {
    "id": "4468",
    "cname": "荷属安地列斯",
    "pid": ""
  },
  {
    "id": "4469",
    "cname": "赫德和麦克唐纳群岛",
    "pid": ""
  },
  {
    "id": "4470",
    "cname": "洪都拉斯",
    "pid": "",
    "childrens": [
      {
        "id": "4471",
        "cname": "阿特兰蒂达",
        "pid": "4470"
      },
      {
        "id": "4472",
        "cname": "埃尔帕拉伊索",
        "pid": "4470"
      },
      {
        "id": "4473",
        "cname": "奥科特佩克",
        "pid": "4470"
      },
      {
        "id": "4474",
        "cname": "奥兰乔",
        "pid": "4470"
      },
      {
        "id": "4475",
        "cname": "弗朗西斯科-莫拉桑",
        "pid": "4470"
      },
      {
        "id": "4476",
        "cname": "格拉西亚斯-阿迪奥斯",
        "pid": "4470"
      },
      {
        "id": "4477",
        "cname": "海湾群岛",
        "pid": "4470"
      },
      {
        "id": "4478",
        "cname": "科尔特斯",
        "pid": "4470"
      },
      {
        "id": "4479",
        "cname": "科隆",
        "pid": "4470"
      },
      {
        "id": "4480",
        "cname": "科马亚瓜",
        "pid": "4470"
      },
      {
        "id": "4481",
        "cname": "科潘",
        "pid": "4470"
      },
      {
        "id": "4482",
        "cname": "拉巴斯",
        "pid": "4470"
      },
      {
        "id": "4483",
        "cname": "伦皮拉",
        "pid": "4470"
      },
      {
        "id": "4484",
        "cname": "乔卢特卡",
        "pid": "4470"
      },
      {
        "id": "4485",
        "cname": "乔罗马",
        "pid": "4470"
      },
      {
        "id": "4486",
        "cname": "山谷",
        "pid": "4470"
      },
      {
        "id": "4487",
        "cname": "圣巴巴拉",
        "pid": "4470"
      },
      {
        "id": "4488",
        "cname": "因蒂布卡",
        "pid": "4470"
      },
      {
        "id": "4489",
        "cname": "约罗",
        "pid": "4470"
      },
      {
        "id": "100066",
        "cname": "其他",
        "pid": "4470"
      }
    ]
  },
  {
    "id": "4490",
    "cname": "基里巴斯",
    "pid": "",
    "childrens": [
      {
        "id": "4491",
        "cname": "菲尼克斯群岛",
        "pid": "4490"
      },
      {
        "id": "4492",
        "cname": "吉尔伯特群岛",
        "pid": "4490"
      },
      {
        "id": "4493",
        "cname": "莱恩群岛",
        "pid": "4490"
      },
      {
        "id": "100457",
        "cname": "其他",
        "pid": "4490"
      }
    ]
  },
  {
    "id": "4494",
    "cname": "吉布提",
    "pid": "",
    "childrens": [
      {
        "id": "4495",
        "cname": "阿里萨比赫区",
        "pid": "4494"
      },
      {
        "id": "4496",
        "cname": "奥博克区",
        "pid": "4494"
      },
      {
        "id": "4497",
        "cname": "迪基勒区",
        "pid": "4494"
      },
      {
        "id": "4498",
        "cname": "塔朱拉区",
        "pid": "4494"
      },
      {
        "id": "100067",
        "cname": "其他",
        "pid": "4494"
      }
    ]
  },
  {
    "id": "4499",
    "cname": "吉尔吉斯斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "4500",
        "cname": "奥什",
        "pid": "4499"
      },
      {
        "id": "4501",
        "cname": "巴特肯",
        "pid": "4499"
      },
      {
        "id": "4502",
        "cname": "比什凯克市",
        "pid": "4499"
      },
      {
        "id": "4503",
        "cname": "楚河",
        "pid": "4499"
      },
      {
        "id": "4504",
        "cname": "贾拉拉巴德",
        "pid": "4499"
      },
      {
        "id": "4505",
        "cname": "卡拉巴尔塔",
        "pid": "4499"
      },
      {
        "id": "4506",
        "cname": "卡拉库尔",
        "pid": "4499"
      },
      {
        "id": "4507",
        "cname": "坎特",
        "pid": "4499"
      },
      {
        "id": "4508",
        "cname": "科克扬加克",
        "pid": "4499"
      },
      {
        "id": "4509",
        "cname": "迈利赛",
        "pid": "4499"
      },
      {
        "id": "4510",
        "cname": "纳伦",
        "pid": "4499"
      },
      {
        "id": "4511",
        "cname": "苏卢克图",
        "pid": "4499"
      },
      {
        "id": "4512",
        "cname": "塔拉斯",
        "pid": "4499"
      },
      {
        "id": "4513",
        "cname": "塔什库梅尔",
        "pid": "4499"
      },
      {
        "id": "4514",
        "cname": "乌兹根",
        "pid": "4499"
      },
      {
        "id": "4515",
        "cname": "伊塞克湖",
        "pid": "4499"
      },
      {
        "id": "100137",
        "cname": "其他",
        "pid": "4499"
      }
    ]
  },
  {
    "id": "4516",
    "cname": "几内亚",
    "pid": "",
    "childrens": [
      {
        "id": "4517",
        "cname": "博凯",
        "pid": "4516"
      },
      {
        "id": "4518",
        "cname": "恩泽雷科雷",
        "pid": "4516"
      },
      {
        "id": "4519",
        "cname": "法拉纳",
        "pid": "4516"
      },
      {
        "id": "4520",
        "cname": "金迪亚",
        "pid": "4516"
      },
      {
        "id": "4521",
        "cname": "康康",
        "pid": "4516"
      },
      {
        "id": "4522",
        "cname": "科纳克里",
        "pid": "4516"
      },
      {
        "id": "4523",
        "cname": "拉贝",
        "pid": "4516"
      },
      {
        "id": "4524",
        "cname": "玛木",
        "pid": "4516"
      },
      {
        "id": "100239",
        "cname": "其他",
        "pid": "4516"
      }
    ]
  },
  {
    "id": "4525",
    "cname": "几内亚比绍",
    "pid": ""
  },
  {
    "id": "4526",
    "cname": "加拿大",
    "pid": "",
    "childrens": [
      {
        "id": "4527",
        "cname": "阿伯茨福",
        "pid": "4526"
      },
      {
        "id": "4528",
        "cname": "埃德蒙顿",
        "pid": "4526"
      },
      {
        "id": "4529",
        "cname": "奥沙瓦",
        "pid": "4526"
      },
      {
        "id": "4530",
        "cname": "巴里",
        "pid": "4526"
      },
      {
        "id": "4531",
        "cname": "布列塔尼角",
        "pid": "4526"
      },
      {
        "id": "4532",
        "cname": "多伦多",
        "pid": "4526"
      },
      {
        "id": "4533",
        "cname": "弗雷德里顿",
        "pid": "4526"
      },
      {
        "id": "4534",
        "cname": "圭尔夫",
        "pid": "4526"
      },
      {
        "id": "4535",
        "cname": "哈利法克斯",
        "pid": "4526"
      },
      {
        "id": "4536",
        "cname": "哈密尔顿",
        "pid": "4526"
      },
      {
        "id": "4537",
        "cname": "怀特霍斯",
        "pid": "4526"
      },
      {
        "id": "4538",
        "cname": "基劳纳",
        "pid": "4526"
      },
      {
        "id": "4539",
        "cname": "基奇纳",
        "pid": "4526"
      },
      {
        "id": "4540",
        "cname": "金斯敦",
        "pid": "4526"
      },
      {
        "id": "4541",
        "cname": "卡里加里",
        "pid": "4526"
      },
      {
        "id": "4542",
        "cname": "魁北克",
        "pid": "4526"
      },
      {
        "id": "4543",
        "cname": "里贾纳",
        "pid": "4526"
      },
      {
        "id": "4544",
        "cname": "伦敦",
        "pid": "4526"
      },
      {
        "id": "4545",
        "cname": "蒙特利尔",
        "pid": "4526"
      },
      {
        "id": "4546",
        "cname": "萨德伯里",
        "pid": "4526"
      },
      {
        "id": "4547",
        "cname": "萨斯卡通",
        "pid": "4526"
      },
      {
        "id": "4548",
        "cname": "三河城",
        "pid": "4526"
      },
      {
        "id": "4549",
        "cname": "桑德贝",
        "pid": "4526"
      },
      {
        "id": "4550",
        "cname": "舍布鲁克",
        "pid": "4526"
      },
      {
        "id": "4551",
        "cname": "圣卡塔琳娜",
        "pid": "4526"
      },
      {
        "id": "4552",
        "cname": "圣约翰斯",
        "pid": "4526"
      },
      {
        "id": "4553",
        "cname": "维多利亚",
        "pid": "4526"
      },
      {
        "id": "4554",
        "cname": "温哥华",
        "pid": "4526"
      },
      {
        "id": "4555",
        "cname": "温尼伯",
        "pid": "4526"
      },
      {
        "id": "4556",
        "cname": "温莎",
        "pid": "4526"
      },
      {
        "id": "4557",
        "cname": "渥太华",
        "pid": "4526"
      },
      {
        "id": "4558",
        "cname": "夏洛特敦",
        "pid": "4526"
      },
      {
        "id": "4559",
        "cname": "耶洛奈夫",
        "pid": "4526"
      },
      {
        "id": "4560",
        "cname": "伊魁特",
        "pid": "4526"
      },
      {
        "id": "100068",
        "cname": "其他",
        "pid": "4526"
      }
    ]
  },
  {
    "id": "4561",
    "cname": "加纳",
    "pid": "",
    "childrens": [
      {
        "id": "4562",
        "cname": "阿散蒂",
        "pid": "4561"
      },
      {
        "id": "4563",
        "cname": "奥布阿西",
        "pid": "4561"
      },
      {
        "id": "4564",
        "cname": "北部",
        "pid": "4561"
      },
      {
        "id": "4565",
        "cname": "布朗阿哈福",
        "pid": "4561"
      },
      {
        "id": "4566",
        "cname": "大阿克拉",
        "pid": "4561"
      },
      {
        "id": "4567",
        "cname": "东部",
        "pid": "4561"
      },
      {
        "id": "4568",
        "cname": "上东部",
        "pid": "4561"
      },
      {
        "id": "4569",
        "cname": "上西部",
        "pid": "4561"
      },
      {
        "id": "4570",
        "cname": "沃尔特",
        "pid": "4561"
      },
      {
        "id": "4571",
        "cname": "西部",
        "pid": "4561"
      },
      {
        "id": "4572",
        "cname": "中部",
        "pid": "4561"
      },
      {
        "id": "100069",
        "cname": "其他",
        "pid": "4561"
      }
    ]
  },
  {
    "id": "4573",
    "cname": "加蓬",
    "pid": "",
    "childrens": [
      {
        "id": "4574",
        "cname": "奥果韦-洛洛",
        "pid": "4573"
      },
      {
        "id": "4575",
        "cname": "奥果韦-伊温多",
        "pid": "4573"
      },
      {
        "id": "4576",
        "cname": "滨海奥果韦",
        "pid": "4573"
      },
      {
        "id": "4577",
        "cname": "恩古涅",
        "pid": "4573"
      },
      {
        "id": "4578",
        "cname": "河口",
        "pid": "4573"
      },
      {
        "id": "4579",
        "cname": "尼扬加",
        "pid": "4573"
      },
      {
        "id": "4580",
        "cname": "上奥果韦",
        "pid": "4573"
      },
      {
        "id": "4581",
        "cname": "沃勒-恩特姆",
        "pid": "4573"
      },
      {
        "id": "4582",
        "cname": "中奥果韦",
        "pid": "4573"
      },
      {
        "id": "100138",
        "cname": "其他",
        "pid": "4573"
      }
    ]
  },
  {
    "id": "4583",
    "cname": "柬埔寨",
    "pid": "",
    "childrens": [
      {
        "id": "4584",
        "cname": "奥多棉吉",
        "pid": "4583"
      },
      {
        "id": "4585",
        "cname": "白马市",
        "pid": "4583"
      },
      {
        "id": "4586",
        "cname": "柏威夏",
        "pid": "4583"
      },
      {
        "id": "4587",
        "cname": "拜林市",
        "pid": "4583"
      },
      {
        "id": "4588",
        "cname": "班迭棉吉",
        "pid": "4583"
      },
      {
        "id": "4589",
        "cname": "磅清扬",
        "pid": "4583"
      },
      {
        "id": "4590",
        "cname": "磅士卑",
        "pid": "4583"
      },
      {
        "id": "4591",
        "cname": "磅同",
        "pid": "4583"
      },
      {
        "id": "4592",
        "cname": "磅湛",
        "pid": "4583"
      },
      {
        "id": "4593",
        "cname": "波罗勉",
        "pid": "4583"
      },
      {
        "id": "4594",
        "cname": "茶胶",
        "pid": "4583"
      },
      {
        "id": "4595",
        "cname": "柴桢",
        "pid": "4583"
      },
      {
        "id": "4596",
        "cname": "干丹",
        "pid": "4583"
      },
      {
        "id": "4597",
        "cname": "戈公",
        "pid": "4583"
      },
      {
        "id": "4598",
        "cname": "贡布",
        "pid": "4583"
      },
      {
        "id": "4599",
        "cname": "金边市",
        "pid": "4583"
      },
      {
        "id": "4600",
        "cname": "桔井",
        "pid": "4583"
      },
      {
        "id": "4601",
        "cname": "腊塔纳基里",
        "pid": "4583"
      },
      {
        "id": "4602",
        "cname": "马德望",
        "pid": "4583"
      },
      {
        "id": "4603",
        "cname": "蒙多基里",
        "pid": "4583"
      },
      {
        "id": "4604",
        "cname": "菩萨",
        "pid": "4583"
      },
      {
        "id": "4605",
        "cname": "上丁",
        "pid": "4583"
      },
      {
        "id": "4606",
        "cname": "西哈努克市",
        "pid": "4583"
      },
      {
        "id": "4607",
        "cname": "暹粒",
        "pid": "4583"
      },
      {
        "id": "100139",
        "cname": "其他",
        "pid": "4583"
      }
    ]
  },
  {
    "id": "4608",
    "cname": "捷克共和国",
    "pid": "",
    "childrens": [
      {
        "id": "4609",
        "cname": "奥洛穆茨",
        "pid": "4608"
      },
      {
        "id": "4610",
        "cname": "比尔森",
        "pid": "4608"
      },
      {
        "id": "4611",
        "cname": "布拉格直辖市",
        "pid": "4608"
      },
      {
        "id": "4612",
        "cname": "赫拉德茨-克拉洛韦",
        "pid": "4608"
      },
      {
        "id": "4613",
        "cname": "卡罗维发利",
        "pid": "4608"
      },
      {
        "id": "4614",
        "cname": "利贝雷克",
        "pid": "4608"
      },
      {
        "id": "4615",
        "cname": "摩拉维亚-西里西亚",
        "pid": "4608"
      },
      {
        "id": "4616",
        "cname": "南摩拉维亚",
        "pid": "4608"
      },
      {
        "id": "4617",
        "cname": "帕尔杜比采",
        "pid": "4608"
      },
      {
        "id": "4618",
        "cname": "维索基纳",
        "pid": "4608"
      },
      {
        "id": "4619",
        "cname": "乌斯季",
        "pid": "4608"
      },
      {
        "id": "4620",
        "cname": "中捷克",
        "pid": "4608"
      },
      {
        "id": "4621",
        "cname": "兹林",
        "pid": "4608"
      },
      {
        "id": "100140",
        "cname": "其他",
        "pid": "4608"
      }
    ]
  },
  {
    "id": "4622",
    "cname": "津巴布韦",
    "pid": "",
    "childrens": [
      {
        "id": "4623",
        "cname": "北马塔贝莱兰",
        "pid": "4622"
      },
      {
        "id": "4624",
        "cname": "布拉瓦约",
        "pid": "4622"
      },
      {
        "id": "4625",
        "cname": "东马绍纳兰",
        "pid": "4622"
      },
      {
        "id": "4626",
        "cname": "哈拉雷",
        "pid": "4622"
      },
      {
        "id": "4627",
        "cname": "马尼卡兰",
        "pid": "4622"
      },
      {
        "id": "4628",
        "cname": "马斯温戈",
        "pid": "4622"
      },
      {
        "id": "4629",
        "cname": "南马塔贝莱兰",
        "pid": "4622"
      },
      {
        "id": "4630",
        "cname": "西马绍纳兰",
        "pid": "4622"
      },
      {
        "id": "4631",
        "cname": "中部",
        "pid": "4622"
      },
      {
        "id": "4632",
        "cname": "中马绍纳兰",
        "pid": "4622"
      },
      {
        "id": "100240",
        "cname": "其他",
        "pid": "4622"
      }
    ]
  },
  {
    "id": "4633",
    "cname": "喀麦隆",
    "pid": "",
    "childrens": [
      {
        "id": "4634",
        "cname": "阿达马瓦",
        "pid": "4633"
      },
      {
        "id": "4635",
        "cname": "北部",
        "pid": "4633"
      },
      {
        "id": "4636",
        "cname": "北端",
        "pid": "4633"
      },
      {
        "id": "4637",
        "cname": "滨海",
        "pid": "4633"
      },
      {
        "id": "4638",
        "cname": "东部",
        "pid": "4633"
      },
      {
        "id": "4639",
        "cname": "南部",
        "pid": "4633"
      },
      {
        "id": "4640",
        "cname": "西北",
        "pid": "4633"
      },
      {
        "id": "4641",
        "cname": "西部",
        "pid": "4633"
      },
      {
        "id": "4642",
        "cname": "西南",
        "pid": "4633"
      },
      {
        "id": "4643",
        "cname": "中央",
        "pid": "4633"
      },
      {
        "id": "100070",
        "cname": "其他",
        "pid": "4633"
      }
    ]
  },
  {
    "id": "4644",
    "cname": "卡塔尔",
    "pid": "",
    "childrens": [
      {
        "id": "4645",
        "cname": "北部",
        "pid": "4644"
      },
      {
        "id": "4646",
        "cname": "多哈",
        "pid": "4644"
      },
      {
        "id": "4647",
        "cname": "古韦里耶",
        "pid": "4644"
      },
      {
        "id": "4648",
        "cname": "豪尔",
        "pid": "4644"
      },
      {
        "id": "4649",
        "cname": "杰里扬拜特奈",
        "pid": "4644"
      },
      {
        "id": "4650",
        "cname": "赖扬",
        "pid": "4644"
      },
      {
        "id": "4651",
        "cname": "沃克拉",
        "pid": "4644"
      },
      {
        "id": "4652",
        "cname": "乌姆锡拉勒",
        "pid": "4644"
      },
      {
        "id": "4653",
        "cname": "朱迈利耶",
        "pid": "4644"
      },
      {
        "id": "100241",
        "cname": "其他",
        "pid": "4644"
      }
    ]
  },
  {
    "id": "4654",
    "cname": "开曼群岛",
    "pid": ""
  },
  {
    "id": "4655",
    "cname": "科科斯群岛",
    "pid": ""
  },
  {
    "id": "4656",
    "cname": "科摩罗",
    "pid": ""
  },
  {
    "id": "4657",
    "cname": "科特迪瓦",
    "pid": "",
    "childrens": [
      {
        "id": "4658",
        "cname": "阿涅比",
        "pid": "4657"
      },
      {
        "id": "4659",
        "cname": "巴芬",
        "pid": "4657"
      },
      {
        "id": "4660",
        "cname": "邦达马河谷",
        "pid": "4657"
      },
      {
        "id": "4661",
        "cname": "登盖莱",
        "pid": "4657"
      },
      {
        "id": "4662",
        "cname": "恩济－科莫埃",
        "pid": "4657"
      },
      {
        "id": "4663",
        "cname": "弗罗马格尔",
        "pid": "4657"
      },
      {
        "id": "4664",
        "cname": "湖泊",
        "pid": "4657"
      },
      {
        "id": "4665",
        "cname": "马拉韦",
        "pid": "4657"
      },
      {
        "id": "4666",
        "cname": "南邦达马",
        "pid": "4657"
      },
      {
        "id": "4667",
        "cname": "南科莫埃",
        "pid": "4657"
      },
      {
        "id": "4668",
        "cname": "萨桑德拉",
        "pid": "4657"
      },
      {
        "id": "4669",
        "cname": "萨瓦纳",
        "pid": "4657"
      },
      {
        "id": "4670",
        "cname": "山地",
        "pid": "4657"
      },
      {
        "id": "4671",
        "cname": "沃罗杜古",
        "pid": "4657"
      },
      {
        "id": "4672",
        "cname": "下萨桑德拉",
        "pid": "4657"
      },
      {
        "id": "4673",
        "cname": "泻湖",
        "pid": "4657"
      },
      {
        "id": "4674",
        "cname": "赞赞",
        "pid": "4657"
      },
      {
        "id": "4675",
        "cname": "中卡瓦利",
        "pid": "4657"
      },
      {
        "id": "4676",
        "cname": "中科莫埃",
        "pid": "4657"
      },
      {
        "id": "100071",
        "cname": "其他",
        "pid": "4657"
      }
    ]
  },
  {
    "id": "4677",
    "cname": "科威特",
    "pid": ""
  },
  {
    "id": "4678",
    "cname": "克罗地亚",
    "pid": "",
    "childrens": [
      {
        "id": "4679",
        "cname": "奥西耶克-巴拉尼亚",
        "pid": "4678"
      },
      {
        "id": "4680",
        "cname": "别洛瓦尔-比洛戈拉",
        "pid": "4678"
      },
      {
        "id": "4681",
        "cname": "滨海和山区",
        "pid": "4678"
      },
      {
        "id": "4682",
        "cname": "波热加-斯拉沃尼亚",
        "pid": "4678"
      },
      {
        "id": "4683",
        "cname": "布罗德-波萨维纳",
        "pid": "4678"
      },
      {
        "id": "4684",
        "cname": "杜布罗夫斯克-内雷特瓦",
        "pid": "4678"
      },
      {
        "id": "4685",
        "cname": "卡尔洛瓦茨",
        "pid": "4678"
      },
      {
        "id": "4686",
        "cname": "科普里夫尼察-克里热夫齐",
        "pid": "4678"
      },
      {
        "id": "4687",
        "cname": "克拉皮纳-扎戈列",
        "pid": "4678"
      },
      {
        "id": "4688",
        "cname": "利卡-塞尼",
        "pid": "4678"
      },
      {
        "id": "4689",
        "cname": "梅吉穆列",
        "pid": "4678"
      },
      {
        "id": "4690",
        "cname": "萨格勒布",
        "pid": "4678"
      },
      {
        "id": "4691",
        "cname": "萨格勒布市",
        "pid": "4678"
      },
      {
        "id": "4692",
        "cname": "斯普利特-达尔马提亚",
        "pid": "4678"
      },
      {
        "id": "4693",
        "cname": "瓦拉日丁",
        "pid": "4678"
      },
      {
        "id": "4694",
        "cname": "维罗维蒂察-波德拉维纳",
        "pid": "4678"
      },
      {
        "id": "4695",
        "cname": "武科瓦尔-斯里耶姆",
        "pid": "4678"
      },
      {
        "id": "4696",
        "cname": "希贝尼克-克宁",
        "pid": "4678"
      },
      {
        "id": "4697",
        "cname": "锡萨克-莫斯拉维纳",
        "pid": "4678"
      },
      {
        "id": "4698",
        "cname": "伊斯特拉",
        "pid": "4678"
      },
      {
        "id": "4699",
        "cname": "扎达尔",
        "pid": "4678"
      },
      {
        "id": "100141",
        "cname": "其他",
        "pid": "4678"
      }
    ]
  },
  {
    "id": "4700",
    "cname": "肯尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "4701",
        "cname": "埃尔格约-马拉奎特",
        "pid": "4700"
      },
      {
        "id": "4702",
        "cname": "巴林戈",
        "pid": "4700"
      },
      {
        "id": "4703",
        "cname": "邦戈马",
        "pid": "4700"
      },
      {
        "id": "4704",
        "cname": "博美特",
        "pid": "4700"
      },
      {
        "id": "4705",
        "cname": "布希亚",
        "pid": "4700"
      },
      {
        "id": "4706",
        "cname": "恩布",
        "pid": "4700"
      },
      {
        "id": "4707",
        "cname": "霍马湾",
        "pid": "4700"
      },
      {
        "id": "4708",
        "cname": "基安布",
        "pid": "4700"
      },
      {
        "id": "4709",
        "cname": "基里菲",
        "pid": "4700"
      },
      {
        "id": "4710",
        "cname": "基里尼亚加",
        "pid": "4700"
      },
      {
        "id": "4711",
        "cname": "基苏木",
        "pid": "4700"
      },
      {
        "id": "4712",
        "cname": "基图伊",
        "pid": "4700"
      },
      {
        "id": "4713",
        "cname": "基西",
        "pid": "4700"
      },
      {
        "id": "4714",
        "cname": "加里萨",
        "pid": "4700"
      },
      {
        "id": "4715",
        "cname": "卡卡梅加",
        "pid": "4700"
      },
      {
        "id": "4716",
        "cname": "卡耶亚多",
        "pid": "4700"
      },
      {
        "id": "4717",
        "cname": "凯里乔",
        "pid": "4700"
      },
      {
        "id": "4718",
        "cname": "夸勒",
        "pid": "4700"
      },
      {
        "id": "4719",
        "cname": "拉木",
        "pid": "4700"
      },
      {
        "id": "4720",
        "cname": "莱基皮亚",
        "pid": "4700"
      },
      {
        "id": "4721",
        "cname": "马查科斯",
        "pid": "4700"
      },
      {
        "id": "4722",
        "cname": "马瓜尼",
        "pid": "4700"
      },
      {
        "id": "4723",
        "cname": "马萨布布",
        "pid": "4700"
      },
      {
        "id": "4724",
        "cname": "曼德拉",
        "pid": "4700"
      },
      {
        "id": "4725",
        "cname": "梅鲁",
        "pid": "4700"
      },
      {
        "id": "4726",
        "cname": "蒙巴萨",
        "pid": "4700"
      },
      {
        "id": "4727",
        "cname": "米戈利",
        "pid": "4700"
      },
      {
        "id": "4728",
        "cname": "穆兰卡",
        "pid": "4700"
      },
      {
        "id": "4729",
        "cname": "纳库鲁",
        "pid": "4700"
      },
      {
        "id": "4730",
        "cname": "纳罗克",
        "pid": "4700"
      },
      {
        "id": "4731",
        "cname": "南迪",
        "pid": "4700"
      },
      {
        "id": "4732",
        "cname": "内罗毕",
        "pid": "4700"
      },
      {
        "id": "4733",
        "cname": "尼蒂",
        "pid": "4700"
      },
      {
        "id": "4734",
        "cname": "尼亚米拉",
        "pid": "4700"
      },
      {
        "id": "4735",
        "cname": "年达鲁阿",
        "pid": "4700"
      },
      {
        "id": "4736",
        "cname": "涅里",
        "pid": "4700"
      },
      {
        "id": "4737",
        "cname": "桑布卢",
        "pid": "4700"
      },
      {
        "id": "4738",
        "cname": "塔纳河",
        "pid": "4700"
      },
      {
        "id": "4739",
        "cname": "泰塔塔维塔",
        "pid": "4700"
      },
      {
        "id": "4740",
        "cname": "特兰斯-恩佐亚",
        "pid": "4700"
      },
      {
        "id": "4741",
        "cname": "图尔卡纳",
        "pid": "4700"
      },
      {
        "id": "4742",
        "cname": "瓦吉尔",
        "pid": "4700"
      },
      {
        "id": "4743",
        "cname": "瓦辛基苏",
        "pid": "4700"
      },
      {
        "id": "4744",
        "cname": "韦希加",
        "pid": "4700"
      },
      {
        "id": "4745",
        "cname": "西波克特",
        "pid": "4700"
      },
      {
        "id": "4746",
        "cname": "夏亚",
        "pid": "4700"
      },
      {
        "id": "4747",
        "cname": "伊希约洛",
        "pid": "4700"
      },
      {
        "id": "4748",
        "cname": "中央",
        "pid": "4700"
      },
      {
        "id": "100072",
        "cname": "其他",
        "pid": "4700"
      }
    ]
  },
  {
    "id": "4749",
    "cname": "库克群岛",
    "pid": ""
  },
  {
    "id": "4750",
    "cname": "拉脱维亚",
    "pid": "",
    "childrens": [
      {
        "id": "4751",
        "cname": "阿卢克斯内",
        "pid": "4750"
      },
      {
        "id": "4752",
        "cname": "爱兹克劳克雷",
        "pid": "4750"
      },
      {
        "id": "4753",
        "cname": "奥格雷",
        "pid": "4750"
      },
      {
        "id": "4754",
        "cname": "巴尔维",
        "pid": "4750"
      },
      {
        "id": "4755",
        "cname": "包斯卡",
        "pid": "4750"
      },
      {
        "id": "4756",
        "cname": "采西斯",
        "pid": "4750"
      },
      {
        "id": "4757",
        "cname": "多贝莱",
        "pid": "4750"
      },
      {
        "id": "4758",
        "cname": "古尔贝内",
        "pid": "4750"
      },
      {
        "id": "4759",
        "cname": "杰卡布皮尔斯",
        "pid": "4750"
      },
      {
        "id": "4760",
        "cname": "克拉斯拉瓦",
        "pid": "4750"
      },
      {
        "id": "4761",
        "cname": "库尔迪加",
        "pid": "4750"
      },
      {
        "id": "4762",
        "cname": "雷泽克内",
        "pid": "4750"
      },
      {
        "id": "4763",
        "cname": "里加",
        "pid": "4750"
      },
      {
        "id": "4764",
        "cname": "利耶帕亚",
        "pid": "4750"
      },
      {
        "id": "4765",
        "cname": "林巴济",
        "pid": "4750"
      },
      {
        "id": "4766",
        "cname": "卢扎",
        "pid": "4750"
      },
      {
        "id": "4767",
        "cname": "马多纳",
        "pid": "4750"
      },
      {
        "id": "4768",
        "cname": "普雷利",
        "pid": "4750"
      },
      {
        "id": "4769",
        "cname": "萨尔杜斯",
        "pid": "4750"
      },
      {
        "id": "4770",
        "cname": "塔尔西",
        "pid": "4750"
      },
      {
        "id": "4771",
        "cname": "陶格夫皮尔斯",
        "pid": "4750"
      },
      {
        "id": "4772",
        "cname": "图库马",
        "pid": "4750"
      },
      {
        "id": "4773",
        "cname": "瓦尔加",
        "pid": "4750"
      },
      {
        "id": "4774",
        "cname": "瓦尔米耶拉",
        "pid": "4750"
      },
      {
        "id": "4775",
        "cname": "文茨皮尔斯",
        "pid": "4750"
      },
      {
        "id": "4776",
        "cname": "叶尔加瓦",
        "pid": "4750"
      },
      {
        "id": "100073",
        "cname": "其他",
        "pid": "4750"
      }
    ]
  },
  {
    "id": "4777",
    "cname": "莱索托",
    "pid": "",
    "childrens": [
      {
        "id": "4778",
        "cname": "伯里亚",
        "pid": "4777"
      },
      {
        "id": "4779",
        "cname": "布塔布泰",
        "pid": "4777"
      },
      {
        "id": "4780",
        "cname": "古廷",
        "pid": "4777"
      },
      {
        "id": "4781",
        "cname": "加查斯内克",
        "pid": "4777"
      },
      {
        "id": "4782",
        "cname": "莱里贝",
        "pid": "4777"
      },
      {
        "id": "4783",
        "cname": "马费滕",
        "pid": "4777"
      },
      {
        "id": "4784",
        "cname": "马塞卢",
        "pid": "4777"
      },
      {
        "id": "4785",
        "cname": "莫哈莱斯胡克",
        "pid": "4777"
      },
      {
        "id": "4786",
        "cname": "莫霍特隆",
        "pid": "4777"
      },
      {
        "id": "4787",
        "cname": "塔巴采卡",
        "pid": "4777"
      },
      {
        "id": "100242",
        "cname": "其他",
        "pid": "4777"
      }
    ]
  },
  {
    "id": "4788",
    "cname": "老挝",
    "pid": "",
    "childrens": [
      {
        "id": "4789",
        "cname": "阿速坡",
        "pid": "4788"
      },
      {
        "id": "4790",
        "cname": "波里坎赛",
        "pid": "4788"
      },
      {
        "id": "4791",
        "cname": "博乔",
        "pid": "4788"
      },
      {
        "id": "4792",
        "cname": "川圹",
        "pid": "4788"
      },
      {
        "id": "4793",
        "cname": "丰沙里",
        "pid": "4788"
      },
      {
        "id": "4794",
        "cname": "甘蒙",
        "pid": "4788"
      },
      {
        "id": "4795",
        "cname": "华潘",
        "pid": "4788"
      },
      {
        "id": "4796",
        "cname": "琅勃拉邦",
        "pid": "4788"
      },
      {
        "id": "4797",
        "cname": "琅南塔",
        "pid": "4788"
      },
      {
        "id": "4798",
        "cname": "赛宋本行政特区",
        "pid": "4788"
      },
      {
        "id": "4799",
        "cname": "色贡",
        "pid": "4788"
      },
      {
        "id": "4800",
        "cname": "沙拉湾",
        "pid": "4788"
      },
      {
        "id": "4801",
        "cname": "沙湾拿吉",
        "pid": "4788"
      },
      {
        "id": "4802",
        "cname": "沙耶武里",
        "pid": "4788"
      },
      {
        "id": "4803",
        "cname": "万象",
        "pid": "4788"
      },
      {
        "id": "4804",
        "cname": "乌多姆赛",
        "pid": "4788"
      },
      {
        "id": "4805",
        "cname": "占巴塞",
        "pid": "4788"
      },
      {
        "id": "100074",
        "cname": "其他",
        "pid": "4788"
      }
    ]
  },
  {
    "id": "4806",
    "cname": "黎巴嫩",
    "pid": "",
    "childrens": [
      {
        "id": "4807",
        "cname": "北部",
        "pid": "4806"
      },
      {
        "id": "4808",
        "cname": "贝卡",
        "pid": "4806"
      },
      {
        "id": "4809",
        "cname": "贝鲁特",
        "pid": "4806"
      },
      {
        "id": "4810",
        "cname": "黎巴嫩山",
        "pid": "4806"
      },
      {
        "id": "4811",
        "cname": "奈拜提耶市",
        "pid": "4806"
      },
      {
        "id": "4812",
        "cname": "南部",
        "pid": "4806"
      },
      {
        "id": "100243",
        "cname": "其他",
        "pid": "4806"
      }
    ]
  },
  {
    "id": "4813",
    "cname": "利比里亚",
    "pid": "",
    "childrens": [
      {
        "id": "4814",
        "cname": "巴波卢",
        "pid": "4813"
      },
      {
        "id": "4815",
        "cname": "邦",
        "pid": "4813"
      },
      {
        "id": "4816",
        "cname": "博波卢",
        "pid": "4813"
      },
      {
        "id": "4817",
        "cname": "博米",
        "pid": "4813"
      },
      {
        "id": "4818",
        "cname": "大巴萨",
        "pid": "4813"
      },
      {
        "id": "4819",
        "cname": "大吉德",
        "pid": "4813"
      },
      {
        "id": "4820",
        "cname": "大角山",
        "pid": "4813"
      },
      {
        "id": "4821",
        "cname": "大克鲁",
        "pid": "4813"
      },
      {
        "id": "4822",
        "cname": "菲什敦",
        "pid": "4813"
      },
      {
        "id": "4823",
        "cname": "吉河",
        "pid": "4813"
      },
      {
        "id": "4824",
        "cname": "里弗塞斯",
        "pid": "4813"
      },
      {
        "id": "4825",
        "cname": "洛法",
        "pid": "4813"
      },
      {
        "id": "4826",
        "cname": "马吉比",
        "pid": "4813"
      },
      {
        "id": "4827",
        "cname": "马里兰",
        "pid": "4813"
      },
      {
        "id": "4828",
        "cname": "蒙特塞拉多",
        "pid": "4813"
      },
      {
        "id": "4829",
        "cname": "宁巴",
        "pid": "4813"
      },
      {
        "id": "4830",
        "cname": "锡诺",
        "pid": "4813"
      },
      {
        "id": "100244",
        "cname": "其他",
        "pid": "4813"
      }
    ]
  },
  {
    "id": "4831",
    "cname": "利比亚",
    "pid": ""
  },
  {
    "id": "4832",
    "cname": "立陶宛",
    "pid": "",
    "childrens": [
      {
        "id": "4833",
        "cname": "阿利图斯",
        "pid": "4832"
      },
      {
        "id": "4834",
        "cname": "考纳斯",
        "pid": "4832"
      },
      {
        "id": "4835",
        "cname": "克莱佩达",
        "pid": "4832"
      },
      {
        "id": "4836",
        "cname": "马里扬泊列",
        "pid": "4832"
      },
      {
        "id": "4837",
        "cname": "帕涅韦日斯",
        "pid": "4832"
      },
      {
        "id": "4838",
        "cname": "陶拉格",
        "pid": "4832"
      },
      {
        "id": "4839",
        "cname": "特尔希艾",
        "pid": "4832"
      },
      {
        "id": "4840",
        "cname": "维尔纽斯",
        "pid": "4832"
      },
      {
        "id": "4841",
        "cname": "乌田纳",
        "pid": "4832"
      },
      {
        "id": "4842",
        "cname": "希奥利艾",
        "pid": "4832"
      },
      {
        "id": "4843",
        "cname": "亚克曼",
        "pid": "4832"
      },
      {
        "id": "100075",
        "cname": "其他",
        "pid": "4832"
      }
    ]
  },
  {
    "id": "4844",
    "cname": "列支敦士登",
    "pid": ""
  },
  {
    "id": "4845",
    "cname": "留尼旺岛",
    "pid": ""
  },
  {
    "id": "4846",
    "cname": "卢森堡",
    "pid": "",
    "childrens": [
      {
        "id": "4847",
        "cname": "迪基希",
        "pid": "4846"
      },
      {
        "id": "4848",
        "cname": "格雷文马赫",
        "pid": "4846"
      },
      {
        "id": "4849",
        "cname": "卢森堡",
        "pid": "4846"
      },
      {
        "id": "100431",
        "cname": "其他",
        "pid": "4846"
      }
    ]
  },
  {
    "id": "4850",
    "cname": "卢旺达",
    "pid": "",
    "childrens": [
      {
        "id": "4851",
        "cname": "比温巴",
        "pid": "4850"
      },
      {
        "id": "4852",
        "cname": "布塔雷",
        "pid": "4850"
      },
      {
        "id": "4853",
        "cname": "恩延扎",
        "pid": "4850"
      },
      {
        "id": "4854",
        "cname": "基本古",
        "pid": "4850"
      },
      {
        "id": "4855",
        "cname": "基布耶",
        "pid": "4850"
      },
      {
        "id": "4856",
        "cname": "基加利-恩加利",
        "pid": "4850"
      },
      {
        "id": "4857",
        "cname": "基加利市",
        "pid": "4850"
      },
      {
        "id": "4858",
        "cname": "吉孔戈罗",
        "pid": "4850"
      },
      {
        "id": "4859",
        "cname": "吉塞尼",
        "pid": "4850"
      },
      {
        "id": "4860",
        "cname": "吉塔拉马",
        "pid": "4850"
      },
      {
        "id": "4861",
        "cname": "卡布加",
        "pid": "4850"
      },
      {
        "id": "4862",
        "cname": "卢瓦马加纳",
        "pid": "4850"
      },
      {
        "id": "4863",
        "cname": "鲁汉戈",
        "pid": "4850"
      },
      {
        "id": "4864",
        "cname": "鲁亨盖里",
        "pid": "4850"
      },
      {
        "id": "4865",
        "cname": "尚古古",
        "pid": "4850"
      },
      {
        "id": "4866",
        "cname": "乌姆塔拉",
        "pid": "4850"
      },
      {
        "id": "100245",
        "cname": "其他",
        "pid": "4850"
      }
    ]
  },
  {
    "id": "4867",
    "cname": "罗马尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "4868",
        "cname": "阿尔巴尤利亚",
        "pid": "4867"
      },
      {
        "id": "4869",
        "cname": "阿拉德",
        "pid": "4867"
      },
      {
        "id": "4870",
        "cname": "奥拉迪亚",
        "pid": "4867"
      },
      {
        "id": "4871",
        "cname": "巴克乌",
        "pid": "4867"
      },
      {
        "id": "4872",
        "cname": "巴亚马雷",
        "pid": "4867"
      },
      {
        "id": "4873",
        "cname": "比斯特里察",
        "pid": "4867"
      },
      {
        "id": "4874",
        "cname": "博托沙尼",
        "pid": "4867"
      },
      {
        "id": "4875",
        "cname": "布加勒斯特",
        "pid": "4867"
      },
      {
        "id": "4876",
        "cname": "布拉索夫",
        "pid": "4867"
      },
      {
        "id": "4877",
        "cname": "布勒伊拉",
        "pid": "4867"
      },
      {
        "id": "4878",
        "cname": "布泽乌",
        "pid": "4867"
      },
      {
        "id": "4879",
        "cname": "德罗贝塔-塞维林堡",
        "pid": "4867"
      },
      {
        "id": "4880",
        "cname": "德瓦",
        "pid": "4867"
      },
      {
        "id": "4881",
        "cname": "蒂米什瓦拉",
        "pid": "4867"
      },
      {
        "id": "4882",
        "cname": "福克沙尼",
        "pid": "4867"
      },
      {
        "id": "4883",
        "cname": "加拉茨",
        "pid": "4867"
      },
      {
        "id": "4884",
        "cname": "久尔久",
        "pid": "4867"
      },
      {
        "id": "4885",
        "cname": "康斯坦察",
        "pid": "4867"
      },
      {
        "id": "4886",
        "cname": "克拉约瓦",
        "pid": "4867"
      },
      {
        "id": "4887",
        "cname": "克勒拉希",
        "pid": "4867"
      },
      {
        "id": "4888",
        "cname": "克卢日纳波卡",
        "pid": "4867"
      },
      {
        "id": "4889",
        "cname": "勒姆尼库沃尔恰",
        "pid": "4867"
      },
      {
        "id": "4890",
        "cname": "雷希察",
        "pid": "4867"
      },
      {
        "id": "4891",
        "cname": "梅尔库里亚丘克",
        "pid": "4867"
      },
      {
        "id": "4892",
        "cname": "皮特什蒂",
        "pid": "4867"
      },
      {
        "id": "4893",
        "cname": "皮亚特拉尼亚姆茨",
        "pid": "4867"
      },
      {
        "id": "4894",
        "cname": "普洛耶什蒂",
        "pid": "4867"
      },
      {
        "id": "4895",
        "cname": "萨图·马雷",
        "pid": "4867"
      },
      {
        "id": "4896",
        "cname": "圣格奥尔基",
        "pid": "4867"
      },
      {
        "id": "4897",
        "cname": "斯拉蒂纳",
        "pid": "4867"
      },
      {
        "id": "4898",
        "cname": "斯洛博齐亚",
        "pid": "4867"
      },
      {
        "id": "4899",
        "cname": "苏恰瓦",
        "pid": "4867"
      },
      {
        "id": "4900",
        "cname": "特尔戈维什泰",
        "pid": "4867"
      },
      {
        "id": "4901",
        "cname": "特尔古穆列什",
        "pid": "4867"
      },
      {
        "id": "4902",
        "cname": "特尔古日乌",
        "pid": "4867"
      },
      {
        "id": "4903",
        "cname": "图尔恰",
        "pid": "4867"
      },
      {
        "id": "4904",
        "cname": "瓦斯卢伊",
        "pid": "4867"
      },
      {
        "id": "4905",
        "cname": "锡比乌",
        "pid": "4867"
      },
      {
        "id": "4906",
        "cname": "雅西",
        "pid": "4867"
      },
      {
        "id": "4907",
        "cname": "亚厉山德里亚",
        "pid": "4867"
      },
      {
        "id": "4908",
        "cname": "扎勒乌",
        "pid": "4867"
      },
      {
        "id": "100076",
        "cname": "其他",
        "pid": "4867"
      }
    ]
  },
  {
    "id": "4909",
    "cname": "马达加斯加",
    "pid": "",
    "childrens": [
      {
        "id": "4910",
        "cname": "安齐拉纳纳",
        "pid": "4909"
      },
      {
        "id": "4911",
        "cname": "菲亚纳兰楚阿",
        "pid": "4909"
      },
      {
        "id": "4912",
        "cname": "马哈赞加",
        "pid": "4909"
      },
      {
        "id": "4913",
        "cname": "塔那那利佛",
        "pid": "4909"
      },
      {
        "id": "4914",
        "cname": "图阿马西拉",
        "pid": "4909"
      },
      {
        "id": "4915",
        "cname": "图利亚拉",
        "pid": "4909"
      },
      {
        "id": "100077",
        "cname": "其他",
        "pid": "4909"
      }
    ]
  },
  {
    "id": "4916",
    "cname": "马尔代夫",
    "pid": "",
    "childrens": [
      {
        "id": "4917",
        "cname": "阿杜",
        "pid": "4916"
      },
      {
        "id": "4918",
        "cname": "北阿里",
        "pid": "4916"
      },
      {
        "id": "4919",
        "cname": "北蒂拉杜马蒂",
        "pid": "4916"
      },
      {
        "id": "4920",
        "cname": "北马洛斯马杜卢",
        "pid": "4916"
      },
      {
        "id": "4921",
        "cname": "北米拉杜马杜卢",
        "pid": "4916"
      },
      {
        "id": "4922",
        "cname": "北尼兰杜",
        "pid": "4916"
      },
      {
        "id": "4923",
        "cname": "北苏瓦迪瓦",
        "pid": "4916"
      },
      {
        "id": "4924",
        "cname": "法迪福卢",
        "pid": "4916"
      },
      {
        "id": "4925",
        "cname": "费利杜",
        "pid": "4916"
      },
      {
        "id": "4926",
        "cname": "福阿穆拉库",
        "pid": "4916"
      },
      {
        "id": "4927",
        "cname": "哈杜马蒂",
        "pid": "4916"
      },
      {
        "id": "4928",
        "cname": "科卢马杜卢",
        "pid": "4916"
      },
      {
        "id": "4929",
        "cname": "马累",
        "pid": "4916"
      },
      {
        "id": "4930",
        "cname": "马累岛",
        "pid": "4916"
      },
      {
        "id": "4931",
        "cname": "穆拉库",
        "pid": "4916"
      },
      {
        "id": "4932",
        "cname": "南阿里",
        "pid": "4916"
      },
      {
        "id": "4933",
        "cname": "南蒂拉杜马蒂",
        "pid": "4916"
      },
      {
        "id": "4934",
        "cname": "南马洛斯马杜卢",
        "pid": "4916"
      },
      {
        "id": "4935",
        "cname": "南米拉杜马杜卢",
        "pid": "4916"
      },
      {
        "id": "4936",
        "cname": "南尼兰杜",
        "pid": "4916"
      },
      {
        "id": "4937",
        "cname": "南苏瓦迪瓦",
        "pid": "4916"
      },
      {
        "id": "100078",
        "cname": "其他",
        "pid": "4916"
      }
    ]
  },
  {
    "id": "4938",
    "cname": "马耳他",
    "pid": ""
  },
  {
    "id": "4939",
    "cname": "马拉维",
    "pid": "",
    "childrens": [
      {
        "id": "4940",
        "cname": "北部区",
        "pid": "4939"
      },
      {
        "id": "4941",
        "cname": "南部区",
        "pid": "4939"
      },
      {
        "id": "4942",
        "cname": "中央区",
        "pid": "4939"
      },
      {
        "id": "100246",
        "cname": "其他",
        "pid": "4939"
      }
    ]
  },
  {
    "id": "4943",
    "cname": "马来西亚",
    "pid": "",
    "childrens": [
      {
        "id": "4944",
        "cname": "槟榔屿",
        "pid": "4943",
        "childrens": [
          {
            "id": "4945",
            "cname": "北海",
            "pid": "4944"
          },
          {
            "id": "4946",
            "cname": "槟城",
            "pid": "4944"
          },
          {
            "id": "4947",
            "cname": "大山脚",
            "pid": "4944"
          },
          {
            "id": "4948",
            "cname": "高渊",
            "pid": "4944"
          },
          {
            "id": "100247",
            "cname": "其他",
            "pid": "4944"
          }
        ]
      },
      {
        "id": "4949",
        "cname": "玻璃市",
        "pid": "4943",
        "childrens": [
          {
            "id": "4950",
            "cname": "加央",
            "pid": "4949"
          },
          {
            "id": "100538",
            "cname": "其他",
            "pid": "4949"
          }
        ]
      },
      {
        "id": "4951",
        "cname": "丁加奴",
        "pid": "4943",
        "childrens": [
          {
            "id": "4952",
            "cname": "甘马挽",
            "pid": "4951"
          },
          {
            "id": "4953",
            "cname": "瓜拉丁加奴",
            "pid": "4951"
          },
          {
            "id": "4954",
            "cname": "龙运",
            "pid": "4951"
          },
          {
            "id": "4955",
            "cname": "马江",
            "pid": "4951"
          },
          {
            "id": "4956",
            "cname": "实兆",
            "pid": "4951"
          },
          {
            "id": "4957",
            "cname": "乌鲁",
            "pid": "4951"
          },
          {
            "id": "4958",
            "cname": "勿述",
            "pid": "4951"
          },
          {
            "id": "100487",
            "cname": "其他",
            "pid": "4951"
          }
        ]
      },
      {
        "id": "4959",
        "cname": "吉打",
        "pid": "4943",
        "childrens": [
          {
            "id": "4960",
            "cname": "巴东得腊",
            "pid": "4959"
          },
          {
            "id": "4961",
            "cname": "笨筒",
            "pid": "4959"
          },
          {
            "id": "4962",
            "cname": "浮罗交怡",
            "pid": "4959"
          },
          {
            "id": "4963",
            "cname": "哥打士打",
            "pid": "4959"
          },
          {
            "id": "4964",
            "cname": "古邦巴素",
            "pid": "4959"
          },
          {
            "id": "4965",
            "cname": "瓜拉姆达",
            "pid": "4959"
          },
          {
            "id": "4966",
            "cname": "华玲",
            "pid": "4959"
          },
          {
            "id": "4967",
            "cname": "居林",
            "pid": "4959"
          },
          {
            "id": "4968",
            "cname": "万拉峇鲁",
            "pid": "4959"
          },
          {
            "id": "100248",
            "cname": "其他",
            "pid": "4959"
          }
        ]
      },
      {
        "id": "4969",
        "cname": "吉兰丹",
        "pid": "4943",
        "childrens": [
          {
            "id": "4970",
            "cname": "巴西富地",
            "pid": "4969"
          },
          {
            "id": "4971",
            "cname": "巴西马",
            "pid": "4969"
          },
          {
            "id": "4972",
            "cname": "丹那美拉",
            "pid": "4969"
          },
          {
            "id": "4973",
            "cname": "道北",
            "pid": "4969"
          },
          {
            "id": "4974",
            "cname": "登卓",
            "pid": "4969"
          },
          {
            "id": "4975",
            "cname": "哥打巴鲁",
            "pid": "4969"
          },
          {
            "id": "4976",
            "cname": "瓜拉吉赖",
            "pid": "4969"
          },
          {
            "id": "4977",
            "cname": "话望生",
            "pid": "4969"
          },
          {
            "id": "4978",
            "cname": "马樟",
            "pid": "4969"
          },
          {
            "id": "4979",
            "cname": "日里",
            "pid": "4969"
          },
          {
            "id": "100249",
            "cname": "其他",
            "pid": "4969"
          }
        ]
      },
      {
        "id": "4980",
        "cname": "吉隆坡",
        "pid": "4943",
        "childrens": [
          {
            "id": "4981",
            "cname": "吉隆坡",
            "pid": "4980"
          },
          {
            "id": "100539",
            "cname": "其他",
            "pid": "4980"
          }
        ]
      },
      {
        "id": "4982",
        "cname": "马六甲",
        "pid": "4943",
        "childrens": [
          {
            "id": "4983",
            "cname": "马六甲市",
            "pid": "4982"
          },
          {
            "id": "4984",
            "cname": "亚罗牙也",
            "pid": "4982"
          },
          {
            "id": "4985",
            "cname": "野新",
            "pid": "4982"
          },
          {
            "id": "100556",
            "cname": "其他",
            "pid": "4982"
          }
        ]
      },
      {
        "id": "4986",
        "cname": "纳闽",
        "pid": "4943",
        "childrens": [
          {
            "id": "4987",
            "cname": "纳闽",
            "pid": "4986"
          },
          {
            "id": "4988",
            "cname": "维多利亚",
            "pid": "4986"
          },
          {
            "id": "100559",
            "cname": "其他",
            "pid": "4986"
          }
        ]
      },
      {
        "id": "4989",
        "cname": "彭亨",
        "pid": "4943",
        "childrens": [
          {
            "id": "4990",
            "cname": "百乐",
            "pid": "4989"
          },
          {
            "id": "4991",
            "cname": "北根",
            "pid": "4989"
          },
          {
            "id": "4992",
            "cname": "淡马鲁",
            "pid": "4989"
          },
          {
            "id": "4993",
            "cname": "而连突",
            "pid": "4989"
          },
          {
            "id": "4994",
            "cname": "关丹",
            "pid": "4989"
          },
          {
            "id": "4995",
            "cname": "金马仑高原",
            "pid": "4989"
          },
          {
            "id": "4996",
            "cname": "劳勿",
            "pid": "4989"
          },
          {
            "id": "4997",
            "cname": "立卑",
            "pid": "4989"
          },
          {
            "id": "4998",
            "cname": "马兰",
            "pid": "4989"
          },
          {
            "id": "4999",
            "cname": "文冬",
            "pid": "4989"
          },
          {
            "id": "5000",
            "cname": "云冰",
            "pid": "4989"
          },
          {
            "id": "100250",
            "cname": "其他",
            "pid": "4989"
          }
        ]
      },
      {
        "id": "5001",
        "cname": "霹雳",
        "pid": "4943",
        "childrens": [
          {
            "id": "5002",
            "cname": "安顺",
            "pid": "5001"
          },
          {
            "id": "5003",
            "cname": "丹绒马",
            "pid": "5001"
          },
          {
            "id": "5004",
            "cname": "和丰",
            "pid": "5001"
          },
          {
            "id": "5005",
            "cname": "紅土坎",
            "pid": "5001"
          },
          {
            "id": "5006",
            "cname": "华都牙也",
            "pid": "5001"
          },
          {
            "id": "5007",
            "cname": "江沙",
            "pid": "5001"
          },
          {
            "id": "5008",
            "cname": "太平",
            "pid": "5001"
          },
          {
            "id": "5009",
            "cname": "怡保",
            "pid": "5001"
          },
          {
            "id": "100079",
            "cname": "其他",
            "pid": "5001"
          }
        ]
      },
      {
        "id": "5010",
        "cname": "柔佛",
        "pid": "4943",
        "childrens": [
          {
            "id": "5011",
            "cname": "笨珍",
            "pid": "5010"
          },
          {
            "id": "5012",
            "cname": "丰盛港",
            "pid": "5010"
          },
          {
            "id": "5013",
            "cname": "哥打丁宜",
            "pid": "5010"
          },
          {
            "id": "5014",
            "cname": "居銮",
            "pid": "5010"
          },
          {
            "id": "5015",
            "cname": "峇株巴辖",
            "pid": "5010"
          },
          {
            "id": "5016",
            "cname": "麻坡",
            "pid": "5010"
          },
          {
            "id": "5017",
            "cname": "昔加末",
            "pid": "5010"
          },
          {
            "id": "5018",
            "cname": "新山",
            "pid": "5010"
          },
          {
            "id": "100251",
            "cname": "其他",
            "pid": "5010"
          }
        ]
      },
      {
        "id": "5019",
        "cname": "森美兰",
        "pid": "4943",
        "childrens": [
          {
            "id": "5020",
            "cname": "波德申",
            "pid": "5019"
          },
          {
            "id": "5021",
            "cname": "淡边",
            "pid": "5019"
          },
          {
            "id": "5022",
            "cname": "芙蓉",
            "pid": "5019"
          },
          {
            "id": "5023",
            "cname": "瓜拉庇劳",
            "pid": "5019"
          },
          {
            "id": "5024",
            "cname": "林茂",
            "pid": "5019"
          },
          {
            "id": "5025",
            "cname": "仁保",
            "pid": "5019"
          },
          {
            "id": "5026",
            "cname": "日叻务",
            "pid": "5019"
          },
          {
            "id": "100252",
            "cname": "其他",
            "pid": "5019"
          }
        ]
      },
      {
        "id": "5027",
        "cname": "沙巴",
        "pid": "4943",
        "childrens": [
          {
            "id": "5028",
            "cname": "吧巴",
            "pid": "5027"
          },
          {
            "id": "5029",
            "cname": "保佛",
            "pid": "5027"
          },
          {
            "id": "5030",
            "cname": "比鲁兰",
            "pid": "5027"
          },
          {
            "id": "5031",
            "cname": "必达士",
            "pid": "5027"
          },
          {
            "id": "5032",
            "cname": "兵南邦",
            "pid": "5027"
          },
          {
            "id": "5033",
            "cname": "担布南",
            "pid": "5027"
          },
          {
            "id": "5034",
            "cname": "丹南",
            "pid": "5027"
          },
          {
            "id": "5035",
            "cname": "斗湖",
            "pid": "5027"
          },
          {
            "id": "5036",
            "cname": "斗亚兰",
            "pid": "5027"
          },
          {
            "id": "5037",
            "cname": "哥打基纳巴鲁",
            "pid": "5027"
          },
          {
            "id": "5038",
            "cname": "哥打马鲁都",
            "pid": "5027"
          },
          {
            "id": "5039",
            "cname": "根地咬",
            "pid": "5027"
          },
          {
            "id": "5040",
            "cname": "古达",
            "pid": "5027"
          },
          {
            "id": "5041",
            "cname": "古打毛律",
            "pid": "5027"
          },
          {
            "id": "5042",
            "cname": "古纳",
            "pid": "5027"
          },
          {
            "id": "5043",
            "cname": "瓜拉班尤",
            "pid": "5027"
          },
          {
            "id": "5044",
            "cname": "京那巴登岸",
            "pid": "5027"
          },
          {
            "id": "5045",
            "cname": "兰脑",
            "pid": "5027"
          },
          {
            "id": "5046",
            "cname": "拿笃",
            "pid": "5027"
          },
          {
            "id": "5047",
            "cname": "纳巴湾",
            "pid": "5027"
          },
          {
            "id": "5048",
            "cname": "山打根",
            "pid": "5027"
          },
          {
            "id": "5049",
            "cname": "西比陶",
            "pid": "5027"
          },
          {
            "id": "5050",
            "cname": "仙本那",
            "pid": "5027"
          },
          {
            "id": "100253",
            "cname": "其他",
            "pid": "5027"
          }
        ]
      },
      {
        "id": "5051",
        "cname": "沙捞越",
        "pid": "4943",
        "childrens": [
          {
            "id": "5052",
            "cname": "古晋",
            "pid": "5051"
          },
          {
            "id": "5053",
            "cname": "加帛",
            "pid": "5051"
          },
          {
            "id": "5054",
            "cname": "林梦",
            "pid": "5051"
          },
          {
            "id": "5055",
            "cname": "美里",
            "pid": "5051"
          },
          {
            "id": "5056",
            "cname": "民都鲁",
            "pid": "5051"
          },
          {
            "id": "5057",
            "cname": "木胶",
            "pid": "5051"
          },
          {
            "id": "5058",
            "cname": "木中",
            "pid": "5051"
          },
          {
            "id": "5059",
            "cname": "三马拉汉",
            "pid": "5051"
          },
          {
            "id": "5060",
            "cname": "斯里阿曼",
            "pid": "5051"
          },
          {
            "id": "5061",
            "cname": "泗里街",
            "pid": "5051"
          },
          {
            "id": "5062",
            "cname": "泗务",
            "pid": "5051"
          },
          {
            "id": "100488",
            "cname": "其他",
            "pid": "5051"
          }
        ]
      },
      {
        "id": "5063",
        "cname": "雪兰莪",
        "pid": "4943",
        "childrens": [
          {
            "id": "5064",
            "cname": "八打灵",
            "pid": "5063"
          },
          {
            "id": "5065",
            "cname": "鹅麦",
            "pid": "5063"
          },
          {
            "id": "5066",
            "cname": "瓜拉冷岳",
            "pid": "5063"
          },
          {
            "id": "5067",
            "cname": "瓜拉雪兰莪",
            "pid": "5063"
          },
          {
            "id": "5068",
            "cname": "沙白安南",
            "pid": "5063"
          },
          {
            "id": "5069",
            "cname": "乌鲁冷岳",
            "pid": "5063"
          },
          {
            "id": "5070",
            "cname": "乌鲁雪兰莪",
            "pid": "5063"
          },
          {
            "id": "5071",
            "cname": "雪邦",
            "pid": "5063"
          },
          {
            "id": "100254",
            "cname": "其他",
            "pid": "5063"
          }
        ]
      }
    ]
  },
  {
    "id": "5072",
    "cname": "马里",
    "pid": "",
    "childrens": [
      {
        "id": "5073",
        "cname": "巴马科首都区",
        "pid": "5072"
      },
      {
        "id": "5074",
        "cname": "基达尔",
        "pid": "5072"
      },
      {
        "id": "5075",
        "cname": "加奥",
        "pid": "5072"
      },
      {
        "id": "5076",
        "cname": "卡伊",
        "pid": "5072"
      },
      {
        "id": "5077",
        "cname": "库利科罗",
        "pid": "5072"
      },
      {
        "id": "5078",
        "cname": "莫普提",
        "pid": "5072"
      },
      {
        "id": "5079",
        "cname": "塞古",
        "pid": "5072"
      },
      {
        "id": "5080",
        "cname": "通布图",
        "pid": "5072"
      },
      {
        "id": "5081",
        "cname": "锡卡索",
        "pid": "5072"
      },
      {
        "id": "100255",
        "cname": "其他",
        "pid": "5072"
      }
    ]
  },
  {
    "id": "5082",
    "cname": "马其顿",
    "pid": ""
  },
  {
    "id": "5083",
    "cname": "马绍尔群岛",
    "pid": ""
  },
  {
    "id": "5084",
    "cname": "马提尼克",
    "pid": ""
  },
  {
    "id": "5085",
    "cname": "马约特岛",
    "pid": ""
  },
  {
    "id": "5086",
    "cname": "曼岛",
    "pid": ""
  },
  {
    "id": "5087",
    "cname": "毛里求斯",
    "pid": ""
  },
  {
    "id": "5088",
    "cname": "毛里塔尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "5089",
        "cname": "阿德拉尔",
        "pid": "5088"
      },
      {
        "id": "5090",
        "cname": "阿萨巴",
        "pid": "5088"
      },
      {
        "id": "5091",
        "cname": "卜拉克纳",
        "pid": "5088"
      },
      {
        "id": "5092",
        "cname": "东胡德",
        "pid": "5088"
      },
      {
        "id": "5093",
        "cname": "戈尔戈勒",
        "pid": "5088"
      },
      {
        "id": "5094",
        "cname": "吉迪马卡",
        "pid": "5088"
      },
      {
        "id": "5095",
        "cname": "努瓦迪布湾",
        "pid": "5088"
      },
      {
        "id": "5096",
        "cname": "努瓦克肖特特区",
        "pid": "5088"
      },
      {
        "id": "5097",
        "cname": "塔甘特",
        "pid": "5088"
      },
      {
        "id": "5098",
        "cname": "特拉扎",
        "pid": "5088"
      },
      {
        "id": "5099",
        "cname": "提里斯-宰穆尔",
        "pid": "5088"
      },
      {
        "id": "5100",
        "cname": "西胡德",
        "pid": "5088"
      },
      {
        "id": "5101",
        "cname": "因希里",
        "pid": "5088"
      },
      {
        "id": "100080",
        "cname": "其他",
        "pid": "5088"
      }
    ]
  },
  {
    "id": "5102",
    "cname": "美国",
    "pid": "",
    "childrens": [
      {
        "id": "5103",
        "cname": "阿肯色",
        "pid": "5102",
        "childrens": [
          {
            "id": "5104",
            "cname": "费耶特维尔",
            "pid": "5103"
          },
          {
            "id": "5105",
            "cname": "史密斯堡",
            "pid": "5103"
          },
          {
            "id": "5106",
            "cname": "小石城",
            "pid": "5103"
          },
          {
            "id": "100458",
            "cname": "其他",
            "pid": "5103"
          }
        ]
      },
      {
        "id": "5107",
        "cname": "阿拉巴马",
        "pid": "5102",
        "childrens": [
          {
            "id": "5108",
            "cname": "伯明罕",
            "pid": "5107"
          },
          {
            "id": "5109",
            "cname": "蒙哥马利",
            "pid": "5107"
          },
          {
            "id": "5110",
            "cname": "莫比尔",
            "pid": "5107"
          },
          {
            "id": "100256",
            "cname": "其他",
            "pid": "5107"
          }
        ]
      },
      {
        "id": "5111",
        "cname": "阿拉斯加",
        "pid": "5102",
        "childrens": [
          {
            "id": "5112",
            "cname": "安克雷奇",
            "pid": "5111"
          },
          {
            "id": "5113",
            "cname": "费尔班克斯",
            "pid": "5111"
          },
          {
            "id": "5114",
            "cname": "朱诺",
            "pid": "5111"
          },
          {
            "id": "100081",
            "cname": "其他",
            "pid": "5111"
          }
        ]
      },
      {
        "id": "5115",
        "cname": "爱达荷",
        "pid": "5102",
        "childrens": [
          {
            "id": "5116",
            "cname": "爱达荷福尔斯",
            "pid": "5115"
          },
          {
            "id": "5117",
            "cname": "波卡特洛",
            "pid": "5115"
          },
          {
            "id": "5118",
            "cname": "博伊西",
            "pid": "5115"
          },
          {
            "id": "5119",
            "cname": "布莱克富特",
            "pid": "5115"
          },
          {
            "id": "5120",
            "cname": "科达伦",
            "pid": "5115"
          },
          {
            "id": "5121",
            "cname": "刘易斯顿",
            "pid": "5115"
          },
          {
            "id": "5122",
            "cname": "莫斯科",
            "pid": "5115"
          },
          {
            "id": "5123",
            "cname": "墨菲",
            "pid": "5115"
          },
          {
            "id": "5124",
            "cname": "楠帕",
            "pid": "5115"
          },
          {
            "id": "5125",
            "cname": "岂彻姆",
            "pid": "5115"
          },
          {
            "id": "5126",
            "cname": "森瓦利",
            "pid": "5115"
          },
          {
            "id": "5127",
            "cname": "亚美利加瀑布城",
            "pid": "5115"
          },
          {
            "id": "100142",
            "cname": "其他",
            "pid": "5115"
          }
        ]
      },
      {
        "id": "5128",
        "cname": "爱荷华",
        "pid": "5102",
        "childrens": [
          {
            "id": "5129",
            "cname": "达文波特",
            "pid": "5128"
          },
          {
            "id": "5130",
            "cname": "得梅因",
            "pid": "5128"
          },
          {
            "id": "5131",
            "cname": "锡达拉皮兹",
            "pid": "5128"
          },
          {
            "id": "100432",
            "cname": "其他",
            "pid": "5128"
          }
        ]
      },
      {
        "id": "5132",
        "cname": "北达科他",
        "pid": "5102",
        "childrens": [
          {
            "id": "5133",
            "cname": "俾斯麦",
            "pid": "5132"
          },
          {
            "id": "5134",
            "cname": "大福克斯",
            "pid": "5132"
          },
          {
            "id": "5135",
            "cname": "法戈",
            "pid": "5132"
          },
          {
            "id": "5136",
            "cname": "迈诺特",
            "pid": "5132"
          },
          {
            "id": "100257",
            "cname": "其他",
            "pid": "5132"
          }
        ]
      },
      {
        "id": "5137",
        "cname": "北卡罗来纳",
        "pid": "5102",
        "childrens": [
          {
            "id": "5138",
            "cname": "艾许维尔",
            "pid": "5137"
          },
          {
            "id": "5139",
            "cname": "杜罕",
            "pid": "5137"
          },
          {
            "id": "5140",
            "cname": "格林斯伯勒",
            "pid": "5137"
          },
          {
            "id": "5141",
            "cname": "教堂山",
            "pid": "5137"
          },
          {
            "id": "5142",
            "cname": "罗利",
            "pid": "5137"
          },
          {
            "id": "5143",
            "cname": "洛利杜罕都会区",
            "pid": "5137"
          },
          {
            "id": "5144",
            "cname": "夏洛特",
            "pid": "5137"
          },
          {
            "id": "100143",
            "cname": "其他",
            "pid": "5137"
          }
        ]
      },
      {
        "id": "5145",
        "cname": "宾夕法尼亚",
        "pid": "5102",
        "childrens": [
          {
            "id": "5146",
            "cname": "阿伦敦",
            "pid": "5145"
          },
          {
            "id": "5147",
            "cname": "费城",
            "pid": "5145"
          },
          {
            "id": "5148",
            "cname": "匹兹堡",
            "pid": "5145"
          },
          {
            "id": "100082",
            "cname": "其他",
            "pid": "5145"
          }
        ]
      },
      {
        "id": "5149",
        "cname": "德克萨斯",
        "pid": "5102",
        "childrens": [
          {
            "id": "5150",
            "cname": "埃尔帕索",
            "pid": "5149"
          },
          {
            "id": "5151",
            "cname": "奥斯汀",
            "pid": "5149"
          },
          {
            "id": "5152",
            "cname": "达拉斯",
            "pid": "5149"
          },
          {
            "id": "5153",
            "cname": "哥帕斯基斯蒂",
            "pid": "5149"
          },
          {
            "id": "5154",
            "cname": "交维斯顿",
            "pid": "5149"
          },
          {
            "id": "5155",
            "cname": "拉雷多",
            "pid": "5149"
          },
          {
            "id": "5156",
            "cname": "麦亚伦",
            "pid": "5149"
          },
          {
            "id": "5157",
            "cname": "圣安东尼奥",
            "pid": "5149"
          },
          {
            "id": "5158",
            "cname": "休斯敦",
            "pid": "5149"
          },
          {
            "id": "100083",
            "cname": "其他",
            "pid": "5149"
          }
        ]
      },
      {
        "id": "5159",
        "cname": "俄亥俄",
        "pid": "5102",
        "childrens": [
          {
            "id": "5160",
            "cname": "代顿",
            "pid": "5159"
          },
          {
            "id": "5161",
            "cname": "哥伦布",
            "pid": "5159"
          },
          {
            "id": "5162",
            "cname": "克利夫兰",
            "pid": "5159"
          },
          {
            "id": "5163",
            "cname": "托莱多",
            "pid": "5159"
          },
          {
            "id": "5164",
            "cname": "辛辛那提",
            "pid": "5159"
          },
          {
            "id": "100433",
            "cname": "其他",
            "pid": "5159"
          }
        ]
      },
      {
        "id": "5165",
        "cname": "俄克拉荷马",
        "pid": "5102",
        "childrens": [
          {
            "id": "5166",
            "cname": "俄克拉荷马城",
            "pid": "5165"
          },
          {
            "id": "5167",
            "cname": "诺曼",
            "pid": "5165"
          },
          {
            "id": "5168",
            "cname": "塔尔萨",
            "pid": "5165"
          },
          {
            "id": "100442",
            "cname": "其他",
            "pid": "5165"
          }
        ]
      },
      {
        "id": "5169",
        "cname": "俄勒冈",
        "pid": "5102",
        "childrens": [
          {
            "id": "5170",
            "cname": "本德",
            "pid": "5169"
          },
          {
            "id": "5171",
            "cname": "波特兰",
            "pid": "5169"
          },
          {
            "id": "5172",
            "cname": "达尔斯",
            "pid": "5169"
          },
          {
            "id": "5173",
            "cname": "达拉斯",
            "pid": "5169"
          },
          {
            "id": "5174",
            "cname": "蒂拉穆克",
            "pid": "5169"
          },
          {
            "id": "5175",
            "cname": "格兰茨帕斯",
            "pid": "5169"
          },
          {
            "id": "5176",
            "cname": "胡德里弗",
            "pid": "5169"
          },
          {
            "id": "5177",
            "cname": "火山口湖",
            "pid": "5169"
          },
          {
            "id": "5178",
            "cname": "科瓦利斯",
            "pid": "5169"
          },
          {
            "id": "5179",
            "cname": "库斯贝",
            "pid": "5169"
          },
          {
            "id": "5180",
            "cname": "梅德福",
            "pid": "5169"
          },
          {
            "id": "5181",
            "cname": "塞勒姆",
            "pid": "5169"
          },
          {
            "id": "5182",
            "cname": "圣海伦斯",
            "pid": "5169"
          },
          {
            "id": "5183",
            "cname": "斯普林菲尔德",
            "pid": "5169"
          },
          {
            "id": "5184",
            "cname": "尤金",
            "pid": "5169"
          },
          {
            "id": "100258",
            "cname": "其他",
            "pid": "5169"
          }
        ]
      },
      {
        "id": "5185",
        "cname": "佛罗里达",
        "pid": "5102",
        "childrens": [
          {
            "id": "5186",
            "cname": "奥兰多",
            "pid": "5185"
          },
          {
            "id": "5187",
            "cname": "基韦斯特",
            "pid": "5185"
          },
          {
            "id": "5188",
            "cname": "杰克逊维尔",
            "pid": "5185"
          },
          {
            "id": "5189",
            "cname": "卡纳维尔角",
            "pid": "5185"
          },
          {
            "id": "5190",
            "cname": "罗德岱堡",
            "pid": "5185"
          },
          {
            "id": "5191",
            "cname": "迈阿密",
            "pid": "5185"
          },
          {
            "id": "5192",
            "cname": "圣彼德斯堡市",
            "pid": "5185"
          },
          {
            "id": "5193",
            "cname": "塔拉哈西",
            "pid": "5185"
          },
          {
            "id": "5194",
            "cname": "坦帕",
            "pid": "5185"
          },
          {
            "id": "100144",
            "cname": "其他",
            "pid": "5185"
          }
        ]
      },
      {
        "id": "5195",
        "cname": "佛蒙特",
        "pid": "5102",
        "childrens": [
          {
            "id": "5196",
            "cname": "伯灵顿",
            "pid": "5195"
          },
          {
            "id": "5197",
            "cname": "拉特兰",
            "pid": "5195"
          },
          {
            "id": "5198",
            "cname": "南伯灵顿",
            "pid": "5195"
          },
          {
            "id": "100259",
            "cname": "其他",
            "pid": "5195"
          }
        ]
      },
      {
        "id": "5199",
        "cname": "哥伦比亚特区",
        "pid": "5102",
        "childrens": [
          {
            "id": "5200",
            "cname": "华盛顿哥伦比亚特区",
            "pid": "5199"
          },
          {
            "id": "100522",
            "cname": "其他",
            "pid": "5199"
          }
        ]
      },
      {
        "id": "5201",
        "cname": "华盛顿",
        "pid": "5102",
        "childrens": [
          {
            "id": "5202",
            "cname": "斯波坎",
            "pid": "5201"
          },
          {
            "id": "5203",
            "cname": "塔科马",
            "pid": "5201"
          },
          {
            "id": "5204",
            "cname": "西雅图",
            "pid": "5201"
          },
          {
            "id": "100567",
            "cname": "其他",
            "pid": "5201"
          }
        ]
      },
      {
        "id": "5205",
        "cname": "怀俄明",
        "pid": "5102",
        "childrens": [
          {
            "id": "5206",
            "cname": "埃文斯顿",
            "pid": "5205"
          },
          {
            "id": "5207",
            "cname": "卡斯珀",
            "pid": "5205"
          },
          {
            "id": "5208",
            "cname": "拉勒米",
            "pid": "5205"
          },
          {
            "id": "5209",
            "cname": "罗克斯普林斯",
            "pid": "5205"
          },
          {
            "id": "5210",
            "cname": "夏延",
            "pid": "5205"
          },
          {
            "id": "5211",
            "cname": "谢里登",
            "pid": "5205"
          },
          {
            "id": "100084",
            "cname": "其他",
            "pid": "5205"
          }
        ]
      },
      {
        "id": "5212",
        "cname": "加利福尼亚",
        "pid": "5102",
        "childrens": [
          {
            "id": "5213",
            "cname": "旧金山",
            "pid": "5212"
          },
          {
            "id": "5214",
            "cname": "洛杉矶",
            "pid": "5212"
          },
          {
            "id": "5215",
            "cname": "圣迭戈",
            "pid": "5212"
          },
          {
            "id": "5216",
            "cname": "圣何塞",
            "pid": "5212"
          },
          {
            "id": "100540",
            "cname": "其他",
            "pid": "5212"
          }
        ]
      },
      {
        "id": "5217",
        "cname": "堪萨斯",
        "pid": "5102",
        "childrens": [
          {
            "id": "5218",
            "cname": "阿比林",
            "pid": "5217"
          },
          {
            "id": "5219",
            "cname": "奥弗兰公园",
            "pid": "5217"
          },
          {
            "id": "5220",
            "cname": "哈钦森",
            "pid": "5217"
          },
          {
            "id": "5221",
            "cname": "堪萨斯城",
            "pid": "5217"
          },
          {
            "id": "5222",
            "cname": "莱文沃思",
            "pid": "5217"
          },
          {
            "id": "5223",
            "cname": "劳伦斯",
            "pid": "5217"
          },
          {
            "id": "5224",
            "cname": "曼哈顿",
            "pid": "5217"
          },
          {
            "id": "5225",
            "cname": "托皮卡",
            "pid": "5217"
          },
          {
            "id": "5226",
            "cname": "威奇托",
            "pid": "5217"
          },
          {
            "id": "100085",
            "cname": "其他",
            "pid": "5217"
          }
        ]
      },
      {
        "id": "5227",
        "cname": "康涅狄格",
        "pid": "5102",
        "childrens": [
          {
            "id": "5228",
            "cname": "布里奇波特",
            "pid": "5227"
          },
          {
            "id": "5229",
            "cname": "达里恩",
            "pid": "5227"
          },
          {
            "id": "5230",
            "cname": "格林尼治",
            "pid": "5227"
          },
          {
            "id": "5231",
            "cname": "哈特福德",
            "pid": "5227"
          },
          {
            "id": "5232",
            "cname": "米德尔顿",
            "pid": "5227"
          },
          {
            "id": "5233",
            "cname": "纽黑文",
            "pid": "5227"
          },
          {
            "id": "5234",
            "cname": "韦斯特波特",
            "pid": "5227"
          },
          {
            "id": "5235",
            "cname": "沃特伯里",
            "pid": "5227"
          },
          {
            "id": "5236",
            "cname": "新不列颠",
            "pid": "5227"
          },
          {
            "id": "100260",
            "cname": "其他",
            "pid": "5227"
          }
        ]
      },
      {
        "id": "5237",
        "cname": "科罗拉多",
        "pid": "5102",
        "childrens": [
          {
            "id": "5238",
            "cname": "阿斯彭",
            "pid": "5237"
          },
          {
            "id": "5239",
            "cname": "奥罗拉",
            "pid": "5237"
          },
          {
            "id": "5240",
            "cname": "博尔德",
            "pid": "5237"
          },
          {
            "id": "5241",
            "cname": "大章克申",
            "pid": "5237"
          },
          {
            "id": "5242",
            "cname": "丹佛",
            "pid": "5237"
          },
          {
            "id": "5243",
            "cname": "柯林斯堡",
            "pid": "5237"
          },
          {
            "id": "5244",
            "cname": "科罗拉多斯普林斯",
            "pid": "5237"
          },
          {
            "id": "5245",
            "cname": "韦尔",
            "pid": "5237"
          },
          {
            "id": "100086",
            "cname": "其他",
            "pid": "5237"
          }
        ]
      },
      {
        "id": "5246",
        "cname": "肯塔基",
        "pid": "5102",
        "childrens": [
          {
            "id": "5247",
            "cname": "列克星敦",
            "pid": "5246"
          },
          {
            "id": "5248",
            "cname": "路易斯维尔",
            "pid": "5246"
          },
          {
            "id": "5249",
            "cname": "欧文斯伯勒",
            "pid": "5246"
          },
          {
            "id": "100553",
            "cname": "其他",
            "pid": "5246"
          }
        ]
      },
      {
        "id": "5250",
        "cname": "路易斯安那",
        "pid": "5102",
        "childrens": [
          {
            "id": "5251",
            "cname": "巴吞鲁日",
            "pid": "5250"
          },
          {
            "id": "5252",
            "cname": "什里夫波特",
            "pid": "5250"
          },
          {
            "id": "5253",
            "cname": "新奥尔良",
            "pid": "5250"
          },
          {
            "id": "100261",
            "cname": "其他",
            "pid": "5250"
          }
        ]
      },
      {
        "id": "5254",
        "cname": "罗德岛",
        "pid": "5102",
        "childrens": [
          {
            "id": "5255",
            "cname": "波塔基特",
            "pid": "5254"
          },
          {
            "id": "5256",
            "cname": "克兰斯顿",
            "pid": "5254"
          },
          {
            "id": "5257",
            "cname": "纽波特",
            "pid": "5254"
          },
          {
            "id": "5258",
            "cname": "普罗维登斯",
            "pid": "5254"
          },
          {
            "id": "5259",
            "cname": "韦斯特利",
            "pid": "5254"
          },
          {
            "id": "5260",
            "cname": "文索基特",
            "pid": "5254"
          },
          {
            "id": "5261",
            "cname": "沃威克",
            "pid": "5254"
          },
          {
            "id": "100262",
            "cname": "其他",
            "pid": "5254"
          }
        ]
      },
      {
        "id": "5262",
        "cname": "马里兰",
        "pid": "5102",
        "childrens": [
          {
            "id": "5263",
            "cname": "巴尔的摩",
            "pid": "5262"
          },
          {
            "id": "5264",
            "cname": "盖瑟斯堡",
            "pid": "5262"
          },
          {
            "id": "5265",
            "cname": "罗克维尔",
            "pid": "5262"
          },
          {
            "id": "100263",
            "cname": "其他",
            "pid": "5262"
          }
        ]
      },
      {
        "id": "5266",
        "cname": "马萨诸塞",
        "pid": "5102",
        "childrens": [
          {
            "id": "5267",
            "cname": "波士顿",
            "pid": "5266"
          },
          {
            "id": "5268",
            "cname": "斯普林菲尔德",
            "pid": "5266"
          },
          {
            "id": "5269",
            "cname": "伍斯特",
            "pid": "5266"
          },
          {
            "id": "100264",
            "cname": "其他",
            "pid": "5266"
          }
        ]
      },
      {
        "id": "5270",
        "cname": "蒙大拿",
        "pid": "5102",
        "childrens": [
          {
            "id": "5271",
            "cname": "比灵斯",
            "pid": "5270"
          },
          {
            "id": "5272",
            "cname": "大瀑布村",
            "pid": "5270"
          },
          {
            "id": "5273",
            "cname": "米苏拉",
            "pid": "5270"
          },
          {
            "id": "100265",
            "cname": "其他",
            "pid": "5270"
          }
        ]
      },
      {
        "id": "5274",
        "cname": "密苏里",
        "pid": "5102",
        "childrens": [
          {
            "id": "5275",
            "cname": "哥伦比亚",
            "pid": "5274"
          },
          {
            "id": "5276",
            "cname": "杰佛逊市",
            "pid": "5274"
          },
          {
            "id": "5277",
            "cname": "堪萨斯城",
            "pid": "5274"
          },
          {
            "id": "5278",
            "cname": "圣路易斯",
            "pid": "5274"
          },
          {
            "id": "5279",
            "cname": "斯普林菲尔德",
            "pid": "5274"
          },
          {
            "id": "100489",
            "cname": "其他",
            "pid": "5274"
          }
        ]
      },
      {
        "id": "5280",
        "cname": "密西西比",
        "pid": "5102",
        "childrens": [
          {
            "id": "5281",
            "cname": "比洛克西",
            "pid": "5280"
          },
          {
            "id": "5282",
            "cname": "格尔夫波特",
            "pid": "5280"
          },
          {
            "id": "5283",
            "cname": "格林维尔",
            "pid": "5280"
          },
          {
            "id": "5284",
            "cname": "哈蒂斯堡",
            "pid": "5280"
          },
          {
            "id": "5285",
            "cname": "杰克逊",
            "pid": "5280"
          },
          {
            "id": "5286",
            "cname": "默里迪恩",
            "pid": "5280"
          },
          {
            "id": "5287",
            "cname": "维克斯堡",
            "pid": "5280"
          },
          {
            "id": "100266",
            "cname": "其他",
            "pid": "5280"
          }
        ]
      },
      {
        "id": "5288",
        "cname": "密歇根",
        "pid": "5102",
        "childrens": [
          {
            "id": "5289",
            "cname": "安娜堡",
            "pid": "5288"
          },
          {
            "id": "5290",
            "cname": "巴特尔克里克",
            "pid": "5288"
          },
          {
            "id": "5291",
            "cname": "贝城",
            "pid": "5288"
          },
          {
            "id": "5292",
            "cname": "大急流城",
            "pid": "5288"
          },
          {
            "id": "5293",
            "cname": "迪尔伯恩",
            "pid": "5288"
          },
          {
            "id": "5294",
            "cname": "底特律",
            "pid": "5288"
          },
          {
            "id": "5295",
            "cname": "弗林特",
            "pid": "5288"
          },
          {
            "id": "5296",
            "cname": "怀恩多特",
            "pid": "5288"
          },
          {
            "id": "5297",
            "cname": "卡拉马袓",
            "pid": "5288"
          },
          {
            "id": "5298",
            "cname": "兰辛",
            "pid": "5288"
          },
          {
            "id": "5299",
            "cname": "马斯基根",
            "pid": "5288"
          },
          {
            "id": "5300",
            "cname": "庞菷亚克",
            "pid": "5288"
          },
          {
            "id": "5301",
            "cname": "萨吉诺",
            "pid": "5288"
          },
          {
            "id": "5302",
            "cname": "苏圣玛丽",
            "pid": "5288"
          },
          {
            "id": "5303",
            "cname": "沃伦",
            "pid": "5288"
          },
          {
            "id": "5304",
            "cname": "休伦港",
            "pid": "5288"
          },
          {
            "id": "100087",
            "cname": "其他",
            "pid": "5288"
          }
        ]
      },
      {
        "id": "5305",
        "cname": "缅因",
        "pid": "5102",
        "childrens": [
          {
            "id": "5306",
            "cname": "班戈",
            "pid": "5305"
          },
          {
            "id": "5307",
            "cname": "波特兰",
            "pid": "5305"
          },
          {
            "id": "5308",
            "cname": "刘易斯顿",
            "pid": "5305"
          },
          {
            "id": "100267",
            "cname": "其他",
            "pid": "5305"
          }
        ]
      },
      {
        "id": "5309",
        "cname": "明尼苏达",
        "pid": "5102",
        "childrens": [
          {
            "id": "5310",
            "cname": "罗切斯特",
            "pid": "5309"
          },
          {
            "id": "5311",
            "cname": "明尼阿波利斯",
            "pid": "5309"
          },
          {
            "id": "5312",
            "cname": "圣保罗",
            "pid": "5309"
          },
          {
            "id": "100554",
            "cname": "其他",
            "pid": "5309"
          }
        ]
      },
      {
        "id": "5313",
        "cname": "南达科他",
        "pid": "5102",
        "childrens": [
          {
            "id": "5314",
            "cname": "阿伯丁",
            "pid": "5313"
          },
          {
            "id": "5315",
            "cname": "拉皮德城",
            "pid": "5313"
          },
          {
            "id": "5316",
            "cname": "苏福尔斯",
            "pid": "5313"
          },
          {
            "id": "100088",
            "cname": "其他",
            "pid": "5313"
          }
        ]
      },
      {
        "id": "5317",
        "cname": "南卡罗来纳",
        "pid": "5102",
        "childrens": [
          {
            "id": "5318",
            "cname": "北查尔斯顿",
            "pid": "5317"
          },
          {
            "id": "5319",
            "cname": "查尔斯顿",
            "pid": "5317"
          },
          {
            "id": "5320",
            "cname": "哥伦比亚",
            "pid": "5317"
          },
          {
            "id": "100268",
            "cname": "其他",
            "pid": "5317"
          }
        ]
      },
      {
        "id": "5321",
        "cname": "内布拉斯加",
        "pid": "5102",
        "childrens": [
          {
            "id": "5322",
            "cname": "奥马哈",
            "pid": "5321"
          },
          {
            "id": "5323",
            "cname": "贝尔维尤",
            "pid": "5321"
          },
          {
            "id": "5324",
            "cname": "林肯",
            "pid": "5321"
          },
          {
            "id": "100145",
            "cname": "其他",
            "pid": "5321"
          }
        ]
      },
      {
        "id": "5325",
        "cname": "内华达",
        "pid": "5102",
        "childrens": [
          {
            "id": "5326",
            "cname": "埃尔科",
            "pid": "5325"
          },
          {
            "id": "5327",
            "cname": "北拉斯维加斯",
            "pid": "5325"
          },
          {
            "id": "5328",
            "cname": "弗吉尼亚城",
            "pid": "5325"
          },
          {
            "id": "5329",
            "cname": "亨德森",
            "pid": "5325"
          },
          {
            "id": "5330",
            "cname": "卡森城",
            "pid": "5325"
          },
          {
            "id": "5331",
            "cname": "拉斯维加斯",
            "pid": "5325"
          },
          {
            "id": "5332",
            "cname": "里诺",
            "pid": "5325"
          },
          {
            "id": "5333",
            "cname": "斯帕克斯",
            "pid": "5325"
          },
          {
            "id": "100089",
            "cname": "其他",
            "pid": "5325"
          }
        ]
      },
      {
        "id": "5334",
        "cname": "纽约",
        "pid": "5102",
        "childrens": [
          {
            "id": "5335",
            "cname": "布法罗",
            "pid": "5334"
          },
          {
            "id": "5336",
            "cname": "罗切斯特",
            "pid": "5334"
          },
          {
            "id": "5337",
            "cname": "纽约市",
            "pid": "5334"
          },
          {
            "id": "100269",
            "cname": "其他",
            "pid": "5334"
          }
        ]
      },
      {
        "id": "5338",
        "cname": "特拉华",
        "pid": "5102",
        "childrens": [
          {
            "id": "5339",
            "cname": "多佛",
            "pid": "5338"
          },
          {
            "id": "5340",
            "cname": "纽瓦克",
            "pid": "5338"
          },
          {
            "id": "5341",
            "cname": "威明顿",
            "pid": "5338"
          },
          {
            "id": "100434",
            "cname": "其他",
            "pid": "5338"
          }
        ]
      },
      {
        "id": "5342",
        "cname": "田纳西",
        "pid": "5102",
        "childrens": [
          {
            "id": "5343",
            "cname": "布利斯托",
            "pid": "5342"
          },
          {
            "id": "5344",
            "cname": "查塔努加",
            "pid": "5342"
          },
          {
            "id": "5345",
            "cname": "金斯波特",
            "pid": "5342"
          },
          {
            "id": "5346",
            "cname": "孟菲斯",
            "pid": "5342"
          },
          {
            "id": "5347",
            "cname": "纳什维尔",
            "pid": "5342"
          },
          {
            "id": "5348",
            "cname": "诺克斯维尔",
            "pid": "5342"
          },
          {
            "id": "5349",
            "cname": "三城区",
            "pid": "5342"
          },
          {
            "id": "5350",
            "cname": "士麦那",
            "pid": "5342"
          },
          {
            "id": "5351",
            "cname": "斯普林希尔",
            "pid": "5342"
          },
          {
            "id": "5352",
            "cname": "约翰逊城",
            "pid": "5342"
          },
          {
            "id": "100270",
            "cname": "其他",
            "pid": "5342"
          }
        ]
      },
      {
        "id": "5353",
        "cname": "威斯康星",
        "pid": "5102",
        "childrens": [
          {
            "id": "5354",
            "cname": "阿普尓顿",
            "pid": "5353"
          },
          {
            "id": "5355",
            "cname": "奥什科什",
            "pid": "5353"
          },
          {
            "id": "5356",
            "cname": "格林贝",
            "pid": "5353"
          },
          {
            "id": "5357",
            "cname": "基诺沙",
            "pid": "5353"
          },
          {
            "id": "5358",
            "cname": "拉克罗斯",
            "pid": "5353"
          },
          {
            "id": "5359",
            "cname": "拉辛",
            "pid": "5353"
          },
          {
            "id": "5360",
            "cname": "马尼托沃克",
            "pid": "5353"
          },
          {
            "id": "5361",
            "cname": "迈迪逊",
            "pid": "5353"
          },
          {
            "id": "5362",
            "cname": "密尔沃基",
            "pid": "5353"
          },
          {
            "id": "5363",
            "cname": "欧克莱尓",
            "pid": "5353"
          },
          {
            "id": "5364",
            "cname": "沃索",
            "pid": "5353"
          },
          {
            "id": "5365",
            "cname": "希博伊根",
            "pid": "5353"
          },
          {
            "id": "100090",
            "cname": "其他",
            "pid": "5353"
          }
        ]
      },
      {
        "id": "5366",
        "cname": "维吉尼亚",
        "pid": "5102",
        "childrens": [
          {
            "id": "5367",
            "cname": "弗吉尼亚比奇",
            "pid": "5366"
          },
          {
            "id": "5368",
            "cname": "诺福克",
            "pid": "5366"
          },
          {
            "id": "5369",
            "cname": "切萨皮克",
            "pid": "5366"
          },
          {
            "id": "100459",
            "cname": "其他",
            "pid": "5366"
          }
        ]
      },
      {
        "id": "5370",
        "cname": "西佛吉尼亚",
        "pid": "5102",
        "childrens": [
          {
            "id": "5371",
            "cname": "查尔斯顿",
            "pid": "5370"
          },
          {
            "id": "5372",
            "cname": "亨廷顿",
            "pid": "5370"
          },
          {
            "id": "5373",
            "cname": "帕克斯堡",
            "pid": "5370"
          },
          {
            "id": "100367",
            "cname": "其他",
            "pid": "5370"
          }
        ]
      },
      {
        "id": "5374",
        "cname": "夏威夷",
        "pid": "5102",
        "childrens": [
          {
            "id": "5375",
            "cname": "凯卢阿",
            "pid": "5374"
          },
          {
            "id": "5376",
            "cname": "檀香山",
            "pid": "5374"
          },
          {
            "id": "5377",
            "cname": "希洛",
            "pid": "5374"
          },
          {
            "id": "100542",
            "cname": "其他",
            "pid": "5374"
          }
        ]
      },
      {
        "id": "5378",
        "cname": "新罕布什尔",
        "pid": "5102",
        "childrens": [
          {
            "id": "5379",
            "cname": "康科德",
            "pid": "5378"
          },
          {
            "id": "5380",
            "cname": "曼彻斯特",
            "pid": "5378"
          },
          {
            "id": "5381",
            "cname": "纳舒厄",
            "pid": "5378"
          },
          {
            "id": "100543",
            "cname": "其他",
            "pid": "5378"
          }
        ]
      },
      {
        "id": "5382",
        "cname": "新墨西哥",
        "pid": "5102",
        "childrens": [
          {
            "id": "5383",
            "cname": "阿尔伯克基",
            "pid": "5382"
          },
          {
            "id": "5384",
            "cname": "拉斯克鲁塞斯",
            "pid": "5382"
          },
          {
            "id": "5385",
            "cname": "罗斯韦尔",
            "pid": "5382"
          },
          {
            "id": "5386",
            "cname": "圣菲",
            "pid": "5382"
          },
          {
            "id": "100091",
            "cname": "其他",
            "pid": "5382"
          }
        ]
      },
      {
        "id": "5387",
        "cname": "新泽西",
        "pid": "5102",
        "childrens": [
          {
            "id": "5388",
            "cname": "纽瓦克",
            "pid": "5387"
          },
          {
            "id": "5389",
            "cname": "帕特森",
            "pid": "5387"
          },
          {
            "id": "5390",
            "cname": "泽西城",
            "pid": "5387"
          },
          {
            "id": "100560",
            "cname": "其他",
            "pid": "5387"
          }
        ]
      },
      {
        "id": "5391",
        "cname": "亚利桑那",
        "pid": "5102",
        "childrens": [
          {
            "id": "5392",
            "cname": "凤凰城",
            "pid": "5391"
          },
          {
            "id": "5393",
            "cname": "格兰代尔",
            "pid": "5391"
          },
          {
            "id": "5394",
            "cname": "梅萨",
            "pid": "5391"
          },
          {
            "id": "5395",
            "cname": "史卡兹代尔",
            "pid": "5391"
          },
          {
            "id": "5396",
            "cname": "坦普",
            "pid": "5391"
          },
          {
            "id": "5397",
            "cname": "图森",
            "pid": "5391"
          },
          {
            "id": "5398",
            "cname": "优玛",
            "pid": "5391"
          },
          {
            "id": "100460",
            "cname": "其他",
            "pid": "5391"
          }
        ]
      },
      {
        "id": "5399",
        "cname": "伊利诺斯",
        "pid": "5102",
        "childrens": [
          {
            "id": "5400",
            "cname": "奥尔顿",
            "pid": "5399"
          },
          {
            "id": "5401",
            "cname": "奥罗拉",
            "pid": "5399"
          },
          {
            "id": "5402",
            "cname": "布卢明顿",
            "pid": "5399"
          },
          {
            "id": "5403",
            "cname": "丹维尓",
            "pid": "5399"
          },
          {
            "id": "5404",
            "cname": "迪卡尔布",
            "pid": "5399"
          },
          {
            "id": "5405",
            "cname": "迪凯持",
            "pid": "5399"
          },
          {
            "id": "5406",
            "cname": "东圣路易斯",
            "pid": "5399"
          },
          {
            "id": "5407",
            "cname": "厄巴纳-香槟",
            "pid": "5399"
          },
          {
            "id": "5408",
            "cname": "盖尔斯堡",
            "pid": "5399"
          },
          {
            "id": "5409",
            "cname": "卡本代尔",
            "pid": "5399"
          },
          {
            "id": "5410",
            "cname": "罗克艾兰",
            "pid": "5399"
          },
          {
            "id": "5411",
            "cname": "罗克福德",
            "pid": "5399"
          },
          {
            "id": "5412",
            "cname": "诺黙尔",
            "pid": "5399"
          },
          {
            "id": "5413",
            "cname": "皮奥里亚",
            "pid": "5399"
          },
          {
            "id": "5414",
            "cname": "森特勒利亚",
            "pid": "5399"
          },
          {
            "id": "5415",
            "cname": "斯普林菲尔德",
            "pid": "5399"
          },
          {
            "id": "5416",
            "cname": "沃其根",
            "pid": "5399"
          },
          {
            "id": "5417",
            "cname": "芝加哥",
            "pid": "5399"
          },
          {
            "id": "100146",
            "cname": "其他",
            "pid": "5399"
          }
        ]
      },
      {
        "id": "5418",
        "cname": "印第安那",
        "pid": "5102",
        "childrens": [
          {
            "id": "5419",
            "cname": "埃文斯维尔",
            "pid": "5418"
          },
          {
            "id": "5420",
            "cname": "韦恩堡",
            "pid": "5418"
          },
          {
            "id": "5421",
            "cname": "印第安纳波利斯",
            "pid": "5418"
          },
          {
            "id": "100092",
            "cname": "其他",
            "pid": "5418"
          }
        ]
      },
      {
        "id": "5422",
        "cname": "犹他",
        "pid": "5102",
        "childrens": [
          {
            "id": "5423",
            "cname": "奥格登",
            "pid": "5422"
          },
          {
            "id": "5424",
            "cname": "雷登",
            "pid": "5422"
          },
          {
            "id": "5425",
            "cname": "欧仁",
            "pid": "5422"
          },
          {
            "id": "5426",
            "cname": "帕克城",
            "pid": "5422"
          },
          {
            "id": "5427",
            "cname": "普罗沃",
            "pid": "5422"
          },
          {
            "id": "5428",
            "cname": "圣乔治",
            "pid": "5422"
          },
          {
            "id": "5429",
            "cname": "西瓦利城",
            "pid": "5422"
          },
          {
            "id": "5430",
            "cname": "盐湖城",
            "pid": "5422"
          },
          {
            "id": "100147",
            "cname": "其他",
            "pid": "5422"
          }
        ]
      },
      {
        "id": "5431",
        "cname": "佐治亚",
        "pid": "5102",
        "childrens": [
          {
            "id": "5432",
            "cname": "奥古斯塔",
            "pid": "5431"
          },
          {
            "id": "5433",
            "cname": "哥伦布",
            "pid": "5431"
          },
          {
            "id": "5434",
            "cname": "梅肯",
            "pid": "5431"
          },
          {
            "id": "5435",
            "cname": "沙瓦纳",
            "pid": "5431"
          },
          {
            "id": "5436",
            "cname": "亚特兰大",
            "pid": "5431"
          },
          {
            "id": "100148",
            "cname": "其他",
            "pid": "5431"
          }
        ]
      }
    ]
  },
  {
    "id": "5437",
    "cname": "美属萨摩亚",
    "pid": "",
    "childrens": [
      {
        "id": "5438",
        "cname": "阿纳",
        "pid": "5437"
      },
      {
        "id": "5439",
        "cname": "阿图阿",
        "pid": "5437"
      },
      {
        "id": "5440",
        "cname": "艾加伊勒泰",
        "pid": "5437"
      },
      {
        "id": "5441",
        "cname": "法塞莱莱阿加",
        "pid": "5437"
      },
      {
        "id": "5442",
        "cname": "加盖福毛加",
        "pid": "5437"
      },
      {
        "id": "5443",
        "cname": "加加埃毛加",
        "pid": "5437"
      },
      {
        "id": "5444",
        "cname": "帕劳利",
        "pid": "5437"
      },
      {
        "id": "5445",
        "cname": "萨图帕伊泰阿",
        "pid": "5437"
      },
      {
        "id": "5446",
        "cname": "萨瓦伊岛",
        "pid": "5437"
      },
      {
        "id": "5447",
        "cname": "图阿马萨加",
        "pid": "5437"
      },
      {
        "id": "5448",
        "cname": "瓦奥福诺蒂",
        "pid": "5437"
      },
      {
        "id": "5449",
        "cname": "韦西加诺",
        "pid": "5437"
      },
      {
        "id": "5450",
        "cname": "乌波卢岛",
        "pid": "5437"
      },
      {
        "id": "100093",
        "cname": "其他",
        "pid": "5437"
      }
    ]
  },
  {
    "id": "5451",
    "cname": "美属外岛",
    "pid": ""
  },
  {
    "id": "5452",
    "cname": "蒙古",
    "pid": "",
    "childrens": [
      {
        "id": "5453",
        "cname": "巴彦洪格尔",
        "pid": "5452"
      },
      {
        "id": "5454",
        "cname": "巴彦乌勒盖",
        "pid": "5452"
      },
      {
        "id": "5455",
        "cname": "布尔干",
        "pid": "5452"
      },
      {
        "id": "5456",
        "cname": "达尔汗乌勒",
        "pid": "5452"
      },
      {
        "id": "5457",
        "cname": "东方",
        "pid": "5452"
      },
      {
        "id": "5458",
        "cname": "东戈壁",
        "pid": "5452"
      },
      {
        "id": "5459",
        "cname": "鄂尔浑",
        "pid": "5452"
      },
      {
        "id": "5460",
        "cname": "戈壁阿尔泰",
        "pid": "5452"
      },
      {
        "id": "5461",
        "cname": "戈壁苏木贝尔",
        "pid": "5452"
      },
      {
        "id": "5462",
        "cname": "后杭爱",
        "pid": "5452"
      },
      {
        "id": "5463",
        "cname": "科布多",
        "pid": "5452"
      },
      {
        "id": "5464",
        "cname": "肯特",
        "pid": "5452"
      },
      {
        "id": "5465",
        "cname": "库苏古尔",
        "pid": "5452"
      },
      {
        "id": "5466",
        "cname": "南戈壁",
        "pid": "5452"
      },
      {
        "id": "5467",
        "cname": "前杭爱",
        "pid": "5452"
      },
      {
        "id": "5468",
        "cname": "色楞格",
        "pid": "5452"
      },
      {
        "id": "5469",
        "cname": "苏赫巴托尔",
        "pid": "5452"
      },
      {
        "id": "5470",
        "cname": "乌布苏",
        "pid": "5452"
      },
      {
        "id": "5471",
        "cname": "乌兰巴托市",
        "pid": "5452"
      },
      {
        "id": "5472",
        "cname": "扎布汗",
        "pid": "5452"
      },
      {
        "id": "5473",
        "cname": "中戈壁",
        "pid": "5452"
      },
      {
        "id": "5474",
        "cname": "中央",
        "pid": "5452"
      },
      {
        "id": "100271",
        "cname": "其他",
        "pid": "5452"
      }
    ]
  },
  {
    "id": "5475",
    "cname": "蒙特塞拉特",
    "pid": ""
  },
  {
    "id": "5476",
    "cname": "孟加拉",
    "pid": "",
    "childrens": [
      {
        "id": "5477",
        "cname": "达卡",
        "pid": "5476"
      },
      {
        "id": "5478",
        "cname": "吉大港",
        "pid": "5476"
      },
      {
        "id": "5479",
        "cname": "库尔纳",
        "pid": "5476"
      },
      {
        "id": "100435",
        "cname": "其他",
        "pid": "5476"
      }
    ]
  },
  {
    "id": "5480",
    "cname": "密克罗尼西亚",
    "pid": ""
  },
  {
    "id": "5481",
    "cname": "秘鲁",
    "pid": "",
    "childrens": [
      {
        "id": "5482",
        "cname": "阿雷基帕",
        "pid": "5481"
      },
      {
        "id": "5483",
        "cname": "阿普里马克",
        "pid": "5481"
      },
      {
        "id": "5484",
        "cname": "阿亚库乔",
        "pid": "5481"
      },
      {
        "id": "5485",
        "cname": "安卡什",
        "pid": "5481"
      },
      {
        "id": "5486",
        "cname": "胡利亚卡",
        "pid": "5481"
      },
      {
        "id": "5487",
        "cname": "胡宁",
        "pid": "5481"
      },
      {
        "id": "5488",
        "cname": "卡哈马卡",
        "pid": "5481"
      },
      {
        "id": "5489",
        "cname": "卡亚俄",
        "pid": "5481"
      },
      {
        "id": "5490",
        "cname": "库斯科",
        "pid": "5481"
      },
      {
        "id": "5491",
        "cname": "拉利伯塔德",
        "pid": "5481"
      },
      {
        "id": "5492",
        "cname": "兰巴耶克",
        "pid": "5481"
      },
      {
        "id": "5493",
        "cname": "利马",
        "pid": "5481"
      },
      {
        "id": "5494",
        "cname": "洛雷托",
        "pid": "5481"
      },
      {
        "id": "5495",
        "cname": "马德雷德迪奥斯",
        "pid": "5481"
      },
      {
        "id": "5496",
        "cname": "莫克瓜",
        "pid": "5481"
      },
      {
        "id": "5497",
        "cname": "帕斯科",
        "pid": "5481"
      },
      {
        "id": "5498",
        "cname": "皮乌拉",
        "pid": "5481"
      },
      {
        "id": "5499",
        "cname": "普诺",
        "pid": "5481"
      },
      {
        "id": "5500",
        "cname": "钦博特",
        "pid": "5481"
      },
      {
        "id": "5501",
        "cname": "钦查阿尔塔",
        "pid": "5481"
      },
      {
        "id": "5502",
        "cname": "圣马丁",
        "pid": "5481"
      },
      {
        "id": "5503",
        "cname": "苏拉纳",
        "pid": "5481"
      },
      {
        "id": "5504",
        "cname": "塔克纳",
        "pid": "5481"
      },
      {
        "id": "5505",
        "cname": "通贝斯",
        "pid": "5481"
      },
      {
        "id": "5506",
        "cname": "瓦努科",
        "pid": "5481"
      },
      {
        "id": "5507",
        "cname": "万卡维利卡",
        "pid": "5481"
      },
      {
        "id": "5508",
        "cname": "乌卡亚利",
        "pid": "5481"
      },
      {
        "id": "5509",
        "cname": "亚马孙",
        "pid": "5481"
      },
      {
        "id": "5510",
        "cname": "伊卡",
        "pid": "5481"
      },
      {
        "id": "100094",
        "cname": "其他",
        "pid": "5481"
      }
    ]
  },
  {
    "id": "5511",
    "cname": "缅甸",
    "pid": "",
    "childrens": [
      {
        "id": "5512",
        "cname": "勃固省",
        "pid": "5511"
      },
      {
        "id": "5513",
        "cname": "掸邦",
        "pid": "5511"
      },
      {
        "id": "5514",
        "cname": "德林达依省",
        "pid": "5511"
      },
      {
        "id": "5515",
        "cname": "克伦邦",
        "pid": "5511"
      },
      {
        "id": "5516",
        "cname": "克钦邦",
        "pid": "5511"
      },
      {
        "id": "5517",
        "cname": "克耶邦",
        "pid": "5511"
      },
      {
        "id": "5518",
        "cname": "马圭省",
        "pid": "5511"
      },
      {
        "id": "5519",
        "cname": "曼德勒省",
        "pid": "5511"
      },
      {
        "id": "5520",
        "cname": "孟邦",
        "pid": "5511"
      },
      {
        "id": "5521",
        "cname": "钦邦",
        "pid": "5511"
      },
      {
        "id": "5522",
        "cname": "若开邦",
        "pid": "5511"
      },
      {
        "id": "5523",
        "cname": "实皆省",
        "pid": "5511"
      },
      {
        "id": "5524",
        "cname": "仰光省",
        "pid": "5511"
      },
      {
        "id": "5525",
        "cname": "伊洛瓦底省",
        "pid": "5511"
      },
      {
        "id": "100272",
        "cname": "其他",
        "pid": "5511"
      }
    ]
  },
  {
    "id": "5526",
    "cname": "摩尔多瓦",
    "pid": ""
  },
  {
    "id": "5527",
    "cname": "摩洛哥",
    "pid": "",
    "childrens": [
      {
        "id": "5528",
        "cname": "丹吉尔",
        "pid": "5527"
      },
      {
        "id": "5529",
        "cname": "得土安",
        "pid": "5527"
      },
      {
        "id": "5530",
        "cname": "非斯",
        "pid": "5527"
      },
      {
        "id": "5531",
        "cname": "卡萨布兰卡",
        "pid": "5527"
      },
      {
        "id": "5532",
        "cname": "拉巴特",
        "pid": "5527"
      },
      {
        "id": "5533",
        "cname": "马拉喀什",
        "pid": "5527"
      },
      {
        "id": "5534",
        "cname": "梅克内斯",
        "pid": "5527"
      },
      {
        "id": "5535",
        "cname": "乌季达",
        "pid": "5527"
      },
      {
        "id": "5536",
        "cname": "西撒哈拉",
        "pid": "5527"
      },
      {
        "id": "100436",
        "cname": "其他",
        "pid": "5527"
      }
    ]
  },
  {
    "id": "5537",
    "cname": "摩纳哥",
    "pid": ""
  },
  {
    "id": "5538",
    "cname": "莫桑比克",
    "pid": ""
  },
  {
    "id": "5539",
    "cname": "墨西哥",
    "pid": "",
    "childrens": [
      {
        "id": "5540",
        "cname": "阿瓜斯卡连斯特",
        "pid": "5539"
      },
      {
        "id": "5541",
        "cname": "阿卡普尔科",
        "pid": "5539"
      },
      {
        "id": "5542",
        "cname": "埃莫西约",
        "pid": "5539"
      },
      {
        "id": "5543",
        "cname": "埃佩切",
        "pid": "5539"
      },
      {
        "id": "5544",
        "cname": "奥夫雷贡城",
        "pid": "5539"
      },
      {
        "id": "5545",
        "cname": "奥里萨巴",
        "pid": "5539"
      },
      {
        "id": "5546",
        "cname": "巴利城",
        "pid": "5539"
      },
      {
        "id": "5547",
        "cname": "巴亚尔塔港",
        "pid": "5539"
      },
      {
        "id": "5548",
        "cname": "比利亚埃尔莫萨",
        "pid": "5539"
      },
      {
        "id": "5549",
        "cname": "波萨里卡",
        "pid": "5539"
      },
      {
        "id": "5550",
        "cname": "蒂华纳",
        "pid": "5539"
      },
      {
        "id": "5551",
        "cname": "杜兰戈",
        "pid": "5539"
      },
      {
        "id": "5552",
        "cname": "恩塞纳达",
        "pid": "5539"
      },
      {
        "id": "5553",
        "cname": "瓜达拉哈拉",
        "pid": "5539"
      },
      {
        "id": "5554",
        "cname": "瓜纳华托",
        "pid": "5539"
      },
      {
        "id": "5555",
        "cname": "哈拉帕",
        "pid": "5539"
      },
      {
        "id": "5556",
        "cname": "华雷斯",
        "pid": "5539"
      },
      {
        "id": "5557",
        "cname": "华雷斯港",
        "pid": "5539"
      },
      {
        "id": "5558",
        "cname": "卡门",
        "pid": "5539"
      },
      {
        "id": "5559",
        "cname": "科利马",
        "pid": "5539"
      },
      {
        "id": "5560",
        "cname": "克雷塔罗",
        "pid": "5539"
      },
      {
        "id": "5561",
        "cname": "库埃纳瓦卡",
        "pid": "5539"
      },
      {
        "id": "5562",
        "cname": "库利阿坎",
        "pid": "5539"
      },
      {
        "id": "5563",
        "cname": "夸察夸拉克斯",
        "pid": "5539"
      },
      {
        "id": "5564",
        "cname": "拉巴斯",
        "pid": "5539"
      },
      {
        "id": "5565",
        "cname": "莱昂",
        "pid": "5539"
      },
      {
        "id": "5566",
        "cname": "雷诺萨",
        "pid": "5539"
      },
      {
        "id": "5567",
        "cname": "洛斯莫奇斯",
        "pid": "5539"
      },
      {
        "id": "5568",
        "cname": "马萨特兰",
        "pid": "5539"
      },
      {
        "id": "5569",
        "cname": "马塔莫罗斯",
        "pid": "5539"
      },
      {
        "id": "5570",
        "cname": "梅里达",
        "pid": "5539"
      },
      {
        "id": "5571",
        "cname": "蒙克洛瓦",
        "pid": "5539"
      },
      {
        "id": "5572",
        "cname": "蒙特雷",
        "pid": "5539"
      },
      {
        "id": "5573",
        "cname": "莫雷利亚",
        "pid": "5539"
      },
      {
        "id": "5574",
        "cname": "墨西哥城",
        "pid": "5539"
      },
      {
        "id": "5575",
        "cname": "墨西卡利",
        "pid": "5539"
      },
      {
        "id": "5576",
        "cname": "诺加莱斯",
        "pid": "5539"
      },
      {
        "id": "5577",
        "cname": "帕丘卡",
        "pid": "5539"
      },
      {
        "id": "5578",
        "cname": "普埃布拉",
        "pid": "5539"
      },
      {
        "id": "5579",
        "cname": "奇尔潘辛戈",
        "pid": "5539"
      },
      {
        "id": "5580",
        "cname": "奇瓦瓦",
        "pid": "5539"
      },
      {
        "id": "5581",
        "cname": "切图马尔",
        "pid": "5539"
      },
      {
        "id": "5582",
        "cname": "萨尔蒂约",
        "pid": "5539"
      },
      {
        "id": "5583",
        "cname": "萨卡特卡斯",
        "pid": "5539"
      },
      {
        "id": "5584",
        "cname": "塞拉亚",
        "pid": "5539"
      },
      {
        "id": "5585",
        "cname": "圣路易斯波托亚",
        "pid": "5539"
      },
      {
        "id": "5586",
        "cname": "塔帕丘拉",
        "pid": "5539"
      },
      {
        "id": "5587",
        "cname": "坦皮科",
        "pid": "5539"
      },
      {
        "id": "5588",
        "cname": "特拉斯卡拉",
        "pid": "5539"
      },
      {
        "id": "5589",
        "cname": "特皮克",
        "pid": "5539"
      },
      {
        "id": "5590",
        "cname": "特瓦坎",
        "pid": "5539"
      },
      {
        "id": "5591",
        "cname": "图斯特拉-古铁雷斯",
        "pid": "5539"
      },
      {
        "id": "5592",
        "cname": "托雷翁",
        "pid": "5539"
      },
      {
        "id": "5593",
        "cname": "托卢卡",
        "pid": "5539"
      },
      {
        "id": "5594",
        "cname": "瓦哈卡",
        "pid": "5539"
      },
      {
        "id": "5595",
        "cname": "维多利亚城",
        "pid": "5539"
      },
      {
        "id": "5596",
        "cname": "韦拉克鲁斯",
        "pid": "5539"
      },
      {
        "id": "5597",
        "cname": "乌鲁阿潘",
        "pid": "5539"
      },
      {
        "id": "5598",
        "cname": "新拉雷多",
        "pid": "5539"
      },
      {
        "id": "5599",
        "cname": "伊拉普阿托",
        "pid": "5539"
      },
      {
        "id": "100095",
        "cname": "其他",
        "pid": "5539"
      }
    ]
  },
  {
    "id": "5600",
    "cname": "纳米比亚",
    "pid": "",
    "childrens": [
      {
        "id": "5601",
        "cname": "埃龙戈",
        "pid": "5600"
      },
      {
        "id": "5602",
        "cname": "奥汉圭纳",
        "pid": "5600"
      },
      {
        "id": "5603",
        "cname": "奥卡万戈",
        "pid": "5600"
      },
      {
        "id": "5604",
        "cname": "奥马赫科",
        "pid": "5600"
      },
      {
        "id": "5605",
        "cname": "奥姆沙蒂",
        "pid": "5600"
      },
      {
        "id": "5606",
        "cname": "奥乔宗蒂约巴",
        "pid": "5600"
      },
      {
        "id": "5607",
        "cname": "奥沙纳",
        "pid": "5600"
      },
      {
        "id": "5608",
        "cname": "奥希科托",
        "pid": "5600"
      },
      {
        "id": "5609",
        "cname": "哈达普",
        "pid": "5600"
      },
      {
        "id": "5610",
        "cname": "霍马斯",
        "pid": "5600"
      },
      {
        "id": "5611",
        "cname": "卡拉斯",
        "pid": "5600"
      },
      {
        "id": "5612",
        "cname": "卡普里维",
        "pid": "5600"
      },
      {
        "id": "5613",
        "cname": "库内内",
        "pid": "5600"
      },
      {
        "id": "100096",
        "cname": "其他",
        "pid": "5600"
      }
    ]
  },
  {
    "id": "5614",
    "cname": "南非",
    "pid": "",
    "childrens": [
      {
        "id": "5615",
        "cname": "阿平顿",
        "pid": "5614"
      },
      {
        "id": "5616",
        "cname": "艾利弗山",
        "pid": "5614"
      },
      {
        "id": "5617",
        "cname": "彼德马里茨堡",
        "pid": "5614"
      },
      {
        "id": "5618",
        "cname": "彼德斯堡",
        "pid": "5614"
      },
      {
        "id": "5619",
        "cname": "比勒陀利亚",
        "pid": "5614"
      },
      {
        "id": "5620",
        "cname": "比索",
        "pid": "5614"
      },
      {
        "id": "5621",
        "cname": "布雷达斯多普",
        "pid": "5614"
      },
      {
        "id": "5622",
        "cname": "布隆方丹",
        "pid": "5614"
      },
      {
        "id": "5623",
        "cname": "布隆克斯特斯普利特",
        "pid": "5614"
      },
      {
        "id": "5624",
        "cname": "德阿尔",
        "pid": "5614"
      },
      {
        "id": "5625",
        "cname": "德班",
        "pid": "5614"
      },
      {
        "id": "5626",
        "cname": "邓迪",
        "pid": "5614"
      },
      {
        "id": "5627",
        "cname": "东巴克利",
        "pid": "5614"
      },
      {
        "id": "5628",
        "cname": "东伦敦",
        "pid": "5614"
      },
      {
        "id": "5629",
        "cname": "弗雷堡",
        "pid": "5614"
      },
      {
        "id": "5630",
        "cname": "弗里尼欣",
        "pid": "5614"
      },
      {
        "id": "5631",
        "cname": "格罗布莱斯达尔",
        "pid": "5614"
      },
      {
        "id": "5632",
        "cname": "基雅尼",
        "pid": "5614"
      },
      {
        "id": "5633",
        "cname": "金伯利",
        "pid": "5614"
      },
      {
        "id": "5634",
        "cname": "开普敦",
        "pid": "5614"
      },
      {
        "id": "5635",
        "cname": "克莱克斯多普",
        "pid": "5614"
      },
      {
        "id": "5636",
        "cname": "库鲁曼",
        "pid": "5614"
      },
      {
        "id": "5637",
        "cname": "昆士敦",
        "pid": "5614"
      },
      {
        "id": "5638",
        "cname": "莱迪史密斯",
        "pid": "5614"
      },
      {
        "id": "5639",
        "cname": "兰德方丹",
        "pid": "5614"
      },
      {
        "id": "5640",
        "cname": "理查兹湾",
        "pid": "5614"
      },
      {
        "id": "5641",
        "cname": "利斯滕堡",
        "pid": "5614"
      },
      {
        "id": "5642",
        "cname": "米德尔堡",
        "pid": "5614"
      },
      {
        "id": "5643",
        "cname": "姆库泽",
        "pid": "5614"
      },
      {
        "id": "5644",
        "cname": "穆里斯堡",
        "pid": "5614"
      },
      {
        "id": "5645",
        "cname": "内尔斯普雷特",
        "pid": "5614"
      },
      {
        "id": "5646",
        "cname": "尼尔斯特隆",
        "pid": "5614"
      },
      {
        "id": "5647",
        "cname": "纽卡斯尔",
        "pid": "5614"
      },
      {
        "id": "5648",
        "cname": "乔治",
        "pid": "5614"
      },
      {
        "id": "5649",
        "cname": "萨索尔堡",
        "pid": "5614"
      },
      {
        "id": "5650",
        "cname": "瑟孔达",
        "pid": "5614"
      },
      {
        "id": "5651",
        "cname": "特克索波",
        "pid": "5614"
      },
      {
        "id": "5652",
        "cname": "特隆普斯堡",
        "pid": "5614"
      },
      {
        "id": "5653",
        "cname": "跳羚",
        "pid": "5614"
      },
      {
        "id": "5654",
        "cname": "图拉马哈谢",
        "pid": "5614"
      },
      {
        "id": "5655",
        "cname": "托霍延杜",
        "pid": "5614"
      },
      {
        "id": "5656",
        "cname": "韦茨肖克",
        "pid": "5614"
      },
      {
        "id": "5657",
        "cname": "韦尔科姆",
        "pid": "5614"
      },
      {
        "id": "5658",
        "cname": "乌伦迪",
        "pid": "5614"
      },
      {
        "id": "5659",
        "cname": "乌姆塔塔",
        "pid": "5614"
      },
      {
        "id": "5660",
        "cname": "伍斯特",
        "pid": "5614"
      },
      {
        "id": "5661",
        "cname": "西博福特",
        "pid": "5614"
      },
      {
        "id": "5662",
        "cname": "谢普斯通港",
        "pid": "5614"
      },
      {
        "id": "5663",
        "cname": "伊丽莎白港",
        "pid": "5614"
      },
      {
        "id": "5664",
        "cname": "约翰内斯堡",
        "pid": "5614"
      },
      {
        "id": "100097",
        "cname": "其他",
        "pid": "5614"
      }
    ]
  },
  {
    "id": "5665",
    "cname": "南极洲",
    "pid": ""
  },
  {
    "id": "5666",
    "cname": "南乔治亚和南桑德威奇群岛",
    "pid": ""
  },
  {
    "id": "5667",
    "cname": "瑙鲁",
    "pid": ""
  },
  {
    "id": "5668",
    "cname": "尼泊尔",
    "pid": "",
    "childrens": [
      {
        "id": "5669",
        "cname": "巴格马蒂",
        "pid": "5668"
      },
      {
        "id": "5670",
        "cname": "道拉吉里",
        "pid": "5668"
      },
      {
        "id": "5671",
        "cname": "甘达基",
        "pid": "5668"
      },
      {
        "id": "5672",
        "cname": "戈西",
        "pid": "5668"
      },
      {
        "id": "5673",
        "cname": "格尔纳利",
        "pid": "5668"
      },
      {
        "id": "5674",
        "cname": "贾纳克布尔",
        "pid": "5668"
      },
      {
        "id": "5675",
        "cname": "拉布蒂",
        "pid": "5668"
      },
      {
        "id": "5676",
        "cname": "蓝毗尼",
        "pid": "5668"
      },
      {
        "id": "5677",
        "cname": "马哈卡利",
        "pid": "5668"
      },
      {
        "id": "5678",
        "cname": "梅吉",
        "pid": "5668"
      },
      {
        "id": "5679",
        "cname": "纳拉亚尼",
        "pid": "5668"
      },
      {
        "id": "5680",
        "cname": "佩里",
        "pid": "5668"
      },
      {
        "id": "5681",
        "cname": "萨加玛塔",
        "pid": "5668"
      },
      {
        "id": "5682",
        "cname": "塞蒂",
        "pid": "5668"
      },
      {
        "id": "100273",
        "cname": "其他",
        "pid": "5668"
      }
    ]
  },
  {
    "id": "5683",
    "cname": "尼加拉瓜",
    "pid": "",
    "childrens": [
      {
        "id": "5684",
        "cname": "埃斯特利",
        "pid": "5683"
      },
      {
        "id": "5685",
        "cname": "北大西洋",
        "pid": "5683"
      },
      {
        "id": "5686",
        "cname": "博阿科",
        "pid": "5683"
      },
      {
        "id": "5687",
        "cname": "格拉纳达",
        "pid": "5683"
      },
      {
        "id": "5688",
        "cname": "卡拉索",
        "pid": "5683"
      },
      {
        "id": "5689",
        "cname": "莱昂",
        "pid": "5683"
      },
      {
        "id": "5690",
        "cname": "里瓦斯",
        "pid": "5683"
      },
      {
        "id": "5691",
        "cname": "马德里斯",
        "pid": "5683"
      },
      {
        "id": "5692",
        "cname": "马那瓜",
        "pid": "5683"
      },
      {
        "id": "5693",
        "cname": "马萨亚",
        "pid": "5683"
      },
      {
        "id": "5694",
        "cname": "马塔加尔帕",
        "pid": "5683"
      },
      {
        "id": "5695",
        "cname": "南大西洋",
        "pid": "5683"
      },
      {
        "id": "5696",
        "cname": "奇南德加",
        "pid": "5683"
      },
      {
        "id": "5697",
        "cname": "琼塔莱斯",
        "pid": "5683"
      },
      {
        "id": "5698",
        "cname": "圣胡安河",
        "pid": "5683"
      },
      {
        "id": "5699",
        "cname": "希诺特加",
        "pid": "5683"
      },
      {
        "id": "5700",
        "cname": "新塞哥维亚",
        "pid": "5683"
      },
      {
        "id": "100098",
        "cname": "其他",
        "pid": "5683"
      }
    ]
  },
  {
    "id": "5701",
    "cname": "尼日尔",
    "pid": "",
    "childrens": [
      {
        "id": "5702",
        "cname": "阿加德兹",
        "pid": "5701"
      },
      {
        "id": "5703",
        "cname": "迪法",
        "pid": "5701"
      },
      {
        "id": "5704",
        "cname": "蒂拉贝里",
        "pid": "5701"
      },
      {
        "id": "5705",
        "cname": "多索",
        "pid": "5701"
      },
      {
        "id": "5706",
        "cname": "津德尔",
        "pid": "5701"
      },
      {
        "id": "5707",
        "cname": "马拉迪",
        "pid": "5701"
      },
      {
        "id": "5708",
        "cname": "尼亚美市",
        "pid": "5701"
      },
      {
        "id": "5709",
        "cname": "塔瓦",
        "pid": "5701"
      },
      {
        "id": "100099",
        "cname": "其他",
        "pid": "5701"
      }
    ]
  },
  {
    "id": "5710",
    "cname": "尼日利亚",
    "pid": "",
    "childrens": [
      {
        "id": "5711",
        "cname": "阿比亚",
        "pid": "5710"
      },
      {
        "id": "5712",
        "cname": "奥博莫绍",
        "pid": "5710"
      },
      {
        "id": "5713",
        "cname": "卡诺",
        "pid": "5710"
      },
      {
        "id": "5714",
        "cname": "拉各斯",
        "pid": "5710"
      },
      {
        "id": "5715",
        "cname": "伊巴丹",
        "pid": "5710"
      },
      {
        "id": "100100",
        "cname": "其他",
        "pid": "5710"
      }
    ]
  },
  {
    "id": "5716",
    "cname": "纽埃",
    "pid": ""
  },
  {
    "id": "5717",
    "cname": "挪威",
    "pid": "",
    "childrens": [
      {
        "id": "5718",
        "cname": "阿克什胡斯",
        "pid": "5717"
      },
      {
        "id": "5719",
        "cname": "奥普兰",
        "pid": "5717"
      },
      {
        "id": "5720",
        "cname": "奥斯陆市",
        "pid": "5717"
      },
      {
        "id": "5721",
        "cname": "北特伦德拉格",
        "pid": "5717"
      },
      {
        "id": "5722",
        "cname": "布斯克吕",
        "pid": "5717"
      },
      {
        "id": "5723",
        "cname": "东阿格德尔",
        "pid": "5717"
      },
      {
        "id": "5724",
        "cname": "东福尔",
        "pid": "5717"
      },
      {
        "id": "5725",
        "cname": "芬马克",
        "pid": "5717"
      },
      {
        "id": "5726",
        "cname": "海德马克",
        "pid": "5717"
      },
      {
        "id": "5727",
        "cname": "霍达兰",
        "pid": "5717"
      },
      {
        "id": "5728",
        "cname": "罗加兰",
        "pid": "5717"
      },
      {
        "id": "5729",
        "cname": "默勒－鲁姆斯达尔",
        "pid": "5717"
      },
      {
        "id": "5730",
        "cname": "南特伦德拉格",
        "pid": "5717"
      },
      {
        "id": "5731",
        "cname": "诺尔兰",
        "pid": "5717"
      },
      {
        "id": "5732",
        "cname": "松恩－菲尤拉讷",
        "pid": "5717"
      },
      {
        "id": "5733",
        "cname": "泰勒马克",
        "pid": "5717"
      },
      {
        "id": "5734",
        "cname": "特罗姆斯",
        "pid": "5717"
      },
      {
        "id": "5735",
        "cname": "西阿格德尔",
        "pid": "5717"
      },
      {
        "id": "5736",
        "cname": "西福尔",
        "pid": "5717"
      },
      {
        "id": "100101",
        "cname": "其他",
        "pid": "5717"
      }
    ]
  },
  {
    "id": "5737",
    "cname": "诺福克",
    "pid": ""
  },
  {
    "id": "5738",
    "cname": "帕劳群岛",
    "pid": ""
  },
  {
    "id": "5739",
    "cname": "皮特凯恩",
    "pid": ""
  },
  {
    "id": "5740",
    "cname": "葡萄牙",
    "pid": "",
    "childrens": [
      {
        "id": "5741",
        "cname": "滨海阿连特茹",
        "pid": "5740"
      },
      {
        "id": "5743",
        "cname": "波尔图",
        "pid": "5740"
      },
      {
        "id": "5744",
        "cname": "杜罗",
        "pid": "5740"
      },
      {
        "id": "5745",
        "cname": "恩特拉杜罗伏日",
        "pid": "5740"
      },
      {
        "id": "5746",
        "cname": "法鲁",
        "pid": "5740"
      },
      {
        "id": "5747",
        "cname": "丰沙尔",
        "pid": "5740"
      },
      {
        "id": "5748",
        "cname": "卡瓦多",
        "pid": "5740"
      },
      {
        "id": "5749",
        "cname": "科瓦贝拉",
        "pid": "5740"
      },
      {
        "id": "5750",
        "cname": "里斯本",
        "pid": "5740"
      },
      {
        "id": "5751",
        "cname": "利巴特茹",
        "pid": "5740"
      },
      {
        "id": "5752",
        "cname": "梅地奥特茹",
        "pid": "5740"
      },
      {
        "id": "5753",
        "cname": "米尼奥-利马",
        "pid": "5740"
      },
      {
        "id": "5754",
        "cname": "内贝拉北",
        "pid": "5740"
      },
      {
        "id": "5755",
        "cname": "内贝拉南",
        "pid": "5740"
      },
      {
        "id": "5756",
        "cname": "内皮尼亚尔北",
        "pid": "5740"
      },
      {
        "id": "5757",
        "cname": "内皮尼亚尔南",
        "pid": "5740"
      },
      {
        "id": "5758",
        "cname": "蓬塔德尔加达",
        "pid": "5740"
      },
      {
        "id": "5759",
        "cname": "塞图巴尔半岛",
        "pid": "5740"
      },
      {
        "id": "5760",
        "cname": "山后",
        "pid": "5740"
      },
      {
        "id": "5761",
        "cname": "上阿连特茹",
        "pid": "5740"
      },
      {
        "id": "5762",
        "cname": "上特拉斯山",
        "pid": "5740"
      },
      {
        "id": "5763",
        "cname": "塔梅加",
        "pid": "5740"
      },
      {
        "id": "5764",
        "cname": "万福",
        "pid": "5740"
      },
      {
        "id": "5765",
        "cname": "西部",
        "pid": "5740"
      },
      {
        "id": "5766",
        "cname": "下阿连特茹",
        "pid": "5740"
      },
      {
        "id": "5767",
        "cname": "下伏日",
        "pid": "5740"
      },
      {
        "id": "5768",
        "cname": "下蒙德古",
        "pid": "5740"
      },
      {
        "id": "5769",
        "cname": "中阿连特茹",
        "pid": "5740"
      },
      {
        "id": "100274",
        "cname": "其他",
        "pid": "5740"
      }
    ]
  },
  {
    "id": "5770",
    "cname": "乔治亚",
    "pid": ""
  },
  {
    "id": "5771",
    "cname": "日本",
    "pid": "",
    "childrens": [
      {
        "id": "5772",
        "cname": "爱媛",
        "pid": "5771"
      },
      {
        "id": "5773",
        "cname": "爱知",
        "pid": "5771"
      },
      {
        "id": "5774",
        "cname": "北海道",
        "pid": "5771"
      },
      {
        "id": "5775",
        "cname": "兵库",
        "pid": "5771"
      },
      {
        "id": "5776",
        "cname": "冲绳",
        "pid": "5771"
      },
      {
        "id": "5777",
        "cname": "茨城",
        "pid": "5771"
      },
      {
        "id": "5815",
        "cname": "长崎",
        "pid": "5771"
      },
      {
        "id": "5816",
        "cname": "长野",
        "pid": "5771"
      },
      {
        "id": "5778",
        "cname": "大阪",
        "pid": "5771"
      },
      {
        "id": "5779",
        "cname": "大分",
        "pid": "5771"
      },
      {
        "id": "5780",
        "cname": "岛根",
        "pid": "5771"
      },
      {
        "id": "5781",
        "cname": "徳岛",
        "pid": "5771"
      },
      {
        "id": "5782",
        "cname": "东京",
        "pid": "5771"
      },
      {
        "id": "5783",
        "cname": "福岛",
        "pid": "5771"
      },
      {
        "id": "5784",
        "cname": "福冈",
        "pid": "5771"
      },
      {
        "id": "5785",
        "cname": "福井",
        "pid": "5771"
      },
      {
        "id": "5786",
        "cname": "富山",
        "pid": "5771"
      },
      {
        "id": "5787",
        "cname": "冈山",
        "pid": "5771"
      },
      {
        "id": "5788",
        "cname": "高知",
        "pid": "5771"
      },
      {
        "id": "5789",
        "cname": "宮城",
        "pid": "5771"
      },
      {
        "id": "5790",
        "cname": "宫崎",
        "pid": "5771"
      },
      {
        "id": "5791",
        "cname": "广岛",
        "pid": "5771"
      },
      {
        "id": "5792",
        "cname": "和歌山",
        "pid": "5771"
      },
      {
        "id": "5793",
        "cname": "京都",
        "pid": "5771"
      },
      {
        "id": "5794",
        "cname": "静冈",
        "pid": "5771"
      },
      {
        "id": "5795",
        "cname": "枥木",
        "pid": "5771"
      },
      {
        "id": "5796",
        "cname": "鹿儿岛",
        "pid": "5771"
      },
      {
        "id": "5797",
        "cname": "奈良",
        "pid": "5771"
      },
      {
        "id": "5798",
        "cname": "鸟取",
        "pid": "5771"
      },
      {
        "id": "5799",
        "cname": "岐阜",
        "pid": "5771"
      },
      {
        "id": "5800",
        "cname": "埼玉",
        "pid": "5771"
      },
      {
        "id": "5801",
        "cname": "千叶",
        "pid": "5771"
      },
      {
        "id": "5802",
        "cname": "青森",
        "pid": "5771"
      },
      {
        "id": "5803",
        "cname": "秋田",
        "pid": "5771"
      },
      {
        "id": "5804",
        "cname": "群马",
        "pid": "5771"
      },
      {
        "id": "5805",
        "cname": "三重",
        "pid": "5771"
      },
      {
        "id": "5806",
        "cname": "山口",
        "pid": "5771"
      },
      {
        "id": "5807",
        "cname": "山梨",
        "pid": "5771"
      },
      {
        "id": "5808",
        "cname": "山形",
        "pid": "5771"
      },
      {
        "id": "5809",
        "cname": "神奈川",
        "pid": "5771"
      },
      {
        "id": "5810",
        "cname": "石川",
        "pid": "5771"
      },
      {
        "id": "5811",
        "cname": "香川",
        "pid": "5771"
      },
      {
        "id": "5812",
        "cname": "新潟",
        "pid": "5771"
      },
      {
        "id": "5813",
        "cname": "熊本",
        "pid": "5771"
      },
      {
        "id": "5814",
        "cname": "岩手",
        "pid": "5771"
      },
      {
        "id": "5817",
        "cname": "滋贺",
        "pid": "5771"
      },
      {
        "id": "5818",
        "cname": "佐贺",
        "pid": "5771"
      },
      {
        "id": "100149",
        "cname": "其他",
        "pid": "5771"
      }
    ]
  },
  {
    "id": "5819",
    "cname": "瑞典",
    "pid": "",
    "childrens": [
      {
        "id": "5820",
        "cname": "北博滕",
        "pid": "5819"
      },
      {
        "id": "5821",
        "cname": "布莱金厄",
        "pid": "5819"
      },
      {
        "id": "5822",
        "cname": "达拉纳",
        "pid": "5819"
      },
      {
        "id": "5823",
        "cname": "东约特兰",
        "pid": "5819"
      },
      {
        "id": "5824",
        "cname": "厄勒布鲁",
        "pid": "5819"
      },
      {
        "id": "5825",
        "cname": "哥得兰",
        "pid": "5819"
      },
      {
        "id": "5826",
        "cname": "哈兰",
        "pid": "5819"
      },
      {
        "id": "5827",
        "cname": "卡尔马",
        "pid": "5819"
      },
      {
        "id": "5828",
        "cname": "克鲁努贝里",
        "pid": "5819"
      },
      {
        "id": "5829",
        "cname": "南曼兰",
        "pid": "5819"
      },
      {
        "id": "5830",
        "cname": "斯德哥尔摩",
        "pid": "5819"
      },
      {
        "id": "5831",
        "cname": "斯科耐",
        "pid": "5819"
      },
      {
        "id": "5832",
        "cname": "韦姆兰",
        "pid": "5819"
      },
      {
        "id": "5833",
        "cname": "乌普萨拉",
        "pid": "5819"
      },
      {
        "id": "5834",
        "cname": "西博滕",
        "pid": "5819"
      },
      {
        "id": "5835",
        "cname": "西曼兰",
        "pid": "5819"
      },
      {
        "id": "5836",
        "cname": "西诺尔兰",
        "pid": "5819"
      },
      {
        "id": "5837",
        "cname": "西约特兰",
        "pid": "5819"
      },
      {
        "id": "5838",
        "cname": "延雪平",
        "pid": "5819"
      },
      {
        "id": "5839",
        "cname": "耶夫勒堡",
        "pid": "5819"
      },
      {
        "id": "5840",
        "cname": "耶姆特兰",
        "pid": "5819"
      },
      {
        "id": "100275",
        "cname": "其他",
        "pid": "5819"
      }
    ]
  },
  {
    "id": "5841",
    "cname": "瑞士",
    "pid": "",
    "childrens": [
      {
        "id": "5842",
        "cname": "阿尔高",
        "pid": "5841"
      },
      {
        "id": "5843",
        "cname": "巴塞尔城市",
        "pid": "5841"
      },
      {
        "id": "5844",
        "cname": "巴塞尔乡村",
        "pid": "5841"
      },
      {
        "id": "5845",
        "cname": "伯尔尼",
        "pid": "5841"
      },
      {
        "id": "5846",
        "cname": "楚格",
        "pid": "5841"
      },
      {
        "id": "5847",
        "cname": "弗里堡",
        "pid": "5841"
      },
      {
        "id": "5848",
        "cname": "格拉鲁斯",
        "pid": "5841"
      },
      {
        "id": "5849",
        "cname": "格劳宾登",
        "pid": "5841"
      },
      {
        "id": "5850",
        "cname": "卢塞恩",
        "pid": "5841"
      },
      {
        "id": "5851",
        "cname": "洛桑",
        "pid": "5841"
      },
      {
        "id": "5852",
        "cname": "纳沙泰尔",
        "pid": "5841"
      },
      {
        "id": "5853",
        "cname": "内阿彭策尔",
        "pid": "5841"
      },
      {
        "id": "5854",
        "cname": "日内瓦",
        "pid": "5841"
      },
      {
        "id": "5855",
        "cname": "汝拉",
        "pid": "5841"
      },
      {
        "id": "5856",
        "cname": "沙夫豪森",
        "pid": "5841"
      },
      {
        "id": "5857",
        "cname": "上瓦尔登",
        "pid": "5841"
      },
      {
        "id": "5858",
        "cname": "圣加仑",
        "pid": "5841"
      },
      {
        "id": "5859",
        "cname": "施维茨",
        "pid": "5841"
      },
      {
        "id": "5860",
        "cname": "苏黎世",
        "pid": "5841"
      },
      {
        "id": "5861",
        "cname": "索洛图恩",
        "pid": "5841"
      },
      {
        "id": "5862",
        "cname": "提契诺",
        "pid": "5841"
      },
      {
        "id": "5863",
        "cname": "图尔高",
        "pid": "5841"
      },
      {
        "id": "5864",
        "cname": "瓦莱",
        "pid": "5841"
      },
      {
        "id": "5865",
        "cname": "外阿彭策尔",
        "pid": "5841"
      },
      {
        "id": "5866",
        "cname": "沃",
        "pid": "5841"
      },
      {
        "id": "5867",
        "cname": "乌里",
        "pid": "5841"
      },
      {
        "id": "5868",
        "cname": "下瓦尔登",
        "pid": "5841"
      },
      {
        "id": "100102",
        "cname": "其他",
        "pid": "5841"
      }
    ]
  },
  {
    "id": "5869",
    "cname": "萨尔瓦多",
    "pid": "",
    "childrens": [
      {
        "id": "5870",
        "cname": "阿波帕",
        "pid": "5869"
      },
      {
        "id": "5871",
        "cname": "阿瓦查潘",
        "pid": "5869"
      },
      {
        "id": "5872",
        "cname": "滨海",
        "pid": "5869"
      },
      {
        "id": "5873",
        "cname": "查拉特南戈",
        "pid": "5869"
      },
      {
        "id": "5874",
        "cname": "德尔加多",
        "pid": "5869"
      },
      {
        "id": "5875",
        "cname": "基埃-恩特姆",
        "pid": "5869"
      },
      {
        "id": "5876",
        "cname": "卡瓦尼亚斯",
        "pid": "5869"
      },
      {
        "id": "5877",
        "cname": "库斯卡特兰",
        "pid": "5869"
      },
      {
        "id": "5878",
        "cname": "拉巴斯",
        "pid": "5869"
      },
      {
        "id": "5879",
        "cname": "拉利伯塔德",
        "pid": "5869"
      },
      {
        "id": "5880",
        "cname": "拉乌尼翁",
        "pid": "5869"
      },
      {
        "id": "5881",
        "cname": "梅基卡诺斯",
        "pid": "5869"
      },
      {
        "id": "5882",
        "cname": "莫拉桑",
        "pid": "5869"
      },
      {
        "id": "5883",
        "cname": "圣安娜",
        "pid": "5869"
      },
      {
        "id": "5884",
        "cname": "圣米格尔",
        "pid": "5869"
      },
      {
        "id": "5885",
        "cname": "圣萨尔瓦多",
        "pid": "5869"
      },
      {
        "id": "5886",
        "cname": "圣维森特",
        "pid": "5869"
      },
      {
        "id": "5887",
        "cname": "松索纳特",
        "pid": "5869"
      },
      {
        "id": "5888",
        "cname": "索亚潘戈",
        "pid": "5869"
      },
      {
        "id": "5889",
        "cname": "韦莱-恩萨斯",
        "pid": "5869"
      },
      {
        "id": "5890",
        "cname": "乌苏卢坦",
        "pid": "5869"
      },
      {
        "id": "5891",
        "cname": "伊洛潘戈",
        "pid": "5869"
      },
      {
        "id": "5892",
        "cname": "中南",
        "pid": "5869"
      },
      {
        "id": "100103",
        "cname": "其他",
        "pid": "5869"
      }
    ]
  },
  {
    "id": "5893",
    "cname": "萨摩亚",
    "pid": ""
  },
  {
    "id": "5903",
    "cname": "塞拉利昂",
    "pid": "",
    "childrens": [
      {
        "id": "5904",
        "cname": "北部",
        "pid": "5903"
      },
      {
        "id": "5905",
        "cname": "东部",
        "pid": "5903"
      },
      {
        "id": "5906",
        "cname": "南部",
        "pid": "5903"
      },
      {
        "id": "5907",
        "cname": "西部区",
        "pid": "5903"
      },
      {
        "id": "100277",
        "cname": "其他",
        "pid": "5903"
      }
    ]
  },
  {
    "id": "5908",
    "cname": "塞内加尔",
    "pid": "",
    "childrens": [
      {
        "id": "5909",
        "cname": "达喀尔",
        "pid": "5908"
      },
      {
        "id": "5910",
        "cname": "法蒂克",
        "pid": "5908"
      },
      {
        "id": "5911",
        "cname": "济金绍尔",
        "pid": "5908"
      },
      {
        "id": "5912",
        "cname": "捷斯",
        "pid": "5908"
      },
      {
        "id": "5913",
        "cname": "久尔贝勒",
        "pid": "5908"
      },
      {
        "id": "5914",
        "cname": "考拉克",
        "pid": "5908"
      },
      {
        "id": "5915",
        "cname": "科尔达",
        "pid": "5908"
      },
      {
        "id": "5916",
        "cname": "卢加",
        "pid": "5908"
      },
      {
        "id": "5917",
        "cname": "马塔姆",
        "pid": "5908"
      },
      {
        "id": "5918",
        "cname": "圣路易",
        "pid": "5908"
      },
      {
        "id": "5919",
        "cname": "坦巴昆达",
        "pid": "5908"
      },
      {
        "id": "100437",
        "cname": "其他",
        "pid": "5908"
      }
    ]
  },
  {
    "id": "5920",
    "cname": "塞浦路斯",
    "pid": "",
    "childrens": [
      {
        "id": "5921",
        "cname": "法马古斯塔",
        "pid": "5920"
      },
      {
        "id": "5922",
        "cname": "凯里尼亚",
        "pid": "5920"
      },
      {
        "id": "5923",
        "cname": "拉纳卡",
        "pid": "5920"
      },
      {
        "id": "5924",
        "cname": "利马索尔",
        "pid": "5920"
      },
      {
        "id": "5925",
        "cname": "尼科西亚",
        "pid": "5920"
      },
      {
        "id": "5926",
        "cname": "帕福斯",
        "pid": "5920"
      },
      {
        "id": "100461",
        "cname": "其他",
        "pid": "5920"
      }
    ]
  },
  {
    "id": "5927",
    "cname": "塞舌尔",
    "pid": ""
  },
  {
    "id": "5928",
    "cname": "沙特阿拉伯",
    "pid": "",
    "childrens": [
      {
        "id": "5929",
        "cname": "阿尔阿尔",
        "pid": "5928"
      },
      {
        "id": "5930",
        "cname": "艾卜哈",
        "pid": "5928"
      },
      {
        "id": "5931",
        "cname": "巴哈",
        "pid": "5928"
      },
      {
        "id": "5932",
        "cname": "布赖代",
        "pid": "5928"
      },
      {
        "id": "5933",
        "cname": "达曼",
        "pid": "5928"
      },
      {
        "id": "5934",
        "cname": "哈费尔巴廷",
        "pid": "5928"
      },
      {
        "id": "5935",
        "cname": "哈伊勒",
        "pid": "5928"
      },
      {
        "id": "5936",
        "cname": "海米斯穆谢特",
        "pid": "5928"
      },
      {
        "id": "5937",
        "cname": "海耶",
        "pid": "5928"
      },
      {
        "id": "5938",
        "cname": "胡富夫",
        "pid": "5928"
      },
      {
        "id": "5939",
        "cname": "吉达",
        "pid": "5928"
      },
      {
        "id": "5940",
        "cname": "吉赞",
        "pid": "5928"
      },
      {
        "id": "5941",
        "cname": "利雅得",
        "pid": "5928"
      },
      {
        "id": "5942",
        "cname": "麦地那",
        "pid": "5928"
      },
      {
        "id": "5943",
        "cname": "麦加",
        "pid": "5928"
      },
      {
        "id": "5944",
        "cname": "姆巴拉兹",
        "pid": "5928"
      },
      {
        "id": "5945",
        "cname": "纳季兰",
        "pid": "5928"
      },
      {
        "id": "5946",
        "cname": "塞卡卡",
        "pid": "5928"
      },
      {
        "id": "5947",
        "cname": "塔布克",
        "pid": "5928"
      },
      {
        "id": "5948",
        "cname": "塔伊夫",
        "pid": "5928"
      },
      {
        "id": "5949",
        "cname": "延布",
        "pid": "5928"
      },
      {
        "id": "5950",
        "cname": "朱拜勒",
        "pid": "5928"
      },
      {
        "id": "100104",
        "cname": "其他",
        "pid": "5928"
      }
    ]
  },
  {
    "id": "5951",
    "cname": "圣诞岛",
    "pid": ""
  },
  {
    "id": "5952",
    "cname": "圣多美和普林西比",
    "pid": ""
  },
  {
    "id": "5953",
    "cname": "圣赫勒拿",
    "pid": ""
  },
  {
    "id": "5954",
    "cname": "圣基茨和尼维斯",
    "pid": ""
  },
  {
    "id": "5955",
    "cname": "圣卢西亚",
    "pid": ""
  },
  {
    "id": "5956",
    "cname": "圣马力诺",
    "pid": ""
  },
  {
    "id": "5957",
    "cname": "圣皮埃尔和米克隆群岛",
    "pid": ""
  },
  {
    "id": "5958",
    "cname": "圣文森特和格林纳丁斯",
    "pid": ""
  },
  {
    "id": "5959",
    "cname": "斯里兰卡",
    "pid": "",
    "childrens": [
      {
        "id": "5960",
        "cname": "阿努拉德普勒",
        "pid": "5959"
      },
      {
        "id": "5961",
        "cname": "安帕赖",
        "pid": "5959"
      },
      {
        "id": "5962",
        "cname": "巴杜勒",
        "pid": "5959"
      },
      {
        "id": "5963",
        "cname": "拜蒂克洛",
        "pid": "5959"
      },
      {
        "id": "5964",
        "cname": "波隆纳鲁沃",
        "pid": "5959"
      },
      {
        "id": "5965",
        "cname": "汉班托特",
        "pid": "5959"
      },
      {
        "id": "5966",
        "cname": "基里诺奇",
        "pid": "5959"
      },
      {
        "id": "5967",
        "cname": "加勒",
        "pid": "5959"
      },
      {
        "id": "5968",
        "cname": "加姆珀哈",
        "pid": "5959"
      },
      {
        "id": "5969",
        "cname": "贾夫纳",
        "pid": "5959"
      },
      {
        "id": "5970",
        "cname": "卡卢特勒",
        "pid": "5959"
      },
      {
        "id": "5971",
        "cname": "凯格勒",
        "pid": "5959"
      },
      {
        "id": "5972",
        "cname": "康提",
        "pid": "5959"
      },
      {
        "id": "5973",
        "cname": "科伦坡",
        "pid": "5959"
      },
      {
        "id": "5974",
        "cname": "库鲁内格勒",
        "pid": "5959"
      },
      {
        "id": "5975",
        "cname": "拉特纳普勒",
        "pid": "5959"
      },
      {
        "id": "5976",
        "cname": "马纳尔",
        "pid": "5959"
      },
      {
        "id": "5977",
        "cname": "马特莱",
        "pid": "5959"
      },
      {
        "id": "5978",
        "cname": "马特勒",
        "pid": "5959"
      },
      {
        "id": "5979",
        "cname": "莫讷勒格勒",
        "pid": "5959"
      },
      {
        "id": "5980",
        "cname": "穆莱蒂武",
        "pid": "5959"
      },
      {
        "id": "5981",
        "cname": "努沃勒埃利耶",
        "pid": "5959"
      },
      {
        "id": "5982",
        "cname": "普塔勒姆",
        "pid": "5959"
      },
      {
        "id": "5983",
        "cname": "亭可马里",
        "pid": "5959"
      },
      {
        "id": "5984",
        "cname": "瓦武尼亚",
        "pid": "5959"
      },
      {
        "id": "100105",
        "cname": "其他",
        "pid": "5959"
      }
    ]
  },
  {
    "id": "5985",
    "cname": "斯洛伐克",
    "pid": "",
    "childrens": [
      {
        "id": "5986",
        "cname": "班斯卡-比斯特里察",
        "pid": "5985"
      },
      {
        "id": "5987",
        "cname": "布拉迪斯拉发",
        "pid": "5985"
      },
      {
        "id": "5988",
        "cname": "科希策",
        "pid": "5985"
      },
      {
        "id": "5989",
        "cname": "尼特拉",
        "pid": "5985"
      },
      {
        "id": "5990",
        "cname": "普雷绍夫",
        "pid": "5985"
      },
      {
        "id": "5991",
        "cname": "日利纳",
        "pid": "5985"
      },
      {
        "id": "5992",
        "cname": "特尔纳瓦",
        "pid": "5985"
      },
      {
        "id": "5993",
        "cname": "特伦钦",
        "pid": "5985"
      },
      {
        "id": "100278",
        "cname": "其他",
        "pid": "5985"
      }
    ]
  },
  {
    "id": "5994",
    "cname": "斯洛文尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "5995",
        "cname": "奥巴尔诺-克拉",
        "pid": "5994"
      },
      {
        "id": "5996",
        "cname": "奥斯雷德涅斯洛文",
        "pid": "5994"
      },
      {
        "id": "5997",
        "cname": "波德拉夫",
        "pid": "5994"
      },
      {
        "id": "5998",
        "cname": "波穆尔",
        "pid": "5994"
      },
      {
        "id": "5999",
        "cname": "多雷尼",
        "pid": "5994"
      },
      {
        "id": "6000",
        "cname": "戈雷尼",
        "pid": "5994"
      },
      {
        "id": "6001",
        "cname": "戈里",
        "pid": "5994"
      },
      {
        "id": "6002",
        "cname": "科洛",
        "pid": "5994"
      },
      {
        "id": "6003",
        "cname": "诺特拉尼",
        "pid": "5994"
      },
      {
        "id": "6004",
        "cname": "萨维尼",
        "pid": "5994"
      },
      {
        "id": "6005",
        "cname": "斯波德涅波萨夫",
        "pid": "5994"
      },
      {
        "id": "6006",
        "cname": "扎萨夫",
        "pid": "5994"
      },
      {
        "id": "100150",
        "cname": "其他",
        "pid": "5994"
      }
    ]
  },
  {
    "id": "6007",
    "cname": "斯瓦尔巴和扬马廷",
    "pid": ""
  },
  {
    "id": "6008",
    "cname": "斯威士兰",
    "pid": ""
  },
  {
    "id": "6009",
    "cname": "苏丹",
    "pid": "",
    "childrens": [
      {
        "id": "6010",
        "cname": "北部",
        "pid": "6009"
      },
      {
        "id": "6011",
        "cname": "赤道",
        "pid": "6009"
      },
      {
        "id": "6012",
        "cname": "达尔富尔",
        "pid": "6009"
      },
      {
        "id": "6013",
        "cname": "东部",
        "pid": "6009"
      },
      {
        "id": "6014",
        "cname": "加扎勒河",
        "pid": "6009"
      },
      {
        "id": "6015",
        "cname": "喀土穆",
        "pid": "6009"
      },
      {
        "id": "6016",
        "cname": "科尔多凡",
        "pid": "6009"
      },
      {
        "id": "6017",
        "cname": "上尼罗",
        "pid": "6009"
      },
      {
        "id": "6018",
        "cname": "中部",
        "pid": "6009"
      },
      {
        "id": "100279",
        "cname": "其他",
        "pid": "6009"
      }
    ]
  },
  {
    "id": "6019",
    "cname": "苏里南",
    "pid": "",
    "childrens": [
      {
        "id": "6020",
        "cname": "布罗科蓬多",
        "pid": "6019"
      },
      {
        "id": "6021",
        "cname": "科罗尼",
        "pid": "6019"
      },
      {
        "id": "6022",
        "cname": "科默韦讷",
        "pid": "6019"
      },
      {
        "id": "6023",
        "cname": "马罗韦讷",
        "pid": "6019"
      },
      {
        "id": "6024",
        "cname": "尼克里",
        "pid": "6019"
      },
      {
        "id": "6025",
        "cname": "帕拉",
        "pid": "6019"
      },
      {
        "id": "6026",
        "cname": "帕拉马里博",
        "pid": "6019"
      },
      {
        "id": "6027",
        "cname": "萨拉马卡",
        "pid": "6019"
      },
      {
        "id": "6028",
        "cname": "瓦尼卡",
        "pid": "6019"
      },
      {
        "id": "6029",
        "cname": "西帕里韦尼",
        "pid": "6019"
      },
      {
        "id": "100280",
        "cname": "其他",
        "pid": "6019"
      }
    ]
  },
  {
    "id": "6030",
    "cname": "所罗门群岛",
    "pid": "",
    "childrens": [
      {
        "id": "6031",
        "cname": "瓜达尔卡纳尔",
        "pid": "6030"
      },
      {
        "id": "6032",
        "cname": "霍尼亚拉",
        "pid": "6030"
      },
      {
        "id": "6033",
        "cname": "拉纳尔和贝罗纳",
        "pid": "6030"
      },
      {
        "id": "6034",
        "cname": "马基拉",
        "pid": "6030"
      },
      {
        "id": "6035",
        "cname": "马莱塔",
        "pid": "6030"
      },
      {
        "id": "6036",
        "cname": "乔伊索",
        "pid": "6030"
      },
      {
        "id": "6037",
        "cname": "泰莫图",
        "pid": "6030"
      },
      {
        "id": "6038",
        "cname": "西部",
        "pid": "6030"
      },
      {
        "id": "6039",
        "cname": "伊萨贝尔",
        "pid": "6030"
      },
      {
        "id": "6040",
        "cname": "中部群岛",
        "pid": "6030"
      },
      {
        "id": "100490",
        "cname": "其他",
        "pid": "6030"
      }
    ]
  },
  {
    "id": "6041",
    "cname": "索马里",
    "pid": ""
  },
  {
    "id": "6042",
    "cname": "塔吉克斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "6043",
        "cname": "杜尚别",
        "pid": "6042"
      },
      {
        "id": "6044",
        "cname": "霍罗格",
        "pid": "6042"
      },
      {
        "id": "6045",
        "cname": "卡尼巴达姆",
        "pid": "6042"
      },
      {
        "id": "6046",
        "cname": "科法尔尼洪",
        "pid": "6042"
      },
      {
        "id": "6047",
        "cname": "苦盏",
        "pid": "6042"
      },
      {
        "id": "6048",
        "cname": "库尔干-秋别",
        "pid": "6042"
      },
      {
        "id": "6049",
        "cname": "库洛布",
        "pid": "6042"
      },
      {
        "id": "6050",
        "cname": "洛贡",
        "pid": "6042"
      },
      {
        "id": "6051",
        "cname": "努雷克",
        "pid": "6042"
      },
      {
        "id": "6052",
        "cname": "彭吉肯特",
        "pid": "6042"
      },
      {
        "id": "6053",
        "cname": "萨班特",
        "pid": "6042"
      },
      {
        "id": "6054",
        "cname": "塔博沙尔",
        "pid": "6042"
      },
      {
        "id": "6055",
        "cname": "图尔孙扎德",
        "pid": "6042"
      },
      {
        "id": "6056",
        "cname": "乌拉秋别",
        "pid": "6042"
      },
      {
        "id": "6057",
        "cname": "伊斯法拉",
        "pid": "6042"
      },
      {
        "id": "100438",
        "cname": "其他",
        "pid": "6042"
      }
    ]
  },
  {
    "id": "6058",
    "cname": "泰国",
    "pid": "",
    "childrens": [
      {
        "id": "6059",
        "cname": "安纳乍能",
        "pid": "6058"
      },
      {
        "id": "6060",
        "cname": "巴蜀",
        "pid": "6058"
      },
      {
        "id": "6061",
        "cname": "巴吞他尼",
        "pid": "6058"
      },
      {
        "id": "6062",
        "cname": "巴真",
        "pid": "6058"
      },
      {
        "id": "6063",
        "cname": "北碧",
        "pid": "6058"
      },
      {
        "id": "6064",
        "cname": "北标",
        "pid": "6058"
      },
      {
        "id": "6065",
        "cname": "北大年",
        "pid": "6058"
      },
      {
        "id": "6066",
        "cname": "北揽",
        "pid": "6058"
      },
      {
        "id": "6067",
        "cname": "北榄坡",
        "pid": "6058"
      },
      {
        "id": "6068",
        "cname": "北柳",
        "pid": "6058"
      },
      {
        "id": "6069",
        "cname": "碧差汶",
        "pid": "6058"
      },
      {
        "id": "6070",
        "cname": "博达伦",
        "pid": "6058"
      },
      {
        "id": "6071",
        "cname": "猜那",
        "pid": "6058"
      },
      {
        "id": "6072",
        "cname": "猜也奔",
        "pid": "6058"
      },
      {
        "id": "6073",
        "cname": "程逸",
        "pid": "6058"
      },
      {
        "id": "6074",
        "cname": "春蓬",
        "pid": "6058"
      },
      {
        "id": "6075",
        "cname": "春武里",
        "pid": "6058"
      },
      {
        "id": "6076",
        "cname": "达",
        "pid": "6058"
      },
      {
        "id": "6077",
        "cname": "达叻",
        "pid": "6058"
      },
      {
        "id": "6078",
        "cname": "大城",
        "pid": "6058"
      },
      {
        "id": "6079",
        "cname": "董里",
        "pid": "6058"
      },
      {
        "id": "6080",
        "cname": "佛丕",
        "pid": "6058"
      },
      {
        "id": "6081",
        "cname": "佛统",
        "pid": "6058"
      },
      {
        "id": "6082",
        "cname": "甘烹碧",
        "pid": "6058"
      },
      {
        "id": "6083",
        "cname": "红统",
        "pid": "6058"
      },
      {
        "id": "6084",
        "cname": "华富里",
        "pid": "6058"
      },
      {
        "id": "6085",
        "cname": "加拉信",
        "pid": "6058"
      },
      {
        "id": "6086",
        "cname": "甲米",
        "pid": "6058"
      },
      {
        "id": "6087",
        "cname": "尖竹汶",
        "pid": "6058"
      },
      {
        "id": "6088",
        "cname": "孔敬",
        "pid": "6058"
      },
      {
        "id": "6089",
        "cname": "拉农",
        "pid": "6058"
      },
      {
        "id": "6090",
        "cname": "廊开",
        "pid": "6058"
      },
      {
        "id": "6091",
        "cname": "廊莫那浦",
        "pid": "6058"
      },
      {
        "id": "6092",
        "cname": "叻丕",
        "pid": "6058"
      },
      {
        "id": "6093",
        "cname": "黎",
        "pid": "6058"
      },
      {
        "id": "6094",
        "cname": "黎逸",
        "pid": "6058"
      },
      {
        "id": "6095",
        "cname": "龙仔厝",
        "pid": "6058"
      },
      {
        "id": "6096",
        "cname": "罗勇",
        "pid": "6058"
      },
      {
        "id": "6097",
        "cname": "洛坤",
        "pid": "6058"
      },
      {
        "id": "6098",
        "cname": "玛哈沙拉堪",
        "pid": "6058"
      },
      {
        "id": "6099",
        "cname": "曼谷",
        "pid": "6058"
      },
      {
        "id": "6100",
        "cname": "莫达汉",
        "pid": "6058"
      },
      {
        "id": "6101",
        "cname": "那空那育",
        "pid": "6058"
      },
      {
        "id": "6102",
        "cname": "那空帕农",
        "pid": "6058"
      },
      {
        "id": "6103",
        "cname": "难",
        "pid": "6058"
      },
      {
        "id": "6104",
        "cname": "南奔",
        "pid": "6058"
      },
      {
        "id": "6105",
        "cname": "暖武里",
        "pid": "6058"
      },
      {
        "id": "6106",
        "cname": "帕",
        "pid": "6058"
      },
      {
        "id": "6107",
        "cname": "帕尧",
        "pid": "6058"
      },
      {
        "id": "6108",
        "cname": "攀牙",
        "pid": "6058"
      },
      {
        "id": "6109",
        "cname": "彭世洛",
        "pid": "6058"
      },
      {
        "id": "6110",
        "cname": "披集",
        "pid": "6058"
      },
      {
        "id": "6111",
        "cname": "普吉",
        "pid": "6058"
      },
      {
        "id": "6112",
        "cname": "清莱",
        "pid": "6058"
      },
      {
        "id": "6113",
        "cname": "清迈",
        "pid": "6058"
      },
      {
        "id": "6114",
        "cname": "色军",
        "pid": "6058"
      },
      {
        "id": "6115",
        "cname": "沙敦",
        "pid": "6058"
      },
      {
        "id": "6116",
        "cname": "沙缴",
        "pid": "6058"
      },
      {
        "id": "6117",
        "cname": "四色菊",
        "pid": "6058"
      },
      {
        "id": "6118",
        "cname": "宋卡",
        "pid": "6058"
      },
      {
        "id": "6119",
        "cname": "素可泰",
        "pid": "6058"
      },
      {
        "id": "6120",
        "cname": "素叻",
        "pid": "6058"
      },
      {
        "id": "6121",
        "cname": "素林",
        "pid": "6058"
      },
      {
        "id": "6122",
        "cname": "素攀武里",
        "pid": "6058"
      },
      {
        "id": "6123",
        "cname": "陶公",
        "pid": "6058"
      },
      {
        "id": "6124",
        "cname": "乌隆",
        "pid": "6058"
      },
      {
        "id": "6125",
        "cname": "乌泰他尼",
        "pid": "6058"
      },
      {
        "id": "6126",
        "cname": "乌汶",
        "pid": "6058"
      },
      {
        "id": "6127",
        "cname": "武里南",
        "pid": "6058"
      },
      {
        "id": "6128",
        "cname": "信武里",
        "pid": "6058"
      },
      {
        "id": "6129",
        "cname": "耶梭通",
        "pid": "6058"
      },
      {
        "id": "6130",
        "cname": "也拉",
        "pid": "6058"
      },
      {
        "id": "6131",
        "cname": "夜丰颂",
        "pid": "6058"
      },
      {
        "id": "6132",
        "cname": "夜功",
        "pid": "6058"
      },
      {
        "id": "100106",
        "cname": "其他",
        "pid": "6058"
      }
    ]
  },
  {
    "id": "6133",
    "cname": "坦桑尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "6134",
        "cname": "阿鲁沙",
        "pid": "6133"
      },
      {
        "id": "6135",
        "cname": "奔巴北",
        "pid": "6133"
      },
      {
        "id": "6136",
        "cname": "奔巴南",
        "pid": "6133"
      },
      {
        "id": "6137",
        "cname": "滨海",
        "pid": "6133"
      },
      {
        "id": "6138",
        "cname": "达累斯萨拉姆",
        "pid": "6133"
      },
      {
        "id": "6139",
        "cname": "多多马",
        "pid": "6133"
      },
      {
        "id": "6140",
        "cname": "基戈马",
        "pid": "6133"
      },
      {
        "id": "6141",
        "cname": "卡盖拉",
        "pid": "6133"
      },
      {
        "id": "6142",
        "cname": "林迪",
        "pid": "6133"
      },
      {
        "id": "6143",
        "cname": "鲁夸",
        "pid": "6133"
      },
      {
        "id": "6144",
        "cname": "鲁伍马",
        "pid": "6133"
      },
      {
        "id": "6145",
        "cname": "马腊",
        "pid": "6133"
      },
      {
        "id": "6146",
        "cname": "曼亚拉",
        "pid": "6133"
      },
      {
        "id": "6147",
        "cname": "莫洛戈罗",
        "pid": "6133"
      },
      {
        "id": "6148",
        "cname": "姆贝亚",
        "pid": "6133"
      },
      {
        "id": "6149",
        "cname": "姆特瓦拉",
        "pid": "6133"
      },
      {
        "id": "6150",
        "cname": "姆万扎",
        "pid": "6133"
      },
      {
        "id": "6151",
        "cname": "乞力马扎罗",
        "pid": "6133"
      },
      {
        "id": "6152",
        "cname": "桑给巴尔",
        "pid": "6133"
      },
      {
        "id": "6153",
        "cname": "桑给巴尔北",
        "pid": "6133"
      },
      {
        "id": "6154",
        "cname": "桑给巴尔南",
        "pid": "6133"
      },
      {
        "id": "6155",
        "cname": "桑给巴尔市和西",
        "pid": "6133"
      },
      {
        "id": "6156",
        "cname": "塔波拉",
        "pid": "6133"
      },
      {
        "id": "6157",
        "cname": "坦噶",
        "pid": "6133"
      },
      {
        "id": "6158",
        "cname": "辛吉达",
        "pid": "6133"
      },
      {
        "id": "6159",
        "cname": "欣延加",
        "pid": "6133"
      },
      {
        "id": "6160",
        "cname": "伊林加",
        "pid": "6133"
      },
      {
        "id": "100107",
        "cname": "其他",
        "pid": "6133"
      }
    ]
  },
  {
    "id": "6161",
    "cname": "汤加",
    "pid": "",
    "childrens": [
      {
        "id": "6162",
        "cname": "埃瓦",
        "pid": "6161"
      },
      {
        "id": "6163",
        "cname": "哈派",
        "pid": "6161"
      },
      {
        "id": "6164",
        "cname": "纽阿斯",
        "pid": "6161"
      },
      {
        "id": "6165",
        "cname": "汤加塔布",
        "pid": "6161"
      },
      {
        "id": "6166",
        "cname": "瓦瓦乌",
        "pid": "6161"
      },
      {
        "id": "100108",
        "cname": "其他",
        "pid": "6161"
      }
    ]
  },
  {
    "id": "6167",
    "cname": "特克斯和凯克特斯群岛",
    "pid": ""
  },
  {
    "id": "6168",
    "cname": "特里斯坦达昆哈",
    "pid": ""
  },
  {
    "id": "6169",
    "cname": "特立尼达和多巴哥",
    "pid": ""
  },
  {
    "id": "6170",
    "cname": "突尼斯",
    "pid": "",
    "childrens": [
      {
        "id": "6171",
        "cname": "艾尔亚奈",
        "pid": "6170"
      },
      {
        "id": "6172",
        "cname": "巴杰",
        "pid": "6170"
      },
      {
        "id": "6173",
        "cname": "本阿鲁斯",
        "pid": "6170"
      },
      {
        "id": "6174",
        "cname": "比塞大",
        "pid": "6170"
      },
      {
        "id": "6175",
        "cname": "吉比利",
        "pid": "6170"
      },
      {
        "id": "6176",
        "cname": "加贝斯",
        "pid": "6170"
      },
      {
        "id": "6177",
        "cname": "加夫萨",
        "pid": "6170"
      },
      {
        "id": "6178",
        "cname": "坚杜拜",
        "pid": "6170"
      },
      {
        "id": "6179",
        "cname": "卡夫",
        "pid": "6170"
      },
      {
        "id": "6180",
        "cname": "卡塞林",
        "pid": "6170"
      },
      {
        "id": "6181",
        "cname": "凯鲁万",
        "pid": "6170"
      },
      {
        "id": "6182",
        "cname": "马赫迪耶",
        "pid": "6170"
      },
      {
        "id": "6183",
        "cname": "马努巴",
        "pid": "6170"
      },
      {
        "id": "6184",
        "cname": "梅德宁",
        "pid": "6170"
      },
      {
        "id": "6185",
        "cname": "莫纳斯提尔",
        "pid": "6170"
      },
      {
        "id": "6186",
        "cname": "纳布勒",
        "pid": "6170"
      },
      {
        "id": "6187",
        "cname": "斯法克斯",
        "pid": "6170"
      },
      {
        "id": "6188",
        "cname": "苏塞",
        "pid": "6170"
      },
      {
        "id": "6189",
        "cname": "泰塔温",
        "pid": "6170"
      },
      {
        "id": "6190",
        "cname": "突尼斯",
        "pid": "6170"
      },
      {
        "id": "6191",
        "cname": "托泽尔",
        "pid": "6170"
      },
      {
        "id": "6192",
        "cname": "西迪布济德",
        "pid": "6170"
      },
      {
        "id": "6193",
        "cname": "锡勒亚奈",
        "pid": "6170"
      },
      {
        "id": "6194",
        "cname": "宰格万",
        "pid": "6170"
      },
      {
        "id": "100151",
        "cname": "其他",
        "pid": "6170"
      }
    ]
  },
  {
    "id": "6195",
    "cname": "图瓦卢",
    "pid": ""
  },
  {
    "id": "6196",
    "cname": "土耳其",
    "pid": "",
    "childrens": [
      {
        "id": "6197",
        "cname": "阿达纳",
        "pid": "6196"
      },
      {
        "id": "6198",
        "cname": "阿德亚曼",
        "pid": "6196"
      },
      {
        "id": "6199",
        "cname": "阿尔达罕",
        "pid": "6196"
      },
      {
        "id": "6200",
        "cname": "阿尔特温",
        "pid": "6196"
      },
      {
        "id": "6201",
        "cname": "阿菲永",
        "pid": "6196"
      },
      {
        "id": "6202",
        "cname": "阿克萨赖",
        "pid": "6196"
      },
      {
        "id": "6203",
        "cname": "阿勒",
        "pid": "6196"
      },
      {
        "id": "6204",
        "cname": "阿马西亚",
        "pid": "6196"
      },
      {
        "id": "6205",
        "cname": "埃迪尔内",
        "pid": "6196"
      },
      {
        "id": "6206",
        "cname": "埃尔津詹",
        "pid": "6196"
      },
      {
        "id": "6207",
        "cname": "埃尔祖鲁姆",
        "pid": "6196"
      },
      {
        "id": "6208",
        "cname": "埃拉泽",
        "pid": "6196"
      },
      {
        "id": "6209",
        "cname": "埃斯基谢希尔",
        "pid": "6196"
      },
      {
        "id": "6211",
        "cname": "安卡拉",
        "pid": "6196"
      },
      {
        "id": "6212",
        "cname": "安塔利亚",
        "pid": "6196"
      },
      {
        "id": "6210",
        "cname": "艾登",
        "pid": "6196"
      },
      {
        "id": "6213",
        "cname": "奥尔杜",
        "pid": "6196"
      },
      {
        "id": "6214",
        "cname": "巴尔腾",
        "pid": "6196"
      },
      {
        "id": "6215",
        "cname": "巴勒克埃西尔",
        "pid": "6196"
      },
      {
        "id": "6216",
        "cname": "巴特曼",
        "pid": "6196"
      },
      {
        "id": "6217",
        "cname": "巴伊布尔特",
        "pid": "6196"
      },
      {
        "id": "6218",
        "cname": "比莱吉克",
        "pid": "6196"
      },
      {
        "id": "6219",
        "cname": "比特利斯",
        "pid": "6196"
      },
      {
        "id": "6220",
        "cname": "宾格尔",
        "pid": "6196"
      },
      {
        "id": "6221",
        "cname": "博卢",
        "pid": "6196"
      },
      {
        "id": "6222",
        "cname": "布尔杜尔",
        "pid": "6196"
      },
      {
        "id": "6223",
        "cname": "布尔萨",
        "pid": "6196"
      },
      {
        "id": "6224",
        "cname": "昌克勒",
        "pid": "6196"
      },
      {
        "id": "6225",
        "cname": "代尼兹利",
        "pid": "6196"
      },
      {
        "id": "6226",
        "cname": "迪亚巴克尔",
        "pid": "6196"
      },
      {
        "id": "6227",
        "cname": "凡",
        "pid": "6196"
      },
      {
        "id": "6228",
        "cname": "哈卡里",
        "pid": "6196"
      },
      {
        "id": "6229",
        "cname": "哈塔伊",
        "pid": "6196"
      },
      {
        "id": "6230",
        "cname": "基利斯",
        "pid": "6196"
      },
      {
        "id": "6231",
        "cname": "吉雷松",
        "pid": "6196"
      },
      {
        "id": "6232",
        "cname": "加济安泰普",
        "pid": "6196"
      },
      {
        "id": "6233",
        "cname": "居米什哈内",
        "pid": "6196"
      },
      {
        "id": "6234",
        "cname": "卡尔斯",
        "pid": "6196"
      },
      {
        "id": "6235",
        "cname": "卡赫拉曼马拉什",
        "pid": "6196"
      },
      {
        "id": "6236",
        "cname": "卡拉比克",
        "pid": "6196"
      },
      {
        "id": "6237",
        "cname": "卡拉曼",
        "pid": "6196"
      },
      {
        "id": "6238",
        "cname": "卡斯塔莫努",
        "pid": "6196"
      },
      {
        "id": "6239",
        "cname": "开塞利",
        "pid": "6196"
      },
      {
        "id": "6240",
        "cname": "科贾埃利",
        "pid": "6196"
      },
      {
        "id": "6241",
        "cname": "柯克拉雷利",
        "pid": "6196"
      },
      {
        "id": "6242",
        "cname": "科尼亚",
        "pid": "6196"
      },
      {
        "id": "6243",
        "cname": "克尔谢希尔",
        "pid": "6196"
      },
      {
        "id": "6244",
        "cname": "克勒克卡莱",
        "pid": "6196"
      },
      {
        "id": "6245",
        "cname": "拉飞",
        "pid": "6196"
      },
      {
        "id": "6246",
        "cname": "里泽",
        "pid": "6196"
      },
      {
        "id": "6247",
        "cname": "马尔丁",
        "pid": "6196"
      },
      {
        "id": "6248",
        "cname": "马拉蒂亚",
        "pid": "6196"
      },
      {
        "id": "6249",
        "cname": "马尼萨",
        "pid": "6196"
      },
      {
        "id": "6250",
        "cname": "穆拉",
        "pid": "6196"
      },
      {
        "id": "6251",
        "cname": "穆什",
        "pid": "6196"
      },
      {
        "id": "6252",
        "cname": "内夫谢希尔",
        "pid": "6196"
      },
      {
        "id": "6253",
        "cname": "尼代",
        "pid": "6196"
      },
      {
        "id": "6254",
        "cname": "恰纳卡莱",
        "pid": "6196"
      },
      {
        "id": "6255",
        "cname": "乔鲁姆",
        "pid": "6196"
      },
      {
        "id": "6256",
        "cname": "屈塔希亚",
        "pid": "6196"
      },
      {
        "id": "6257",
        "cname": "萨卡里亚",
        "pid": "6196"
      },
      {
        "id": "6258",
        "cname": "萨姆松",
        "pid": "6196"
      },
      {
        "id": "6259",
        "cname": "泰基尔达",
        "pid": "6196"
      },
      {
        "id": "6260",
        "cname": "特拉布宗",
        "pid": "6196"
      },
      {
        "id": "6261",
        "cname": "通杰利",
        "pid": "6196"
      },
      {
        "id": "6262",
        "cname": "托卡特",
        "pid": "6196"
      },
      {
        "id": "6263",
        "cname": "乌萨克",
        "pid": "6196"
      },
      {
        "id": "6264",
        "cname": "锡尔纳克",
        "pid": "6196"
      },
      {
        "id": "6265",
        "cname": "锡尔特",
        "pid": "6196"
      },
      {
        "id": "6266",
        "cname": "锡诺普",
        "pid": "6196"
      },
      {
        "id": "6267",
        "cname": "锡瓦斯",
        "pid": "6196"
      },
      {
        "id": "6268",
        "cname": "伊迪尔",
        "pid": "6196"
      },
      {
        "id": "6269",
        "cname": "伊切尔",
        "pid": "6196"
      },
      {
        "id": "6270",
        "cname": "伊斯帕尔塔",
        "pid": "6196"
      },
      {
        "id": "6271",
        "cname": "伊斯坦布尔",
        "pid": "6196"
      },
      {
        "id": "6272",
        "cname": "伊兹密尔",
        "pid": "6196"
      },
      {
        "id": "6273",
        "cname": "约兹加特",
        "pid": "6196"
      },
      {
        "id": "6274",
        "cname": "宗古尔达克",
        "pid": "6196"
      },
      {
        "id": "100109",
        "cname": "其他",
        "pid": "6196"
      }
    ]
  },
  {
    "id": "6275",
    "cname": "土库曼斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "6276",
        "cname": "阿哈尔",
        "pid": "6275"
      },
      {
        "id": "6277",
        "cname": "阿什哈巴德市",
        "pid": "6275"
      },
      {
        "id": "6278",
        "cname": "巴尔坎",
        "pid": "6275"
      },
      {
        "id": "6279",
        "cname": "达沙古兹",
        "pid": "6275"
      },
      {
        "id": "6280",
        "cname": "列巴普",
        "pid": "6275"
      },
      {
        "id": "6281",
        "cname": "马雷",
        "pid": "6275"
      },
      {
        "id": "6282",
        "cname": "涅比特达格",
        "pid": "6275"
      },
      {
        "id": "100110",
        "cname": "其他",
        "pid": "6275"
      }
    ]
  },
  {
    "id": "6283",
    "cname": "托克劳",
    "pid": ""
  },
  {
    "id": "6284",
    "cname": "瓦利斯和福图纳",
    "pid": ""
  },
  {
    "id": "6285",
    "cname": "瓦努阿图",
    "pid": "",
    "childrens": [
      {
        "id": "6286",
        "cname": "马朗帕",
        "pid": "6285"
      },
      {
        "id": "6287",
        "cname": "彭纳马",
        "pid": "6285"
      },
      {
        "id": "6288",
        "cname": "桑马",
        "pid": "6285"
      },
      {
        "id": "6289",
        "cname": "塔菲阿",
        "pid": "6285"
      },
      {
        "id": "6290",
        "cname": "托尔巴",
        "pid": "6285"
      },
      {
        "id": "6291",
        "cname": "谢法",
        "pid": "6285"
      },
      {
        "id": "100557",
        "cname": "其他",
        "pid": "6285"
      }
    ]
  },
  {
    "id": "6292",
    "cname": "危地马拉",
    "pid": "",
    "childrens": [
      {
        "id": "6293",
        "cname": "埃尔普罗格雷索",
        "pid": "6292"
      },
      {
        "id": "6294",
        "cname": "埃斯昆特拉",
        "pid": "6292"
      },
      {
        "id": "6295",
        "cname": "哈拉帕",
        "pid": "6292"
      },
      {
        "id": "6296",
        "cname": "胡蒂亚帕",
        "pid": "6292"
      },
      {
        "id": "6297",
        "cname": "基切",
        "pid": "6292"
      },
      {
        "id": "6298",
        "cname": "克萨尔特南戈",
        "pid": "6292"
      },
      {
        "id": "6299",
        "cname": "雷塔卢莱乌",
        "pid": "6292"
      },
      {
        "id": "6300",
        "cname": "米克斯科",
        "pid": "6292"
      },
      {
        "id": "6301",
        "cname": "佩滕",
        "pid": "6292"
      },
      {
        "id": "6302",
        "cname": "奇基穆拉",
        "pid": "6292"
      },
      {
        "id": "6303",
        "cname": "奇马尔特南戈",
        "pid": "6292"
      },
      {
        "id": "6304",
        "cname": "萨卡帕",
        "pid": "6292"
      },
      {
        "id": "6305",
        "cname": "萨卡特佩克斯",
        "pid": "6292"
      },
      {
        "id": "6306",
        "cname": "上韦拉帕斯",
        "pid": "6292"
      },
      {
        "id": "6307",
        "cname": "圣罗莎",
        "pid": "6292"
      },
      {
        "id": "6308",
        "cname": "圣马科斯",
        "pid": "6292"
      },
      {
        "id": "6309",
        "cname": "苏奇特佩克斯",
        "pid": "6292"
      },
      {
        "id": "6310",
        "cname": "索洛拉",
        "pid": "6292"
      },
      {
        "id": "6311",
        "cname": "托托尼卡潘",
        "pid": "6292"
      },
      {
        "id": "6312",
        "cname": "危地马拉",
        "pid": "6292"
      },
      {
        "id": "6313",
        "cname": "韦韦特南戈",
        "pid": "6292"
      },
      {
        "id": "6314",
        "cname": "下韦拉帕斯",
        "pid": "6292"
      },
      {
        "id": "6315",
        "cname": "新城",
        "pid": "6292"
      },
      {
        "id": "6316",
        "cname": "伊萨瓦尔",
        "pid": "6292"
      },
      {
        "id": "100111",
        "cname": "其他",
        "pid": "6292"
      }
    ]
  },
  {
    "id": "6317",
    "cname": "维尔京群岛，美属",
    "pid": ""
  },
  {
    "id": "6318",
    "cname": "维尔京群岛，英属",
    "pid": ""
  },
  {
    "id": "6319",
    "cname": "委内瑞拉",
    "pid": "",
    "childrens": [
      {
        "id": "6320",
        "cname": "阿拉瓜",
        "pid": "6319"
      },
      {
        "id": "6321",
        "cname": "阿马库罗三角洲",
        "pid": "6319"
      },
      {
        "id": "6322",
        "cname": "阿普雷",
        "pid": "6319"
      },
      {
        "id": "6323",
        "cname": "安索阿特吉",
        "pid": "6319"
      },
      {
        "id": "6324",
        "cname": "巴里纳斯",
        "pid": "6319"
      },
      {
        "id": "6325",
        "cname": "玻利瓦尔",
        "pid": "6319"
      },
      {
        "id": "6326",
        "cname": "波图格萨",
        "pid": "6319"
      },
      {
        "id": "6327",
        "cname": "法尔孔",
        "pid": "6319"
      },
      {
        "id": "6328",
        "cname": "瓜里科",
        "pid": "6319"
      },
      {
        "id": "6329",
        "cname": "加拉加斯",
        "pid": "6319"
      },
      {
        "id": "6330",
        "cname": "卡拉沃沃",
        "pid": "6319"
      },
      {
        "id": "6331",
        "cname": "科赫德斯",
        "pid": "6319"
      },
      {
        "id": "6332",
        "cname": "拉腊",
        "pid": "6319"
      },
      {
        "id": "6333",
        "cname": "联邦属地",
        "pid": "6319"
      },
      {
        "id": "6334",
        "cname": "梅里达",
        "pid": "6319"
      },
      {
        "id": "6335",
        "cname": "米兰达",
        "pid": "6319"
      },
      {
        "id": "6336",
        "cname": "莫纳加斯",
        "pid": "6319"
      },
      {
        "id": "6337",
        "cname": "苏克雷",
        "pid": "6319"
      },
      {
        "id": "6338",
        "cname": "苏利亚",
        "pid": "6319"
      },
      {
        "id": "6339",
        "cname": "塔奇拉",
        "pid": "6319"
      },
      {
        "id": "6340",
        "cname": "特鲁希略",
        "pid": "6319"
      },
      {
        "id": "6341",
        "cname": "新埃斯帕塔",
        "pid": "6319"
      },
      {
        "id": "6342",
        "cname": "亚拉奎",
        "pid": "6319"
      },
      {
        "id": "6343",
        "cname": "亚马孙",
        "pid": "6319"
      },
      {
        "id": "100112",
        "cname": "其他",
        "pid": "6319"
      }
    ]
  },
  {
    "id": "6344",
    "cname": "文莱",
    "pid": ""
  },
  {
    "id": "6345",
    "cname": "乌干达",
    "pid": "",
    "childrens": [
      {
        "id": "6346",
        "cname": "阿鲁阿",
        "pid": "6345"
      },
      {
        "id": "6347",
        "cname": "阿帕克",
        "pid": "6345"
      },
      {
        "id": "6348",
        "cname": "阿朱马尼",
        "pid": "6345"
      },
      {
        "id": "6349",
        "cname": "本迪布焦",
        "pid": "6345"
      },
      {
        "id": "6350",
        "cname": "布吉里",
        "pid": "6345"
      },
      {
        "id": "6351",
        "cname": "布西亚",
        "pid": "6345"
      },
      {
        "id": "6352",
        "cname": "布谢尼",
        "pid": "6345"
      },
      {
        "id": "6353",
        "cname": "恩通加莫",
        "pid": "6345"
      },
      {
        "id": "6354",
        "cname": "古卢",
        "pid": "6345"
      },
      {
        "id": "6355",
        "cname": "霍伊马",
        "pid": "6345"
      },
      {
        "id": "6356",
        "cname": "基巴莱",
        "pid": "6345"
      },
      {
        "id": "6357",
        "cname": "基博加",
        "pid": "6345"
      },
      {
        "id": "6358",
        "cname": "基恩乔乔",
        "pid": "6345"
      },
      {
        "id": "6359",
        "cname": "基索罗",
        "pid": "6345"
      },
      {
        "id": "6360",
        "cname": "基特古姆",
        "pid": "6345"
      },
      {
        "id": "6361",
        "cname": "金贾",
        "pid": "6345"
      },
      {
        "id": "6362",
        "cname": "卡巴莱",
        "pid": "6345"
      },
      {
        "id": "6363",
        "cname": "卡巴罗莱",
        "pid": "6345"
      },
      {
        "id": "6364",
        "cname": "卡贝拉马伊多",
        "pid": "6345"
      },
      {
        "id": "6365",
        "cname": "卡兰加拉",
        "pid": "6345"
      },
      {
        "id": "6366",
        "cname": "卡姆文盖",
        "pid": "6345"
      },
      {
        "id": "6367",
        "cname": "卡穆利",
        "pid": "6345"
      },
      {
        "id": "6368",
        "cname": "卡农古",
        "pid": "6345"
      },
      {
        "id": "6369",
        "cname": "卡普乔鲁瓦",
        "pid": "6345"
      },
      {
        "id": "6370",
        "cname": "卡塞塞",
        "pid": "6345"
      },
      {
        "id": "6371",
        "cname": "卡塔奎",
        "pid": "6345"
      },
      {
        "id": "6372",
        "cname": "卡永加",
        "pid": "6345"
      },
      {
        "id": "6373",
        "cname": "坎帕拉",
        "pid": "6345"
      },
      {
        "id": "6374",
        "cname": "科蒂多",
        "pid": "6345"
      },
      {
        "id": "6375",
        "cname": "库米",
        "pid": "6345"
      },
      {
        "id": "6376",
        "cname": "拉卡伊",
        "pid": "6345"
      },
      {
        "id": "6377",
        "cname": "利拉",
        "pid": "6345"
      },
      {
        "id": "6378",
        "cname": "卢韦罗",
        "pid": "6345"
      },
      {
        "id": "6379",
        "cname": "鲁昆吉里",
        "pid": "6345"
      },
      {
        "id": "6380",
        "cname": "马萨卡",
        "pid": "6345"
      },
      {
        "id": "6381",
        "cname": "马辛迪",
        "pid": "6345"
      },
      {
        "id": "6382",
        "cname": "马尤盖",
        "pid": "6345"
      },
      {
        "id": "6383",
        "cname": "莫罗托",
        "pid": "6345"
      },
      {
        "id": "6384",
        "cname": "莫约",
        "pid": "6345"
      },
      {
        "id": "6385",
        "cname": "姆巴拉拉",
        "pid": "6345"
      },
      {
        "id": "6386",
        "cname": "姆巴莱",
        "pid": "6345"
      },
      {
        "id": "6387",
        "cname": "姆皮吉",
        "pid": "6345"
      },
      {
        "id": "6388",
        "cname": "穆本德",
        "pid": "6345"
      },
      {
        "id": "6389",
        "cname": "穆科诺",
        "pid": "6345"
      },
      {
        "id": "6390",
        "cname": "纳卡皮里皮里特",
        "pid": "6345"
      },
      {
        "id": "6391",
        "cname": "纳卡松戈拉",
        "pid": "6345"
      },
      {
        "id": "6392",
        "cname": "内比",
        "pid": "6345"
      },
      {
        "id": "6393",
        "cname": "帕德尔",
        "pid": "6345"
      },
      {
        "id": "6394",
        "cname": "帕利萨",
        "pid": "6345"
      },
      {
        "id": "6395",
        "cname": "森巴布莱",
        "pid": "6345"
      },
      {
        "id": "6396",
        "cname": "索罗提",
        "pid": "6345"
      },
      {
        "id": "6397",
        "cname": "托罗罗",
        "pid": "6345"
      },
      {
        "id": "6398",
        "cname": "瓦基索",
        "pid": "6345"
      },
      {
        "id": "6399",
        "cname": "锡龙科",
        "pid": "6345"
      },
      {
        "id": "6400",
        "cname": "伊甘加",
        "pid": "6345"
      },
      {
        "id": "6401",
        "cname": "永贝",
        "pid": "6345"
      },
      {
        "id": "100113",
        "cname": "其他",
        "pid": "6345"
      }
    ]
  },
  {
    "id": "6402",
    "cname": "乌克兰",
    "pid": "",
    "childrens": [
      {
        "id": "6403",
        "cname": "敖德萨",
        "pid": "6402"
      },
      {
        "id": "6404",
        "cname": "波尔塔瓦",
        "pid": "6402"
      },
      {
        "id": "6405",
        "cname": "第聂伯罗波得罗夫斯克",
        "pid": "6402"
      },
      {
        "id": "6406",
        "cname": "顿涅茨克",
        "pid": "6402"
      },
      {
        "id": "6407",
        "cname": "哈尔科夫",
        "pid": "6402"
      },
      {
        "id": "6408",
        "cname": "赫尔松州",
        "pid": "6402"
      },
      {
        "id": "6409",
        "cname": "赫梅利尼茨基",
        "pid": "6402"
      },
      {
        "id": "6410",
        "cname": "基辅",
        "pid": "6402"
      },
      {
        "id": "6411",
        "cname": "基洛夫格勒",
        "pid": "6402"
      },
      {
        "id": "6412",
        "cname": "捷尔诺波尔",
        "pid": "6402"
      },
      {
        "id": "6413",
        "cname": "克里米亚自治共和国",
        "pid": "6402"
      },
      {
        "id": "6414",
        "cname": "利沃夫",
        "pid": "6402"
      },
      {
        "id": "6415",
        "cname": "卢甘斯克",
        "pid": "6402"
      },
      {
        "id": "6416",
        "cname": "罗夫诺",
        "pid": "6402"
      },
      {
        "id": "6417",
        "cname": "尼古拉耶夫",
        "pid": "6402"
      },
      {
        "id": "6418",
        "cname": "切尔卡瑟",
        "pid": "6402"
      },
      {
        "id": "6419",
        "cname": "切尔尼戈夫",
        "pid": "6402"
      },
      {
        "id": "6420",
        "cname": "切尔诺夫策",
        "pid": "6402"
      },
      {
        "id": "6421",
        "cname": "日托米尔",
        "pid": "6402"
      },
      {
        "id": "6422",
        "cname": "苏梅",
        "pid": "6402"
      },
      {
        "id": "6423",
        "cname": "外喀尔巴阡",
        "pid": "6402"
      },
      {
        "id": "6424",
        "cname": "文尼察",
        "pid": "6402"
      },
      {
        "id": "6425",
        "cname": "沃伦",
        "pid": "6402"
      },
      {
        "id": "6426",
        "cname": "伊万－弗兰科夫州",
        "pid": "6402"
      },
      {
        "id": "6427",
        "cname": "扎波罗热",
        "pid": "6402"
      },
      {
        "id": "100128",
        "cname": "其他",
        "pid": "6402"
      }
    ]
  },
  {
    "id": "6428",
    "cname": "乌拉圭",
    "pid": "",
    "childrens": [
      {
        "id": "6429",
        "cname": "阿蒂加斯",
        "pid": "6428"
      },
      {
        "id": "6430",
        "cname": "杜拉斯诺",
        "pid": "6428"
      },
      {
        "id": "6431",
        "cname": "佛罗里达",
        "pid": "6428"
      },
      {
        "id": "6432",
        "cname": "弗洛雷斯",
        "pid": "6428"
      },
      {
        "id": "6433",
        "cname": "卡内洛内斯",
        "pid": "6428"
      },
      {
        "id": "6434",
        "cname": "科洛尼亚",
        "pid": "6428"
      },
      {
        "id": "6435",
        "cname": "拉瓦耶哈",
        "pid": "6428"
      },
      {
        "id": "6436",
        "cname": "里韦拉",
        "pid": "6428"
      },
      {
        "id": "6437",
        "cname": "罗恰",
        "pid": "6428"
      },
      {
        "id": "6438",
        "cname": "马尔多纳多",
        "pid": "6428"
      },
      {
        "id": "6439",
        "cname": "蒙得维的亚",
        "pid": "6428"
      },
      {
        "id": "6440",
        "cname": "内格罗河",
        "pid": "6428"
      },
      {
        "id": "6441",
        "cname": "派桑杜",
        "pid": "6428"
      },
      {
        "id": "6442",
        "cname": "萨尔托",
        "pid": "6428"
      },
      {
        "id": "6443",
        "cname": "塞罗拉尔戈",
        "pid": "6428"
      },
      {
        "id": "6444",
        "cname": "三十三人",
        "pid": "6428"
      },
      {
        "id": "6445",
        "cname": "圣何塞",
        "pid": "6428"
      },
      {
        "id": "6446",
        "cname": "索里亚诺",
        "pid": "6428"
      },
      {
        "id": "6447",
        "cname": "塔夸伦博",
        "pid": "6428"
      },
      {
        "id": "100114",
        "cname": "其他",
        "pid": "6428"
      }
    ]
  },
  {
    "id": "6448",
    "cname": "乌兹别克斯坦",
    "pid": "",
    "childrens": [
      {
        "id": "6449",
        "cname": "安集延",
        "pid": "6448"
      },
      {
        "id": "6450",
        "cname": "布哈拉",
        "pid": "6448"
      },
      {
        "id": "6451",
        "cname": "费尔干纳",
        "pid": "6448"
      },
      {
        "id": "6452",
        "cname": "花拉子模",
        "pid": "6448"
      },
      {
        "id": "6453",
        "cname": "吉扎克",
        "pid": "6448"
      },
      {
        "id": "6454",
        "cname": "卡拉卡尔帕克斯坦共和国",
        "pid": "6448"
      },
      {
        "id": "6455",
        "cname": "卡什卡达里亚",
        "pid": "6448"
      },
      {
        "id": "6456",
        "cname": "纳曼干",
        "pid": "6448"
      },
      {
        "id": "6457",
        "cname": "纳沃伊",
        "pid": "6448"
      },
      {
        "id": "6458",
        "cname": "撒马尔罕",
        "pid": "6448"
      },
      {
        "id": "6459",
        "cname": "苏尔汉河",
        "pid": "6448"
      },
      {
        "id": "6460",
        "cname": "塔什干",
        "pid": "6448"
      },
      {
        "id": "6461",
        "cname": "塔什干市",
        "pid": "6448"
      },
      {
        "id": "6462",
        "cname": "锡尔河",
        "pid": "6448"
      },
      {
        "id": "100115",
        "cname": "其他",
        "pid": "6448"
      }
    ]
  },
  {
    "id": "6463",
    "cname": "西班牙",
    "pid": "",
    "childrens": [
      {
        "id": "6464",
        "cname": "阿尔梅里亚",
        "pid": "6463"
      },
      {
        "id": "6465",
        "cname": "阿尔瓦塞特",
        "pid": "6463"
      },
      {
        "id": "6466",
        "cname": "阿拉瓦",
        "pid": "6463"
      },
      {
        "id": "6467",
        "cname": "阿利坎特",
        "pid": "6463"
      },
      {
        "id": "6468",
        "cname": "阿斯图利亚斯",
        "pid": "6463"
      },
      {
        "id": "6469",
        "cname": "阿维拉",
        "pid": "6463"
      },
      {
        "id": "6470",
        "cname": "奥伦塞",
        "pid": "6463"
      },
      {
        "id": "6471",
        "cname": "巴达霍斯",
        "pid": "6463"
      },
      {
        "id": "6472",
        "cname": "巴利阿里",
        "pid": "6463"
      },
      {
        "id": "6473",
        "cname": "巴利亚多利德",
        "pid": "6463"
      },
      {
        "id": "6474",
        "cname": "巴伦西亚",
        "pid": "6463"
      },
      {
        "id": "6475",
        "cname": "巴塞罗那",
        "pid": "6463"
      },
      {
        "id": "6476",
        "cname": "比斯开",
        "pid": "6463"
      },
      {
        "id": "6477",
        "cname": "布尔戈斯",
        "pid": "6463"
      },
      {
        "id": "6478",
        "cname": "格拉纳达",
        "pid": "6463"
      },
      {
        "id": "6479",
        "cname": "瓜达拉哈拉",
        "pid": "6463"
      },
      {
        "id": "6480",
        "cname": "哈恩",
        "pid": "6463"
      },
      {
        "id": "6481",
        "cname": "赫罗纳",
        "pid": "6463"
      },
      {
        "id": "6482",
        "cname": "吉普斯夸",
        "pid": "6463"
      },
      {
        "id": "6483",
        "cname": "加的斯",
        "pid": "6463"
      },
      {
        "id": "6484",
        "cname": "卡塞雷斯",
        "pid": "6463"
      },
      {
        "id": "6485",
        "cname": "卡斯蒂利亚",
        "pid": "6463"
      },
      {
        "id": "6486",
        "cname": "卡斯特利翁",
        "pid": "6463"
      },
      {
        "id": "6487",
        "cname": "科尔多瓦",
        "pid": "6463"
      },
      {
        "id": "6488",
        "cname": "昆卡",
        "pid": "6463"
      },
      {
        "id": "6489",
        "cname": "拉科鲁尼亚",
        "pid": "6463"
      },
      {
        "id": "6490",
        "cname": "拉里奥哈",
        "pid": "6463"
      },
      {
        "id": "6491",
        "cname": "拉斯帕尔马斯",
        "pid": "6463"
      },
      {
        "id": "6492",
        "cname": "莱昂",
        "pid": "6463"
      },
      {
        "id": "6493",
        "cname": "莱里达",
        "pid": "6463"
      },
      {
        "id": "6494",
        "cname": "卢戈",
        "pid": "6463"
      },
      {
        "id": "6495",
        "cname": "马德里",
        "pid": "6463"
      },
      {
        "id": "6496",
        "cname": "马拉加",
        "pid": "6463"
      },
      {
        "id": "6497",
        "cname": "穆尔西亚",
        "pid": "6463"
      },
      {
        "id": "6498",
        "cname": "纳瓦拉",
        "pid": "6463"
      },
      {
        "id": "6499",
        "cname": "帕伦西亚",
        "pid": "6463"
      },
      {
        "id": "6500",
        "cname": "蓬特韦德拉",
        "pid": "6463"
      },
      {
        "id": "6501",
        "cname": "萨拉戈萨",
        "pid": "6463"
      },
      {
        "id": "6502",
        "cname": "萨拉曼卡",
        "pid": "6463"
      },
      {
        "id": "6503",
        "cname": "萨莫拉",
        "pid": "6463"
      },
      {
        "id": "6504",
        "cname": "塞哥维亚",
        "pid": "6463"
      },
      {
        "id": "6505",
        "cname": "塞维利亚",
        "pid": "6463"
      },
      {
        "id": "6506",
        "cname": "桑坦德",
        "pid": "6463"
      },
      {
        "id": "6507",
        "cname": "圣克鲁斯-德特内里费",
        "pid": "6463"
      },
      {
        "id": "6508",
        "cname": "索里亚",
        "pid": "6463"
      },
      {
        "id": "6509",
        "cname": "塔拉戈纳",
        "pid": "6463"
      },
      {
        "id": "6510",
        "cname": "特鲁埃尔",
        "pid": "6463"
      },
      {
        "id": "6511",
        "cname": "托莱多",
        "pid": "6463"
      },
      {
        "id": "6512",
        "cname": "韦尔瓦",
        "pid": "6463"
      },
      {
        "id": "6513",
        "cname": "韦斯卡",
        "pid": "6463"
      },
      {
        "id": "100116",
        "cname": "其他",
        "pid": "6463"
      }
    ]
  },
  {
    "id": "6514",
    "cname": "希腊",
    "pid": "",
    "childrens": [
      {
        "id": "6515",
        "cname": "比雷埃夫斯",
        "pid": "6514"
      },
      {
        "id": "6516",
        "cname": "多德卡尼斯",
        "pid": "6514"
      },
      {
        "id": "6517",
        "cname": "干尼亚",
        "pid": "6514"
      },
      {
        "id": "6518",
        "cname": "基克拉迪",
        "pid": "6514"
      },
      {
        "id": "6519",
        "cname": "拉西锡",
        "pid": "6514"
      },
      {
        "id": "6520",
        "cname": "莱斯博斯",
        "pid": "6514"
      },
      {
        "id": "6521",
        "cname": "雷西姆农",
        "pid": "6514"
      },
      {
        "id": "6522",
        "cname": "萨摩斯",
        "pid": "6514"
      },
      {
        "id": "6523",
        "cname": "雅典",
        "pid": "6514"
      },
      {
        "id": "6524",
        "cname": "伊拉克里翁",
        "pid": "6514"
      },
      {
        "id": "100281",
        "cname": "其他",
        "pid": "6514"
      }
    ]
  },
  {
    "id": "6525",
    "cname": "新加坡",
    "pid": ""
  },
  {
    "id": "6526",
    "cname": "新喀里多尼亚",
    "pid": ""
  },
  {
    "id": "6527",
    "cname": "新西兰",
    "pid": "",
    "childrens": [
      {
        "id": "6528",
        "cname": "奥克兰",
        "pid": "6527"
      },
      {
        "id": "6529",
        "cname": "北岸",
        "pid": "6527"
      },
      {
        "id": "6530",
        "cname": "北帕默斯顿",
        "pid": "6527"
      },
      {
        "id": "6531",
        "cname": "北远",
        "pid": "6527"
      },
      {
        "id": "6532",
        "cname": "布莱尼姆",
        "pid": "6527"
      },
      {
        "id": "6533",
        "cname": "达尼丁",
        "pid": "6527"
      },
      {
        "id": "6534",
        "cname": "格雷茅斯",
        "pid": "6527"
      },
      {
        "id": "6535",
        "cname": "哈密尔顿",
        "pid": "6527"
      },
      {
        "id": "6536",
        "cname": "黑斯廷斯",
        "pid": "6527"
      },
      {
        "id": "6537",
        "cname": "怀塔科拉",
        "pid": "6527"
      },
      {
        "id": "6538",
        "cname": "吉斯伯恩",
        "pid": "6527"
      },
      {
        "id": "6539",
        "cname": "凯帕拉",
        "pid": "6527"
      },
      {
        "id": "6540",
        "cname": "克赖斯特彻奇",
        "pid": "6527"
      },
      {
        "id": "6541",
        "cname": "里士满",
        "pid": "6527"
      },
      {
        "id": "6542",
        "cname": "马努考",
        "pid": "6527"
      },
      {
        "id": "6543",
        "cname": "纳尔逊",
        "pid": "6527"
      },
      {
        "id": "6544",
        "cname": "内皮尔",
        "pid": "6527"
      },
      {
        "id": "6545",
        "cname": "斯特拉特福德",
        "pid": "6527"
      },
      {
        "id": "6546",
        "cname": "陶马鲁努伊",
        "pid": "6527"
      },
      {
        "id": "6547",
        "cname": "瓦卡塔尼",
        "pid": "6527"
      },
      {
        "id": "6548",
        "cname": "旺阿雷",
        "pid": "6527"
      },
      {
        "id": "6549",
        "cname": "旺格努伊",
        "pid": "6527"
      },
      {
        "id": "6550",
        "cname": "新普利茅斯",
        "pid": "6527"
      },
      {
        "id": "6551",
        "cname": "因弗卡吉尔",
        "pid": "6527"
      },
      {
        "id": "100152",
        "cname": "其他",
        "pid": "6527"
      }
    ]
  },
  {
    "id": "6552",
    "cname": "匈牙利",
    "pid": "",
    "childrens": [
      {
        "id": "6553",
        "cname": "巴兰尼亚",
        "pid": "6552"
      },
      {
        "id": "6554",
        "cname": "巴奇-基什孔",
        "pid": "6552"
      },
      {
        "id": "6555",
        "cname": "包尔绍德-奥包乌伊-曾普伦",
        "pid": "6552"
      },
      {
        "id": "6556",
        "cname": "贝凯什",
        "pid": "6552"
      },
      {
        "id": "6557",
        "cname": "布达佩斯",
        "pid": "6552"
      },
      {
        "id": "6558",
        "cname": "费耶尔",
        "pid": "6552"
      },
      {
        "id": "6559",
        "cname": "豪伊杜-比豪尔",
        "pid": "6552"
      },
      {
        "id": "6560",
        "cname": "赫维什",
        "pid": "6552"
      },
      {
        "id": "6561",
        "cname": "加兹-纳杰孔-索尔诺克",
        "pid": "6552"
      },
      {
        "id": "6562",
        "cname": "杰尔-莫松-肖普朗",
        "pid": "6552"
      },
      {
        "id": "6563",
        "cname": "科马罗姆",
        "pid": "6552"
      },
      {
        "id": "6564",
        "cname": "诺格拉德",
        "pid": "6552"
      },
      {
        "id": "6565",
        "cname": "佩斯",
        "pid": "6552"
      },
      {
        "id": "6566",
        "cname": "琼格拉德",
        "pid": "6552"
      },
      {
        "id": "6567",
        "cname": "绍莫吉",
        "pid": "6552"
      },
      {
        "id": "6568",
        "cname": "索博尔奇-索特马尔-贝拉格",
        "pid": "6552"
      },
      {
        "id": "6569",
        "cname": "托尔瑙",
        "pid": "6552"
      },
      {
        "id": "6570",
        "cname": "维斯普雷姆",
        "pid": "6552"
      },
      {
        "id": "6571",
        "cname": "沃什",
        "pid": "6552"
      },
      {
        "id": "6572",
        "cname": "佐洛",
        "pid": "6552"
      },
      {
        "id": "100282",
        "cname": "其他",
        "pid": "6552"
      }
    ]
  },
  {
    "id": "6573",
    "cname": "叙利亚",
    "pid": "",
    "childrens": [
      {
        "id": "6574",
        "cname": "阿勒颇",
        "pid": "6573"
      },
      {
        "id": "6575",
        "cname": "大马士革",
        "pid": "6573"
      },
      {
        "id": "6576",
        "cname": "大马士革市",
        "pid": "6573"
      },
      {
        "id": "6577",
        "cname": "代尔祖尔",
        "pid": "6573"
      },
      {
        "id": "6578",
        "cname": "德拉",
        "pid": "6573"
      },
      {
        "id": "6579",
        "cname": "哈马",
        "pid": "6573"
      },
      {
        "id": "6580",
        "cname": "哈塞克",
        "pid": "6573"
      },
      {
        "id": "6581",
        "cname": "霍姆斯",
        "pid": "6573"
      },
      {
        "id": "6582",
        "cname": "加布",
        "pid": "6573"
      },
      {
        "id": "6583",
        "cname": "卡米什利",
        "pid": "6573"
      },
      {
        "id": "6584",
        "cname": "库奈特拉",
        "pid": "6573"
      },
      {
        "id": "6585",
        "cname": "拉卡",
        "pid": "6573"
      },
      {
        "id": "6586",
        "cname": "拉塔基亚",
        "pid": "6573"
      },
      {
        "id": "6587",
        "cname": "苏韦达",
        "pid": "6573"
      },
      {
        "id": "6588",
        "cname": "塔尔图斯",
        "pid": "6573"
      },
      {
        "id": "6589",
        "cname": "伊德利卜",
        "pid": "6573"
      },
      {
        "id": "100117",
        "cname": "其他",
        "pid": "6573"
      }
    ]
  },
  {
    "id": "6590",
    "cname": "牙买加",
    "pid": "",
    "childrens": [
      {
        "id": "6591",
        "cname": "波特兰",
        "pid": "6590"
      },
      {
        "id": "6592",
        "cname": "汉诺威",
        "pid": "6590"
      },
      {
        "id": "6593",
        "cname": "金斯敦",
        "pid": "6590"
      },
      {
        "id": "6594",
        "cname": "克拉伦登",
        "pid": "6590"
      },
      {
        "id": "6595",
        "cname": "曼彻斯特",
        "pid": "6590"
      },
      {
        "id": "6596",
        "cname": "圣安德鲁斯",
        "pid": "6590"
      },
      {
        "id": "6597",
        "cname": "圣安娜",
        "pid": "6590"
      },
      {
        "id": "6598",
        "cname": "圣凯瑟琳",
        "pid": "6590"
      },
      {
        "id": "6599",
        "cname": "圣玛丽",
        "pid": "6590"
      },
      {
        "id": "6600",
        "cname": "圣托马斯",
        "pid": "6590"
      },
      {
        "id": "6601",
        "cname": "圣伊丽莎白",
        "pid": "6590"
      },
      {
        "id": "6602",
        "cname": "圣詹姆斯",
        "pid": "6590"
      },
      {
        "id": "6603",
        "cname": "特里洛尼",
        "pid": "6590"
      },
      {
        "id": "6604",
        "cname": "西摩兰",
        "pid": "6590"
      },
      {
        "id": "100283",
        "cname": "其他",
        "pid": "6590"
      }
    ]
  },
  {
    "id": "6605",
    "cname": "亚美尼亚",
    "pid": "",
    "childrens": [
      {
        "id": "6606",
        "cname": "阿尔马维尔",
        "pid": "6605"
      },
      {
        "id": "6607",
        "cname": "阿拉加措特恩",
        "pid": "6605"
      },
      {
        "id": "6608",
        "cname": "阿拉拉特",
        "pid": "6605"
      },
      {
        "id": "6609",
        "cname": "埃里温市",
        "pid": "6605"
      },
      {
        "id": "6610",
        "cname": "格加尔库尼克",
        "pid": "6605"
      },
      {
        "id": "6611",
        "cname": "科泰克",
        "pid": "6605"
      },
      {
        "id": "6612",
        "cname": "洛里",
        "pid": "6605"
      },
      {
        "id": "6613",
        "cname": "塔武什",
        "pid": "6605"
      },
      {
        "id": "6614",
        "cname": "瓦约茨·佐尔",
        "pid": "6605"
      },
      {
        "id": "6615",
        "cname": "希拉克",
        "pid": "6605"
      },
      {
        "id": "6616",
        "cname": "休尼克",
        "pid": "6605"
      },
      {
        "id": "100118",
        "cname": "其他",
        "pid": "6605"
      }
    ]
  },
  {
    "id": "6617",
    "cname": "也门",
    "pid": "",
    "childrens": [
      {
        "id": "6618",
        "cname": "阿比扬",
        "pid": "6617"
      },
      {
        "id": "6619",
        "cname": "阿姆兰",
        "pid": "6617"
      },
      {
        "id": "6620",
        "cname": "贝达",
        "pid": "6617"
      },
      {
        "id": "6621",
        "cname": "达利",
        "pid": "6617"
      },
      {
        "id": "6622",
        "cname": "哈德拉毛",
        "pid": "6617"
      },
      {
        "id": "6623",
        "cname": "哈杰",
        "pid": "6617"
      },
      {
        "id": "6624",
        "cname": "荷台达",
        "pid": "6617"
      },
      {
        "id": "6625",
        "cname": "焦夫",
        "pid": "6617"
      },
      {
        "id": "6626",
        "cname": "拉赫季",
        "pid": "6617"
      },
      {
        "id": "6627",
        "cname": "马里卜",
        "pid": "6617"
      },
      {
        "id": "6628",
        "cname": "迈赫拉",
        "pid": "6617"
      },
      {
        "id": "6629",
        "cname": "迈赫维特",
        "pid": "6617"
      },
      {
        "id": "6630",
        "cname": "萨达",
        "pid": "6617"
      },
      {
        "id": "6631",
        "cname": "萨那",
        "pid": "6617"
      },
      {
        "id": "6632",
        "cname": "赛文",
        "pid": "6617"
      },
      {
        "id": "6633",
        "cname": "舍卜沃",
        "pid": "6617"
      },
      {
        "id": "6634",
        "cname": "塔伊兹",
        "pid": "6617"
      },
      {
        "id": "6635",
        "cname": "希赫尔",
        "pid": "6617"
      },
      {
        "id": "6636",
        "cname": "亚丁",
        "pid": "6617"
      },
      {
        "id": "6637",
        "cname": "伊卜",
        "pid": "6617"
      },
      {
        "id": "6638",
        "cname": "扎玛尔",
        "pid": "6617"
      },
      {
        "id": "100119",
        "cname": "其他",
        "pid": "6617"
      }
    ]
  },
  {
    "id": "6639",
    "cname": "伊拉克",
    "pid": ""
  },
  {
    "id": "6640",
    "cname": "伊朗",
    "pid": ""
  },
  {
    "id": "6641",
    "cname": "以色列",
    "pid": "",
    "childrens": [
      {
        "id": "6642",
        "cname": "阿什杜德",
        "pid": "6641"
      },
      {
        "id": "6643",
        "cname": "贝尔谢巴",
        "pid": "6641"
      },
      {
        "id": "6644",
        "cname": "贝特雁",
        "pid": "6641"
      },
      {
        "id": "6645",
        "cname": "海法",
        "pid": "6641"
      },
      {
        "id": "6646",
        "cname": "霍隆",
        "pid": "6641"
      },
      {
        "id": "6647",
        "cname": "内坦亚",
        "pid": "6641"
      },
      {
        "id": "6648",
        "cname": "特拉维夫",
        "pid": "6641"
      },
      {
        "id": "6649",
        "cname": "耶路撒冷",
        "pid": "6641"
      },
      {
        "id": "100120",
        "cname": "其他",
        "pid": "6641"
      }
    ]
  },
  {
    "id": "6650",
    "cname": "意大利",
    "pid": "",
    "childrens": [
      {
        "id": "6651",
        "cname": "阿斯蒂",
        "pid": "6650"
      },
      {
        "id": "6652",
        "cname": "阿斯科利皮切诺",
        "pid": "6650"
      },
      {
        "id": "6653",
        "cname": "安科纳",
        "pid": "6650"
      },
      {
        "id": "6654",
        "cname": "奥尔比亚",
        "pid": "6650"
      },
      {
        "id": "6655",
        "cname": "奥里斯塔诺",
        "pid": "6650"
      },
      {
        "id": "6656",
        "cname": "奥斯塔",
        "pid": "6650"
      },
      {
        "id": "6657",
        "cname": "巴勒莫",
        "pid": "6650"
      },
      {
        "id": "6658",
        "cname": "巴里",
        "pid": "6650"
      },
      {
        "id": "6659",
        "cname": "贝加莫",
        "pid": "6650"
      },
      {
        "id": "6660",
        "cname": "贝内文托",
        "pid": "6650"
      },
      {
        "id": "6661",
        "cname": "比萨",
        "pid": "6650"
      },
      {
        "id": "6662",
        "cname": "波代诺内",
        "pid": "6650"
      },
      {
        "id": "6663",
        "cname": "波坦察",
        "pid": "6650"
      },
      {
        "id": "6664",
        "cname": "博洛尼亚",
        "pid": "6650"
      },
      {
        "id": "6665",
        "cname": "布拉",
        "pid": "6650"
      },
      {
        "id": "6666",
        "cname": "布雷西亚",
        "pid": "6650"
      },
      {
        "id": "6667",
        "cname": "布林迪西",
        "pid": "6650"
      },
      {
        "id": "6668",
        "cname": "的里雅斯特",
        "pid": "6650"
      },
      {
        "id": "6669",
        "cname": "都灵",
        "pid": "6650"
      },
      {
        "id": "6670",
        "cname": "费拉拉",
        "pid": "6650"
      },
      {
        "id": "6671",
        "cname": "佛罗伦萨",
        "pid": "6650"
      },
      {
        "id": "6672",
        "cname": "福贾",
        "pid": "6650"
      },
      {
        "id": "6673",
        "cname": "卡利亚里",
        "pid": "6650"
      },
      {
        "id": "6674",
        "cname": "卡塞塔",
        "pid": "6650"
      },
      {
        "id": "6675",
        "cname": "卡塔尼亚",
        "pid": "6650"
      },
      {
        "id": "6676",
        "cname": "卡坦扎罗",
        "pid": "6650"
      },
      {
        "id": "6677",
        "cname": "坎波巴索",
        "pid": "6650"
      },
      {
        "id": "6678",
        "cname": "科摩",
        "pid": "6650"
      },
      {
        "id": "6679",
        "cname": "科森扎",
        "pid": "6650"
      },
      {
        "id": "6680",
        "cname": "克罗托内",
        "pid": "6650"
      },
      {
        "id": "6681",
        "cname": "库内奥",
        "pid": "6650"
      },
      {
        "id": "6682",
        "cname": "拉奎拉",
        "pid": "6650"
      },
      {
        "id": "6683",
        "cname": "拉斯佩齐亚",
        "pid": "6650"
      },
      {
        "id": "6684",
        "cname": "莱科",
        "pid": "6650"
      },
      {
        "id": "6685",
        "cname": "莱切",
        "pid": "6650"
      },
      {
        "id": "6686",
        "cname": "雷焦艾米利亚",
        "pid": "6650"
      },
      {
        "id": "6687",
        "cname": "雷焦卡拉布里亚",
        "pid": "6650"
      },
      {
        "id": "6688",
        "cname": "里窝那",
        "pid": "6650"
      },
      {
        "id": "6689",
        "cname": "罗马",
        "pid": "6650"
      },
      {
        "id": "6690",
        "cname": "马萨",
        "pid": "6650"
      },
      {
        "id": "6691",
        "cname": "马泰拉",
        "pid": "6650"
      },
      {
        "id": "6692",
        "cname": "蒙扎",
        "pid": "6650"
      },
      {
        "id": "6693",
        "cname": "米兰",
        "pid": "6650"
      },
      {
        "id": "6694",
        "cname": "摩德纳",
        "pid": "6650"
      },
      {
        "id": "6695",
        "cname": "墨西拿",
        "pid": "6650"
      },
      {
        "id": "6696",
        "cname": "那不勒斯",
        "pid": "6650"
      },
      {
        "id": "6697",
        "cname": "努奥罗",
        "pid": "6650"
      },
      {
        "id": "6698",
        "cname": "诺瓦拉",
        "pid": "6650"
      },
      {
        "id": "6699",
        "cname": "帕尔马",
        "pid": "6650"
      },
      {
        "id": "6700",
        "cname": "帕维亚",
        "pid": "6650"
      },
      {
        "id": "6701",
        "cname": "佩鲁贾",
        "pid": "6650"
      },
      {
        "id": "6702",
        "cname": "热那亚",
        "pid": "6650"
      },
      {
        "id": "6703",
        "cname": "萨莱诺",
        "pid": "6650"
      },
      {
        "id": "6704",
        "cname": "萨萨里",
        "pid": "6650"
      },
      {
        "id": "6705",
        "cname": "萨沃纳",
        "pid": "6650"
      },
      {
        "id": "6706",
        "cname": "塔兰托",
        "pid": "6650"
      },
      {
        "id": "6707",
        "cname": "特拉帕尼",
        "pid": "6650"
      },
      {
        "id": "6708",
        "cname": "特伦托",
        "pid": "6650"
      },
      {
        "id": "6709",
        "cname": "威尼斯",
        "pid": "6650"
      },
      {
        "id": "6710",
        "cname": "韦尔切利",
        "pid": "6650"
      },
      {
        "id": "6711",
        "cname": "维泰博",
        "pid": "6650"
      },
      {
        "id": "6712",
        "cname": "乌迪内",
        "pid": "6650"
      },
      {
        "id": "6713",
        "cname": "锡拉库扎",
        "pid": "6650"
      },
      {
        "id": "6714",
        "cname": "锡耶纳",
        "pid": "6650"
      },
      {
        "id": "6715",
        "cname": "亚历山德里亚",
        "pid": "6650"
      },
      {
        "id": "6716",
        "cname": "伊塞尔尼亚",
        "pid": "6650"
      },
      {
        "id": "100121",
        "cname": "其他",
        "pid": "6650"
      }
    ]
  },
  {
    "id": "6717",
    "cname": "印度",
    "pid": "",
    "childrens": [
      {
        "id": "6718",
        "cname": "艾藻尔",
        "pid": "6717"
      },
      {
        "id": "6719",
        "cname": "班加罗尔",
        "pid": "6717"
      },
      {
        "id": "6720",
        "cname": "本地治里",
        "pid": "6717"
      },
      {
        "id": "6721",
        "cname": "博帕尔",
        "pid": "6717"
      },
      {
        "id": "6722",
        "cname": "布巴内斯瓦尔",
        "pid": "6717"
      },
      {
        "id": "6723",
        "cname": "昌迪加尔",
        "pid": "6717"
      },
      {
        "id": "6724",
        "cname": "达曼",
        "pid": "6717"
      },
      {
        "id": "6725",
        "cname": "第乌",
        "pid": "6717"
      },
      {
        "id": "6726",
        "cname": "甘托克",
        "pid": "6717"
      },
      {
        "id": "6727",
        "cname": "哥印拜陀",
        "pid": "6717"
      },
      {
        "id": "6728",
        "cname": "加尔各答",
        "pid": "6717"
      },
      {
        "id": "6729",
        "cname": "加里加尔",
        "pid": "6717"
      },
      {
        "id": "6730",
        "cname": "贾巴尔普尔",
        "pid": "6717"
      },
      {
        "id": "6731",
        "cname": "贾朗达尔",
        "pid": "6717"
      },
      {
        "id": "6732",
        "cname": "焦特布尔",
        "pid": "6717"
      },
      {
        "id": "6733",
        "cname": "金奈",
        "pid": "6717"
      },
      {
        "id": "6734",
        "cname": "卡瓦拉蒂",
        "pid": "6717"
      },
      {
        "id": "6735",
        "cname": "科希马",
        "pid": "6717"
      },
      {
        "id": "6736",
        "cname": "马埃",
        "pid": "6717"
      },
      {
        "id": "6737",
        "cname": "马杜赖",
        "pid": "6717"
      },
      {
        "id": "6738",
        "cname": "森伯尔布尔",
        "pid": "6717"
      },
      {
        "id": "6739",
        "cname": "特里凡得琅",
        "pid": "6717"
      },
      {
        "id": "6740",
        "cname": "乌代布尔",
        "pid": "6717"
      },
      {
        "id": "6741",
        "cname": "西隆",
        "pid": "6717"
      },
      {
        "id": "6742",
        "cname": "锡尔萨瓦",
        "pid": "6717"
      },
      {
        "id": "6743",
        "cname": "新德里",
        "pid": "6717"
      },
      {
        "id": "6744",
        "cname": "亚南",
        "pid": "6717"
      },
      {
        "id": "6745",
        "cname": "因帕尔",
        "pid": "6717"
      },
      {
        "id": "6746",
        "cname": "印多尔",
        "pid": "6717"
      },
      {
        "id": "6747",
        "cname": "斋普尔",
        "pid": "6717"
      },
      {
        "id": "100153",
        "cname": "其他",
        "pid": "6717"
      }
    ]
  },
  {
    "id": "6748",
    "cname": "印度尼西亚",
    "pid": "",
    "childrens": [
      {
        "id": "6749",
        "cname": "巴厘",
        "pid": "6748"
      },
      {
        "id": "6750",
        "cname": "邦加－勿里洞群岛",
        "pid": "6748"
      },
      {
        "id": "6751",
        "cname": "北苏拉威西",
        "pid": "6748"
      },
      {
        "id": "6752",
        "cname": "北苏门答腊",
        "pid": "6748"
      },
      {
        "id": "6753",
        "cname": "大雅加达首都特区",
        "pid": "6748"
      },
      {
        "id": "6754",
        "cname": "东加里曼丹",
        "pid": "6748"
      },
      {
        "id": "6755",
        "cname": "东南苏拉威西",
        "pid": "6748"
      },
      {
        "id": "6756",
        "cname": "东努沙登加拉",
        "pid": "6748"
      },
      {
        "id": "6757",
        "cname": "东爪哇",
        "pid": "6748"
      },
      {
        "id": "6758",
        "cname": "廖内",
        "pid": "6748"
      },
      {
        "id": "6759",
        "cname": "马鲁古",
        "pid": "6748"
      },
      {
        "id": "6760",
        "cname": "明古鲁",
        "pid": "6748"
      },
      {
        "id": "6761",
        "cname": "楠榜",
        "pid": "6748"
      },
      {
        "id": "6762",
        "cname": "南加里曼丹",
        "pid": "6748"
      },
      {
        "id": "6763",
        "cname": "南苏拉威西",
        "pid": "6748"
      },
      {
        "id": "6764",
        "cname": "南苏门答腊",
        "pid": "6748"
      },
      {
        "id": "6765",
        "cname": "日惹特区",
        "pid": "6748"
      },
      {
        "id": "6766",
        "cname": "万丹",
        "pid": "6748"
      },
      {
        "id": "6767",
        "cname": "西努沙登加拉",
        "pid": "6748"
      },
      {
        "id": "6768",
        "cname": "西苏门答腊",
        "pid": "6748"
      },
      {
        "id": "6769",
        "cname": "西爪哇",
        "pid": "6748"
      },
      {
        "id": "6770",
        "cname": "雅加达",
        "pid": "6748"
      },
      {
        "id": "6771",
        "cname": "亚齐",
        "pid": "6748"
      },
      {
        "id": "6772",
        "cname": "伊里安查亚",
        "pid": "6748"
      },
      {
        "id": "6773",
        "cname": "占碑",
        "pid": "6748"
      },
      {
        "id": "6774",
        "cname": "中加里曼丹",
        "pid": "6748"
      },
      {
        "id": "6775",
        "cname": "中苏拉威西",
        "pid": "6748"
      },
      {
        "id": "6776",
        "cname": "中爪哇",
        "pid": "6748"
      },
      {
        "id": "100284",
        "cname": "其他",
        "pid": "6748"
      }
    ]
  },
  {
    "id": "6777",
    "cname": "英国",
    "pid": "",
    "childrens": [
      {
        "id": "6778",
        "cname": "北爱尔兰",
        "pid": "6777",
        "childrens": [
          {
            "id": "6779",
            "cname": "贝尔法斯特",
            "pid": "6778"
          },
          {
            "id": "6780",
            "cname": "德里",
            "pid": "6778"
          },
          {
            "id": "6781",
            "cname": "利斯本",
            "pid": "6778"
          },
          {
            "id": "6782",
            "cname": "纽里",
            "pid": "6778"
          },
          {
            "id": "100285",
            "cname": "其他",
            "pid": "6778"
          }
        ]
      },
      {
        "id": "6783",
        "cname": "苏格兰",
        "pid": "6777",
        "childrens": [
          {
            "id": "6784",
            "cname": "阿伯丁",
            "pid": "6783"
          },
          {
            "id": "6785",
            "cname": "爱丁堡",
            "pid": "6783"
          },
          {
            "id": "6786",
            "cname": "丹迪",
            "pid": "6783"
          },
          {
            "id": "6787",
            "cname": "格拉斯哥",
            "pid": "6783"
          },
          {
            "id": "6788",
            "cname": "斯特灵",
            "pid": "6783"
          },
          {
            "id": "6789",
            "cname": "因弗内斯",
            "pid": "6783"
          },
          {
            "id": "100122",
            "cname": "其他",
            "pid": "6783"
          }
        ]
      },
      {
        "id": "6790",
        "cname": "威尔士",
        "pid": "6777",
        "childrens": [
          {
            "id": "6791",
            "cname": "班戈",
            "pid": "6790"
          },
          {
            "id": "6792",
            "cname": "卡迪夫",
            "pid": "6790"
          },
          {
            "id": "6793",
            "cname": "纽波特",
            "pid": "6790"
          },
          {
            "id": "6794",
            "cname": "斯旺西",
            "pid": "6790"
          },
          {
            "id": "100286",
            "cname": "其他",
            "pid": "6790"
          }
        ]
      },
      {
        "id": "6795",
        "cname": "英格兰",
        "pid": "6777",
        "childrens": [
          {
            "id": "6796",
            "cname": "埃克塞特",
            "pid": "6795"
          },
          {
            "id": "6797",
            "cname": "巴斯",
            "pid": "6795"
          },
          {
            "id": "6798",
            "cname": "彼得伯勒",
            "pid": "6795"
          },
          {
            "id": "6799",
            "cname": "伯明翰",
            "pid": "6795"
          },
          {
            "id": "6800",
            "cname": "布拉德福德",
            "pid": "6795"
          },
          {
            "id": "6801",
            "cname": "布莱顿与赫福",
            "pid": "6795"
          },
          {
            "id": "6802",
            "cname": "布里斯托尔",
            "pid": "6795"
          },
          {
            "id": "6803",
            "cname": "德比",
            "pid": "6795"
          },
          {
            "id": "6804",
            "cname": "德罕",
            "pid": "6795"
          },
          {
            "id": "6805",
            "cname": "格洛斯特",
            "pid": "6795"
          },
          {
            "id": "6806",
            "cname": "赫尔河畔京斯敦",
            "pid": "6795"
          },
          {
            "id": "6807",
            "cname": "赫里福德",
            "pid": "6795"
          },
          {
            "id": "6808",
            "cname": "剑桥",
            "pid": "6795"
          },
          {
            "id": "6809",
            "cname": "卡莱尔",
            "pid": "6795"
          },
          {
            "id": "6810",
            "cname": "坎特伯雷",
            "pid": "6795"
          },
          {
            "id": "6811",
            "cname": "考文垂",
            "pid": "6795"
          },
          {
            "id": "6812",
            "cname": "兰开斯特",
            "pid": "6795"
          },
          {
            "id": "6813",
            "cname": "里彭",
            "pid": "6795"
          },
          {
            "id": "6814",
            "cname": "利奇菲尔德",
            "pid": "6795"
          },
          {
            "id": "6815",
            "cname": "利物浦",
            "pid": "6795"
          },
          {
            "id": "6816",
            "cname": "利茲",
            "pid": "6795"
          },
          {
            "id": "6817",
            "cname": "列斯特",
            "pid": "6795"
          },
          {
            "id": "6818",
            "cname": "林肯",
            "pid": "6795"
          },
          {
            "id": "6819",
            "cname": "伦敦",
            "pid": "6795"
          },
          {
            "id": "6820",
            "cname": "曼彻斯特",
            "pid": "6795"
          },
          {
            "id": "6821",
            "cname": "南安普敦",
            "pid": "6795"
          },
          {
            "id": "6822",
            "cname": "牛津",
            "pid": "6795"
          },
          {
            "id": "6823",
            "cname": "纽卡斯尔",
            "pid": "6795"
          },
          {
            "id": "6824",
            "cname": "诺丁汉",
            "pid": "6795"
          },
          {
            "id": "6825",
            "cname": "诺里奇",
            "pid": "6795"
          },
          {
            "id": "6826",
            "cname": "朴茨茅斯",
            "pid": "6795"
          },
          {
            "id": "6827",
            "cname": "普雷斯顿",
            "pid": "6795"
          },
          {
            "id": "6828",
            "cname": "普利茅斯",
            "pid": "6795"
          },
          {
            "id": "6829",
            "cname": "奇切斯特",
            "pid": "6795"
          },
          {
            "id": "6830",
            "cname": "切斯特",
            "pid": "6795"
          },
          {
            "id": "6831",
            "cname": "桑德兰",
            "pid": "6795"
          },
          {
            "id": "6832",
            "cname": "圣阿本斯",
            "pid": "6795"
          },
          {
            "id": "6833",
            "cname": "索尔斯堡",
            "pid": "6795"
          },
          {
            "id": "6834",
            "cname": "索福特",
            "pid": "6795"
          },
          {
            "id": "6835",
            "cname": "特鲁罗",
            "pid": "6795"
          },
          {
            "id": "6836",
            "cname": "特伦特河畔斯多克",
            "pid": "6795"
          },
          {
            "id": "6837",
            "cname": "威尔斯",
            "pid": "6795"
          },
          {
            "id": "6838",
            "cname": "韦克菲尔德",
            "pid": "6795"
          },
          {
            "id": "6839",
            "cname": "温彻斯特",
            "pid": "6795"
          },
          {
            "id": "6840",
            "cname": "伍尔弗汉普顿",
            "pid": "6795"
          },
          {
            "id": "6841",
            "cname": "伍斯特",
            "pid": "6795"
          },
          {
            "id": "6842",
            "cname": "谢菲尔德",
            "pid": "6795"
          },
          {
            "id": "6843",
            "cname": "伊利",
            "pid": "6795"
          },
          {
            "id": "6844",
            "cname": "约克",
            "pid": "6795"
          },
          {
            "id": "100123",
            "cname": "其他",
            "pid": "6795"
          }
        ]
      }
    ]
  },
  {
    "id": "6845",
    "cname": "英属印度洋领地",
    "pid": ""
  },
  {
    "id": "6846",
    "cname": "约旦",
    "pid": "",
    "childrens": [
      {
        "id": "6847",
        "cname": "阿吉隆",
        "pid": "6846"
      },
      {
        "id": "6848",
        "cname": "安曼",
        "pid": "6846"
      },
      {
        "id": "6849",
        "cname": "拜勒加",
        "pid": "6846"
      },
      {
        "id": "6850",
        "cname": "杰拉什",
        "pid": "6846"
      },
      {
        "id": "6851",
        "cname": "卡拉克",
        "pid": "6846"
      },
      {
        "id": "6852",
        "cname": "鲁赛法",
        "pid": "6846"
      },
      {
        "id": "6853",
        "cname": "马安",
        "pid": "6846"
      },
      {
        "id": "6854",
        "cname": "马德巴",
        "pid": "6846"
      },
      {
        "id": "6855",
        "cname": "马夫拉克",
        "pid": "6846"
      },
      {
        "id": "6856",
        "cname": "塔菲拉",
        "pid": "6846"
      },
      {
        "id": "6857",
        "cname": "亚喀巴",
        "pid": "6846"
      },
      {
        "id": "6858",
        "cname": "伊尔比德",
        "pid": "6846"
      },
      {
        "id": "6859",
        "cname": "扎尔卡",
        "pid": "6846"
      },
      {
        "id": "100124",
        "cname": "其他",
        "pid": "6846"
      }
    ]
  },
  {
    "id": "6860",
    "cname": "越南",
    "pid": "",
    "childrens": [
      {
        "id": "6861",
        "cname": "海防",
        "pid": "6860"
      },
      {
        "id": "6862",
        "cname": "河内",
        "pid": "6860"
      },
      {
        "id": "6863",
        "cname": "胡志明市",
        "pid": "6860"
      },
      {
        "id": "100523",
        "cname": "其他",
        "pid": "6860"
      }
    ]
  },
  {
    "id": "3859",
    "cname": "朝鲜",
    "pid": "",
    "childrens": [
      {
        "id": "3860",
        "cname": "海州",
        "pid": "3859"
      },
      {
        "id": "3861",
        "cname": "惠山",
        "pid": "3859"
      },
      {
        "id": "3862",
        "cname": "江界",
        "pid": "3859"
      },
      {
        "id": "3863",
        "cname": "开城",
        "pid": "3859"
      },
      {
        "id": "3864",
        "cname": "罗先",
        "pid": "3859"
      },
      {
        "id": "3865",
        "cname": "南浦",
        "pid": "3859"
      },
      {
        "id": "3866",
        "cname": "平壤",
        "pid": "3859"
      },
      {
        "id": "3867",
        "cname": "清津",
        "pid": "3859"
      },
      {
        "id": "3868",
        "cname": "沙里院",
        "pid": "3859"
      },
      {
        "id": "3869",
        "cname": "咸兴",
        "pid": "3859"
      },
      {
        "id": "3870",
        "cname": "新义州",
        "pid": "3859"
      },
      {
        "id": "3871",
        "cname": "元山",
        "pid": "3859"
      },
      {
        "id": "100521",
        "cname": "其他",
        "pid": "3859"
      }
    ]
  },
  {
    "id": "6864",
    "cname": "赞比亚",
    "pid": "",
    "childrens": [
      {
        "id": "6865",
        "cname": "北方",
        "pid": "6864"
      },
      {
        "id": "6866",
        "cname": "东方",
        "pid": "6864"
      },
      {
        "id": "6867",
        "cname": "卢阿普拉",
        "pid": "6864"
      },
      {
        "id": "6868",
        "cname": "卢萨卡",
        "pid": "6864"
      },
      {
        "id": "6869",
        "cname": "南方",
        "pid": "6864"
      },
      {
        "id": "6870",
        "cname": "铜带",
        "pid": "6864"
      },
      {
        "id": "6871",
        "cname": "西北",
        "pid": "6864"
      },
      {
        "id": "6872",
        "cname": "西方",
        "pid": "6864"
      },
      {
        "id": "6873",
        "cname": "中央",
        "pid": "6864"
      },
      {
        "id": "100287",
        "cname": "其他",
        "pid": "6864"
      }
    ]
  },
  {
    "id": "6874",
    "cname": "泽西岛",
    "pid": ""
  },
  {
    "id": "6875",
    "cname": "乍得",
    "pid": ""
  },
  {
    "id": "6876",
    "cname": "直布罗陀",
    "pid": ""
  },
  {
    "id": "6877",
    "cname": "智利",
    "pid": "",
    "childrens": [
      {
        "id": "6878",
        "cname": "阿劳卡尼亚大区",
        "pid": "6877"
      },
      {
        "id": "6879",
        "cname": "阿塔卡马大区",
        "pid": "6877"
      },
      {
        "id": "6880",
        "cname": "安托法加斯塔大区",
        "pid": "6877"
      },
      {
        "id": "6881",
        "cname": "比奥比奥大区",
        "pid": "6877"
      },
      {
        "id": "6882",
        "cname": "复活节岛",
        "pid": "6877"
      },
      {
        "id": "6883",
        "cname": "湖大区",
        "pid": "6877"
      },
      {
        "id": "6884",
        "cname": "科金博大区",
        "pid": "6877"
      },
      {
        "id": "6885",
        "cname": "马乌莱大区",
        "pid": "6877"
      },
      {
        "id": "6886",
        "cname": "麦哲伦-智利南极大区",
        "pid": "6877"
      },
      {
        "id": "6887",
        "cname": "圣地亚哥",
        "pid": "6877"
      },
      {
        "id": "6888",
        "cname": "塔拉帕卡大区",
        "pid": "6877"
      },
      {
        "id": "6889",
        "cname": "瓦尔帕莱索大区",
        "pid": "6877"
      },
      {
        "id": "6890",
        "cname": "伊瓦涅斯将军的艾森大区",
        "pid": "6877"
      },
      {
        "id": "100125",
        "cname": "其他",
        "pid": "6877"
      }
    ]
  },
  {
    "id": "6891",
    "cname": "中非共和国",
    "pid": "",
    "childrens": [
      {
        "id": "6892",
        "cname": "巴明吉-班戈兰",
        "pid": "6891"
      },
      {
        "id": "6893",
        "cname": "班吉直辖市",
        "pid": "6891"
      },
      {
        "id": "6894",
        "cname": "宾博",
        "pid": "6891"
      },
      {
        "id": "6895",
        "cname": "凯莫",
        "pid": "6891"
      },
      {
        "id": "6896",
        "cname": "洛巴伊",
        "pid": "6891"
      },
      {
        "id": "6897",
        "cname": "曼贝雷-卡代",
        "pid": "6891"
      },
      {
        "id": "6898",
        "cname": "姆博穆",
        "pid": "6891"
      },
      {
        "id": "6899",
        "cname": "纳纳-格里比齐",
        "pid": "6891"
      },
      {
        "id": "6900",
        "cname": "纳纳-曼贝雷",
        "pid": "6891"
      },
      {
        "id": "6901",
        "cname": "桑加-姆巴埃雷",
        "pid": "6891"
      },
      {
        "id": "6902",
        "cname": "上科托",
        "pid": "6891"
      },
      {
        "id": "6903",
        "cname": "上姆博穆",
        "pid": "6891"
      },
      {
        "id": "6904",
        "cname": "瓦卡",
        "pid": "6891"
      },
      {
        "id": "6905",
        "cname": "瓦卡加",
        "pid": "6891"
      },
      {
        "id": "6906",
        "cname": "瓦姆",
        "pid": "6891"
      },
      {
        "id": "6907",
        "cname": "瓦姆-彭代",
        "pid": "6891"
      },
      {
        "id": "6908",
        "cname": "翁贝拉-姆波科",
        "pid": "6891"
      },
      {
        "id": "6909",
        "cname": "下科托",
        "pid": "6891"
      },
      {
        "id": "100288",
        "cname": "其他",
        "pid": "6891"
      }
    ]
  }
]

if(typeof window === 'undefined') {
  module.exports = _locations;
} else {
  NKC.configs.locations = _locations;
}
